<<<<<<< HEAD
[
=======
[{
    "name": "Iam Yoga Midtown",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNqfXMZKfoK255bGNkNp3aaj3sEJHnm6kto8Cnl=s1600-w720-h480",
    "rating": 4.2,
    "website": "http://www.iamyoga.ca/",
    "phone": "(416) 920-9642",
    "description": "I have been with Iam Yoga for a year and half now, and the only not so positive thing I have to say is the temperature control in your hot room. While most times I feel the temperature is set at a constant, lately (maybe because of the summer days) it became really frustratingly hot to the point that my skin feels burning whenever in contact with the floor. I also noticed some instructors do adjust the thermostat accordingly during practice, which is much appreciated, but NOT all of them. As a student, I can't really say or do anything in such situations besides having to walk out of the room...",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "680 Yonge Street #2, Toronto",
    "lat": 43.667429,
    "lng": -79.38574899999998,
    "commentfeed": [{
        "text": "I have many positive things to say about this studio: great teachers, nice staff, excellent location and studio, warm and welcoming atmosphere to all level yogis.\nHowever evening and weekend can be really busy at this location as a result popular classes can feel a bit over capacity which compromises the beautiful experience so far. \nI have never been turn down to a class when signing up in the app, but I do believe they should probably start marking classes as \"full\" like other studios do.\nYou set time aside to focus and honor your practice rather than focusing on trying to not hit another yogui involuntarily during class. I am writing this review in hopes that they address this issue. \nThanks for reading this.",
        "rating": 3,
        "usernamefeed": "Alejandra Gonzalez Guel"
      },
      {
        "text": "I first attended Iam Yoga a couple years back through a Groupon promotion. I was a little overwhelmed at first as it was my first experience practicing yoga publicly. That feeling changed quickly the more classes I took. The instructors are all so kind, talented and really care about your well being! After taking a bit of a break from yoga, I came back as an energy exchange student and the experience was fantastic! I really got to experience yoga on a new level and get more involved in the Iam Yoga community. I have met lots of wonderful like-minded people and my whole experience has lead me to join the Yoga Teacher training they offer :)\nI highly encourage everyone to give Iam yoga a chance and to also try to come in on off-peak hours. It can get busy in the evening, but that just shows how great of a place it is! \nThe studio has lots of different teachers and classes to explore so try as much as you can to get the best experience!",
        "rating": 5,
        "usernamefeed": "Jasmynn Taylor"
      },
      {
        "text": "An excellent variety of yoga practices for all levels to experience. At one point they had a teacher giving classes entirely in Sanskrit. \n\nThe staff is courteous and the prices reasonable. They usually offer fairly decent introductory offers if you're new and want to try them out.",
        "rating": 5,
        "usernamefeed": "Jesse Harley"
      },
      {
        "text": "It has a lot of class.\nVarious time,\nPerfect place to practice yoga",
        "rating": 5,
        "usernamefeed": "emmily JOO"
      }
    ]
  },
  {
    "name": "BeHot Yoga Toronto",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNk7aBUaAVTu4KIdR7EwOIypNk_UY7gWkQK_Pfl=s1600-w1024-h1024",
    "rating": 4.7,
    "website": "http://behotyogatoronto.com/",
    "phone": "(416) 203-2382",
    "description": "Clean studio and good teachers. Vinyasa and hitt hot Pilates are the most popular classes and they fill up quickly, you have to book them one week in advance. There aren’t many clases in the morning and there are many students which makes it feel very impersonal. Good place if you’re are lucky to book a class, get a polite greeting, find a spot in the crowded change room and just do your yoga.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "43 Colborne Street, Toronto",
    "lat": 43.648881,
    "lng": -79.37510399999996,
    "commentfeed": [{
        "text": "This is my hot yoga place.  I go weekly and I love the vibe.",
        "rating": 5,
        "usernamefeed": "elle, Persephone"
      },
      {
        "text": "I'm fairly new to yoga but thank to the teachers at this studio I can consider myself a intermediate yogi. Amazing vibe!!!. The staff is wonderful and you can tell how much they love to be there! Always with a big smile on their faces.  They will make you LOVE yoga. Variety of classes and lots of times to fit your schedule. I strongly recommend this studio.",
        "rating": 5,
        "usernamefeed": "Sergio Marchetta"
      },
      {
        "text": "They will take your money and not let you into the class even if arrive on the dot. As a first comer booking through ClassPass you just don't know. Very bad customer experience.",
        "rating": 1,
        "usernamefeed": "Florent Joly"
      },
      {
        "text": "I love coming here best service",
        "rating": 5,
        "usernamefeed": "Jennifer Dawson"
      }
    ]
  },
  {
    "name": "YYOGA Queen Street West",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNNXONt3iAI9UQv_bRYd7fOO9Dnl3O6uiKGzzF1=s1600-w1024-h1024",
    "rating": 4.1,
    "website": "http://www.yyoga.ca/locations/queen-street-west",
    "phone": "(416) 792-2211",
    "description": "I joined Yyoga about 2 years ago from the fall season into spring for 7 months - I'm only writing a review now because of an issue I had recently redeeming my YRewards.  I frequented Yyoga about 3 or 4 times a week while a member and as such I got an email letting me know I had 2 free classes to use with an expiration date of 6 months.  I waited until the last minute to redeem these classes as I had joined another studio and the weekend I decided to go happened to be a long weekend - long story short they wouldn't make an exception or let me use one of my passes, and the person I spoke to on the phone said \"it was a free class anyway.\" This attitude brought back memories less than pleasant with Yyoga staff - they were on the pretentious side.  \nOn a positive note, I really enjoyed their fitness classes like spinning, high intensity interval training mixed with pilates (I think it was called YFit) and their yoga classes were great in teaching the fundamentals.  But, lately, I think there's been turnover and one of the classes I attended on one of the passes was one of the worst ones I had ever taken there.  I still consider myself a novice, but this particular class left me bored out of mind. \n Maybe it was just a one off and the teacher had a particular style that I just didn't get.\n\nI wrote an email to Yyoga Admin on their website and then I also responded to the email that sent me the complimentary passes.  Someone responded right away and added a pass to my account and I was quite pleased, but then I got another email saying that there was nothing they could do.  I'm still hesitant to redeem it given my recent experience taking a class there, dealing with front desk, and getting conflicting emails.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "333 Queen Street West #327, Toronto",
    "lat": 43.64955529999999,
    "lng": -79.39202069999999,
    "commentfeed": [{
        "text": "Plenty of classes for people of all levels. Highly recommend the hot yoga body flow and core workouts if you're looking for a real workout. Classes appeal to males and females and all are welcome.",
        "rating": 5,
        "usernamefeed": "Vips"
      },
      {
        "text": "Am now a member after shopping around, great seniors rates, clean bright, instructors filled with skill and love.  Beautiful interior design, as Architects we value this gorgeously detailed and well thought out studios, washrooms, changing and grooming areas. The air in the hot classes stays fairly fresh, low odours, the ambience is healing, fun, and not too in your face about yoga philosophy. There is every kind of class, from hot to cool, plus fitness,  & spin classes. Ian Jarvie  is a great instructor in all areas. They have a 30 days for $40 pass, good in Toronto Vancouver and Whistler. It's easy to love this place, Queen West or Harbourfront.",
        "rating": 5,
        "usernamefeed": "WinnifredM Hu"
      },
      {
        "text": "Terrific studio which is well lite with natural light, high ceilings, and clean facilities.  If you're looking for the opposite of a dark and dirty yoga studio this is it.\n\nVariety of classes is the best kept secret, in addition to a large number of yoga classes they also offer spin and boot camp (called yfit) classes.  Good instructors too.  Been a member for over 2 years now.",
        "rating": 5,
        "usernamefeed": "Patrick Martin"
      },
      {
        "text": "I bought a 10 class pass earlier this year March I think). As I had bought the pass about 5 minutes before the class started, the girl who sold me the pass did not discuss the pass with me, she sold me the pass and I went right into the room as to ensure I wasn't late for class. I had met a friend there to take the class together (she had a 1 month pass), in front of the girl working the cash register I said to my fiend that I didn't  want to purchase a 1 month pass as I rearely come to yoga. The cashier hearing that did not point out to me that there was any expiration date on the pass.\n\nLong story short: I went to a class last week, the receptionist told me my class package had expired and if I wanted to take the class I needed to pay a drop in class fee. I asked to speak to the manager and nobody was there. She told me she would ask the manager to call me and I have not received a call back. I called again on Friday and left a message for the manager to call me, I received no call back. I tried again yesterday (Monday) and was told there was no one there, management would review my membership and if they decided to honour my membership they would call me, if they wouldn't honour it nobody would call me back. \nI called again today and an answering machine came on.\n\nTheir customer service is terrible, they will not honour your memberships and won't even call you back. It's a shame as I was happy enough with the place but I won't be going back as I feel ignored. It takes a long time to build trust with your clients and you can lose it in a minute.",
        "rating": 1,
        "usernamefeed": "Bonny Greene"
      }
    ]
  },

  {
    "name": "Iam Yoga Downtown",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMwLoWGSeBKSj_n2HFnulJPyomC_48ll844-49t=s1600-w1024-h1024",
    "rating": 4.5,
    "website": "http://www.iamyoga.ca/",
    "phone": "(416) 597-8557",
    "description": "Great service. Love how many different kinds of classes they offer.",
    "amenities": [
      "Parking",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "MetroCentre, 200 Wellington Street W Concourse, Unit 450, Toronto",
    "lat": 43.64585230000001,
    "lng": -79.38786340000001,
    "commentfeed": [{
        "text": "I have gone to several studios throughout the years and never have I felt more at home as I do here and have never seen such results in my practice . The classes are diverse, as are the instructors, and it is a fantastic place to grow your practice . The ambiance is also beautiful and extremely clean. I recommend this studio to beginners and advanced students.",
        "rating": 5,
        "usernamefeed": "A. HR"
      },
      {
        "text": "",
        "rating": 3,
        "usernamefeed": "Maryana Segin"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Grainne Archbold"
      }
    ]
  },
  {
    "name": "Yoga Tree Bay & Dundas",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM5_7e_evM3MLSI7oH7XUgOPPf6Fk6KVd3UCjHd=s1600-w1024-h1024",
    "rating": 4.4,
    "website": "http://www.yogatree.ca/bay-dundas/",
    "phone": "(416) 205-9642",
    "description": "The classes and teachers at this studio are spot on. They offer many different types of classes which I enjoy, from relaxed to more upbeat options for when I'm feeling a little more vigorous. They offer different levels and options for poses in all classes and are consistent in the type of yoga offered depending on the class. They also offer herbal tea and cucumber water which I love. It is very clean and professional. I wish I could respond to some of the less favourable reviews on here because they really aren't fair. It is respectful to show up to class a little early (even 5-10min is fine) and remember to read the class description so you know what type of class to expect. The classes I've attended are described quite accurately and I really enjoy the variety. This is a great studio for the beginner or for someone a little deeper into their practice. If you want a little homier feel, I suggest visiting their Spadina location which is also top notch 👍🏼",
    "amenities": [
      "Parking",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "123 Dundas Street West, Toronto",
    "lat": 43.655337,
    "lng": -79.384481,
    "commentfeed": [{
        "text": "I am a yoga teacher visiting from out of town & I loved this space. The staff were very respectful & helpful when needed & the teachers were very clearly qualified & skilled. Thank you Yoga Tree! Would definitely come back to this location.",
        "rating": 5,
        "usernamefeed": "Divine Roots Yoga"
      },
      {
        "text": "I was visiting from out of town, and this was my first time coming to Yoga Tree. I really enjoyed my time spend here, I attended two classes over the weekend and found the entire staff & teachers to be very welcoming. The space is beautiful, and very clean. I would definatly come back next time I'm in Toronto!",
        "rating": 5,
        "usernamefeed": "camilla zambito"
      },
      {
        "text": "Negative reviews of this place seem to be because people have arrived late and not been let in as the class has started.  I can only speak from my own experience, which has been nothing but excellent for the last three months.  The studios are clean and well maintained, staff have always been friendly and the instructors have been great.",
        "rating": 5,
        "usernamefeed": "Doug Welch"
      },
      {
        "text": "This is the WORST YOGA STUDIO in downtown Toronto, for sure. If you like feeling relaxed during your hot yoga practice and interacting with fellow human beings at reception who understand that life gets in the way sometimes, then DO NOT COME TO THIS LOCATION.\n\nMy friend and I arrived just before a yoga class and due to the unpredictability of life, we were not able to arrive 15 minutes prior to the class as suggested on the website. \n\nThe staff responded to our arrival with such disrespect. I've never been treated with such disrespect. At a yoga studio, nonetheless.\n\nThe girl working the front, and her fellow staff members chatting behind her, regarded my friend and I with disdain as we quickly signed waivers before getting ready for class. I apologized to the girl for being a few minutes late - class was at 7:15, we arrived to the front at 7:13. She shook her head with disapproval and asked if I was already changed. I nodded yes. She directed me to the lockers and I, now feeling the pressure to rush to my yoga practice, quickly misplaced my token. \n\nI rushed back to the desk asking for a new token and the girl responded with sheer disgust by shoving a token into my hand saying, \"You know what, you are already so late for your practice you better just go in\". \n\nAll I have to say is that it is extremely counter-intuitive for a YOGA STUDIO  (or anywhere  for that matter) to disrespect potential clients. I entered my yoga practice feeling guilty and upset like I had disappointed the studio by being their non-ideal client. I'll forever be regretting paying $20 for that drop-in session. \n\nThank goodness that the yoga instructor was very understanding of my tardiness. I only wish that the whole studio would embrace that same positive, warm energy. \n\nI should add that another girl working at the front grunted at my friend who, not knowing where to return her rented mat, tried to return the mat to the front desk. The girl angrily said, \"You return that back there\". We didn't even know what to do with that response. Where is 'back there'? Back where, exactly? \n\nHonestly, nothing could keep us there any longer after that.\n\nI will definitely be practicing yoga elsewhere in the future and spreading the news that this studio has horrible customer service.",
        "rating": 1,
        "usernamefeed": "Quenlin Cain"
      }
    ]
  },
  {
    "name": "Yoga Tree Spadina",
    "image": "https://lh3.googleusercontent.com/p/AF1QipO1wLcnAWWHeNtca_mDJWzoyMheEQ1AnrB1VnBv=s1600-w1024-h1024",
    "rating": 4.5,
    "website": "http://www.yogatree.ca/richmondspadina/",
    "phone": "(416) 603-9642",
    "description": "This is one of my favourite yoga studios! The teachers are great, very friendly and helpful, and the classes are super fun. The studios are beautiful and clean.",
    "amenities": [
      "Parking",
      "Shower",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "140 Spadina Avenue, Toronto",
    "lat": 43.6477442,
    "lng": -79.39624529999998,
    "commentfeed": [{
        "text": "I've been a yogi of yoga tree for over 6 years now and it has been the best studio! \nThe staff are very caring and friendly. The studio is very clean and not cliche like some other downtown yoga studios. They have a really good schedule too. Would recommend!",
        "rating": 5,
        "usernamefeed": "Atina Chang"
      },
      {
        "text": "One of the brightest and most beautiful yoga studios I’ve been to in the city. The teachers are great and I love the environment they’ve cultivated here",
        "rating": 5,
        "usernamefeed": "Kiah Price"
      },
      {
        "text": "GOOD: Friendly staff, overall great yoga teachers with a wide variety of personalities and styles, the most rounded teachers I have found in downtown Toronto so mixing class types is recommended. SUPER Clean. Great location with excellent TTC access. Great schedule on weekdays, Good schedule on weekends (weekends could be better). Self locking lockers.\nBAD: The customers. A lot of the people that go here don't behave and out of all the studios I've been to, Yoga tree is the most lax in enforcing some decorum in their classes. Its common, in my experience, to see people on their cellphone in the studios (thankfully not during class), bringing Starbucks frappucinos and lattes into the studio and being really loud pre and post class. Really hard to relax before or after the class and get into the yoga mood here. I wish the teachers were more willing to confront bad behaviour.\nOVERALL: I really like this studio - the location, the schedule and most of all the teachers make it a winner its just too bad its chock full of stuck up and inconsiderate Queen Westers who can't live without their phone for 2 seconds.",
        "rating": 3,
        "usernamefeed": "Tom J"
      },
      {
        "text": "I love this cozy little studio, the teachers and staff are inviting and supportive.  The classes are challenging and the teachers provide great adjustments and guidance based on your experience, I leave classes feeling energized and refreshed. I always look forward to going to my next class at Yoga Tree.  Jelayna and Angela M. are two my favorite teachers!!",
        "rating": 5,
        "usernamefeed": "Diane Liang"
      }
    ]
  },
  {
    "name": "The Yoga Sanctuary",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNbTliYKVO5e-VpXj73IUyty9EbFgGK_EKaMi_5=s1600-w1024-h1024",
    "rating": 4.4,
    "website": "http://www.theyogasanctuary.ca/",
    "phone": "(416) 928-3236",
    "description": "My favourite yoga studio in Toronto!  The have great specials for new students!",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "1 Wood Street, Toronto",
    "lat": 43.661988,
    "lng": -79.38292999999999,
    "commentfeed": [{
        "text": "This studio has best teachers in the town!! They also cover a wide range of styles of yoga you can pick, and Mysore classes you can practise with teacher’s assistance. In additional warm staff and good location. I took the YTT250 there and it was one of the best experiences I had!",
        "rating": 5,
        "usernamefeed": "Sunnie Yao"
      },
      {
        "text": "Love this place. Lots of great classes, never been disappointed. Lately I've been attending a lot of Trisha Sevilla's classes. She is a wonderful instructor. She is always positive, smiling, and inspiring. Thanks Trisha!",
        "rating": 5,
        "usernamefeed": "Emily McDonough"
      },
      {
        "text": "I completed my YTT here and love the staff, the building and the vibes from TYS!   High quality teachers with zero ego & great intentions. Cynthia is an amazing human & a great leader which sets this place apart from others.",
        "rating": 5,
        "usernamefeed": "Kristy Rachkowski"
      },
      {
        "text": "Wonderful community feel. Loved every class and I've been there since October 2016. The instructors are great. The schedule is awesome too and has extended hours to fit every schedule (so you don't have any excuse not to go haha). Their late night classes from 8:45-10pm are especially great if you have to work late or want something to make you sleep like a baby. I always float home right into bed with a huge smile on my face.",
        "rating": 5,
        "usernamefeed": "Natasha Nesrine"
      }
    ]
  },
  {
    "name": "YYOGA Harbourfront",
    "image": "https://lh3.googleusercontent.com/p/AF1QipO7UWvoEhvY8_6naBArjngBNHN07xHfFIyKD9Df=s1600-w1024-h1024",
    "rating": 3.8,
    "website": "https://yyoga.ca/locations/harbourfront",
    "phone": "(416) 240-6175",
    "description": "Went to my first class here yesterday and loved it! Really nice facility, the teacher was amazing, and the temperature in the room was just right to be challenging but not unbearable! If I wasn’t visiting from out of town, this would be my new go-to yoga studio!",
    "amenities": [
      "Parking",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "350 Queens Quay West #204, Toronto",
    "lat": 43.6386709,
    "lng": -79.38911860000002,
    "commentfeed": [{
        "text": "Cute place, great if you live in the neighborhood. They offer various yoga classes, including hot yoga. They have tea, lockers and offer free yoga mats and other yoga accessories. Friendly staff and instructors. I used to do alot of yoga and more recently I started getting into it and i felt some 'open to beginner classes' were a bit intense, but it's great if you if you're open to that.",
        "rating": 4,
        "usernamefeed": "Tharmila Raja"
      },
      {
        "text": "I came here for hot yoga, but the room's temperature was only a bit warm. Really disappointing, as I get free regular yoga at my gym, and it felt not very different from that. \nThe teacher and facility are great though. I'm sure it's fine for regular yoga, but not hot yoga.",
        "rating": 3,
        "usernamefeed": "Solaris"
      },
      {
        "text": "Staff are great but the class times and scheduling at this location could be improved.",
        "rating": 4,
        "usernamefeed": "Alyssia Armborst"
      },
      {
        "text": "The place is clean and the vibes are great but their hours are ridiculous!! Who are they trying to target with their class times? Rich housewives who have nothing to do all day? They know that most people work 9-5 and they have ZERO MORNING CLASSES, and all their good evening classes start at 5:15 pm or 5:30 pm. There's no way I can make it there straight from work. Definitely not spending my money buying a membership I can't use!",
        "rating": 2,
        "usernamefeed": "Mina Mt"
      }
    ]
  },
  {
    "name": "The Yoga Lounge",
    "image": "https://images.pexels.com/photos/374101/pexels-photo-374101.jpeg",
    "rating": 4.5,
    "website": "http://theyogalounge.net/",
    "description": "The instructor was amazing! I did the vinyasa flow class which was a great workout, and also included a great finishing touch of lavender oil at the end.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "80 Sherbourne Street, Toronto",
    "lat": 43.65227900000001,
    "lng": -79.3688426,
    "commentfeed": [{
        "text": "Yoga Lounge is some of the best yoga in the city of Toronto. The instructors really know what they are doing and they are highly experienced - Particularly Susan, the owner, and Carlyn. Classes are intimate with special attention given to each student. Well worth the price.",
        "rating": 5,
        "usernamefeed": "Elyssa Seidman"
      },
      {
        "text": "I had hit a wall in my journey to get healthy. I was stuck at 223 pounds and could not get below this number for nothing.  So I thought I needed to shake things up and do some HOT YOGA. I went to go try Florence's Friday class at 7pm and then again to her 1pm class on Sunday. I loved it so much that I did her classes on Friday and Sunday again. What happened? I lost 10 pounds in 10 days and got down to 213 pounds!!!\n\nIf you have hit a wall in your weight loss I highly recommend Florence's Hot Yoga class.",
        "rating": 5,
        "usernamefeed": "Mark Makivirta"
      },
      {
        "text": "Great teachers, but the facility is not the best. BBQ style hot yoga heaters (space heaters directly above you)  are not my favourite, and the change rooms are small. besides that the door for the men's change area opens directly into the foyer. They're doing the best they can with such a small space. ",
        "rating": 3,
        "usernamefeed": "Conrad Siebert"
      },
      {
        "text": "It's not your spa like studio.  Lots of plants and resident cat max may not be everyone's cup of tea but there good teachers and I like the naturally lit class rooms Free mats although lots of old ones.  the focus is on hatha and restorative but does have non corporate branded hot yoga too which I didn't like but lots of regular students aren't all wrong. ",
        "rating": 4,
        "usernamefeed": "Lily Hua"
      }
    ]
  },

   {
    "name": "Yoga Netwok of Canada",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPKntiY4A5DnVfgZv9sRGcIwmJgvekL5LhjMJQ=s1600-w1024-h1024",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(416) 662-3785",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "30 Eglinton Avenue West #258, Mississauga",
    "lat": 43.6056743,
    "lng": -79.65275429999997,
    "commentfeed": [{
      "text": "This is good yoga studio. I love it!",
      "rating": 4,
      "usernamefeed": "Alex Parrish"
    }]
  },
  {
    "name": "Hatch Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMQ8N-L9M1Qiu-QL51VDVoiFTbTBsaKolT6QW0y=s1600-w1024-h1024",
    "rating": 4.8,
    "website": "http://www.hatchyoga.com/",
    "phone": "(905) 232-2292",
    "description": "Hatch is a wonderful and welcoming studio! The instructors are lovely, varying class times and a beautiful (+clean) studio. Its a win win! Personally I love and recommend the restorative practice on Mondays at 8pm!",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "626 Burnhamthorpe Road West #202, Mississauga",
    "lat": 43.58023619999999,
    "lng": -79.6500332,
    "commentfeed": [{
        "text": "There aren't enough words to say just how amazing this Yoga studio is! If you are anything like me, a newbie to Yoga, this is the place to start. Setting aside the obvious amazing intro deal of $30 for your first month of unlimited classes, The people and staff are just as amazing. I was so nervous and shy to start this new Yoga journey in fear or not being able to do poses correctly and feeling like an outsider, but every instructor made sure that wasn't the case. They were all so friendly and encouraging I never once felt intimidated. Every class made me feel confident and proud and it made going back more and more that much easier. I'm incredibly sad that I will be moving away and won't be able to take Hatch Yoga with me, but I will definitely be returning on days I am ever back in town. If you ever look at expanding up north, be sure to let me know :) Namaste.",
        "rating": 5,
        "usernamefeed": "Erica Sarasua-Reid"
      },
      {
        "text": "Hatch Yoga is an oasis of serenity in the middle of Mississauga. Every detail is finely tuned so that yogi and yogini of all levels of experience feel at home and get most out of their practice. \n\nThe instructors are knowledgeable, provide variations to accommodate practitioners of different levels, and create a nurturing environment. The class variety is outstanding: there are heated, warm, and non-heated classes that vary from restorative to vinyasa to arm balances. \n\nThirty minutes between classes allow the practitioners to come early (or leave late) and get into that first flow, meditate, or surrender into a relaxation pose. Being able to take a nice nap after restorative classes was a total game-changer for me ;) .\n\nAbove all else, everyone knows everybody by name. You are treated like family: members are initiated into the mysteries of proper alignment in a series of complimentary semi-private classes by the studio director herself. If you never had semi-private or private yoga classes, these will transform your practice. Proper alignment is the key to enjoying the full benefits of the poses, deepening your practice, and preventing injury.\n\nYoga is transformational, and Hatch Yoga is the perfect place for practice.",
        "rating": 5,
        "usernamefeed": "M P"
      },
      {
        "text": "I first heard about this studio from groupon, I really enjoy it! The instructors are fabulous and there’s plenty of class variety. The classes are also smaller and intimate so there’s more 1 on 1 time with the instructors and lots of space for you (I can’t stand when you can barely stretch your arms out due to over crowding). There’s also lots of parking which is a plus. I highly recommend this studio!",
        "rating": 5,
        "usernamefeed": "Jessica S"
      },
      {
        "text": "It is a nice place to practice yoga. They have enough everything to make us feel comfortable. The facility is nice and clean. The instructors are knowledgeable and helpful. The classes are not big so the instructor can look after every single one there. I would recommend this place for someone who are interested in learning yoga.",
        "rating": 5,
        "usernamefeed": "Tri Duong"
      }
    ]
  },

  {
    "name": "Mind to Body Yoga & Fitness",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM66JbtakGhGSzkDx7VfbzOj5xVK_zw-uZTXSZI=s1600-w1024-h1024",
    "rating": 4.8,
    "website": "http://mindtobody.ca/",
    "phone": "(905) 712-9642",
    "description": "Mind to Body is a wonderful and welcoming yoga studio for all. Levels \nGreat teachers that really know their stuff also the members are very friendly \nThis studio is very clean  and  well taken care of \nPritpal is amazing! I did my yoga teachers training here and I was very pleased with the entire program I left the program with such Great knowledge for yoga  and life long friends\nJust try it for a week you won't be disappointed :)",
    "amenities": [
      "Parking",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "75 Watline Avenue #137, Mississauga",
    "lat": 43.6227244,
    "lng": -79.67128819999999,
    "commentfeed": [{
        "text": "I come to Mississauga for business and found this studio when I looked out my hotel window.  \n\nCan’t recommend this place more highly - I’ve taken several of their hot classes and they are amazing.  Not pretentious in the least and very willing to help a novice yogi!!  Just finished tonight’s hot power core class - awesome!\n\nCan’t wait until my next trip up from Massachusetts!!  Namaste.",
        "rating": 5,
        "usernamefeed": "Tanya"
      },
      {
        "text": "I recently completed my Restorative Yoga Teacher Training with Pritpal Singh @ Mind To Body Yoga & Fitness. I highly recommend this studio to anyone who may be interested in yoga certifications, upgrading courses or to simply enjoy the practice & benefits of yoga. The studio itself is  very clean, calming & roomy; any props required are available for use for free. Pritpal was an amazing teacher; she is knowledgeable, interesting, witty, kind & patient. Her warm manner was infectious! Her demonstrations & notes were easy to follow & understand. Originally, I dreaded spending an entire weekend in class but, to my surprise, the training was so enjoyable & interesting that it seemed to be over in the blink of an eye & I ended up wishing it lasted longer! Many thanks for your exceptional guidance Pritpal! All the best, dina",
        "rating": 5,
        "usernamefeed": "Dani Dowle"
      },
      {
        "text": "I just recently completed my 200-HR Yoga Teacher Training here at Mind to Body and can attest to it having been a wonderful experience.  The owner and program coordinator is kind, approachable, understanding, knowledgeable and helpful.  The studio is beautiful, clean and staff is friendly.  Yoga teachers associated with this studio are also great.  Highly recommend checking this place out.",
        "rating": 4,
        "usernamefeed": "Sasha Flows"
      },
      {
        "text": "I have just finished my 60 day intro program and did not hesitate to enrol in an annual membership! Just to echo some of the previous reviews this is an amazing place. The instructors are awesome, you feel supported and guided in each and every class, there is a common bond between all the yogis here no matter what your level is. The variety of classes offered gives you even more opportunity to explore on your yoga journey. I can't imagine practising anywhere else! Thanks everyone for being so friendly and welcoming.",
        "rating": 5,
        "usernamefeed": "Stephen Thomas"
      }
    ]
  },
  {
    "name": "moksha yoga square one",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNfWLe898cP89cDcFqZbBGkVIJcoXpjv3ENA-qm=s1600-w1024-h1024",
    "rating": 4,
    "website": "http://www.mokshayogasquareone.com/",
    "phone": "(905) 232-0165",
    "description": "I love this studio, the teachers and the staff. The classes are amazing. My body and sleep really appreciate it. Thanks... Moksha Yoga Square One =)",
    "amenities": [
      "Parking",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "4175 Confederation Parkway #5, Mississauga",
    "lat": 43.58880299999999,
    "lng": -79.64948729999998,
    "commentfeed": [{
        "text": "The most gracious studio I have ever been to! The staff are super supportive and really care about the people who come in. I hurt myself and couldn't make it in for a week, and without asking they called me to extend my 1 month pass since I hadn't visited in a while. Instantly brightened my day; a true testament to their culture and sense of community.",
        "rating": 5,
        "usernamefeed": "Rachel Cheng"
      },
      {
        "text": "It’s an absolutely wonderful community of people. Sabrina, Pearl, Normando on the drums and the live musicians that come play are fantastic. I highly recommend this facility to anyone that needs to relax and have a peace of mind, and have a great workout! Any issues I ever have the staff know exactly how to handle the issue with the best care.",
        "rating": 5,
        "usernamefeed": "Olivia Ha"
      },
      {
        "text": "The people that work here are very friendly! Something amazing happened to me that I will always remember. I lost a wallet 3 years ago at this location and it was recently found with everything inside intact. Special thanks to Pearl for assisting me.",
        "rating": 5,
        "usernamefeed": "John Lazo"
      },
      {
        "text": "Nice clean studio with good high energy classes. Most of the teachers are very good. The only negative is the parking. Sometimes it's hard to get a place in the underground lot. If you park on the street you have to pay. It's only $2.00 but I really don't want to pay more than what I already have paid to attend class. ",
        "rating": 4,
        "usernamefeed": "Michael Bairstow"
      }
    ]
  },
  {
    "name": "Hot Yoga and Pilates",
    "image": "https://lh3.googleusercontent.com/p/AF1QipP58BLD21NwLVUUtcv-vTXXDrojc-PDy9UOaN3z=s1600-w1024-h1024",
    "rating": 4.7,
    "website": "http://www.hotyogaandpilates.com/",
    "phone": "(289) 521-1468",
    "description": "I enjoy myself every time I come here and also get a killer workout--there is a nice variety of classes and I'm pretty sure I have taken classes with each of the instructors. Everyone is super welcoming and helpful. The studio is always clean and the hot yoga room is top notch! The best part is the sense of community and how the owners, Mike and Lisa, are so passionate about their practice, and really try to make everyone feel welcome walking in. I love the encouraging atmosphere.",
    "amenities": [
      "Parking",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "1170 Burnhamthorpe Road West Unit 28, Mississauga",
    "lat": 43.5679783,
    "lng": -79.66273330000001,
    "commentfeed": [{
        "text": "I've been here a few times with a friend (who comes more often) when they have had a promotion for a free class. Interestingly, both times I came, Mike was teaching the class and both times, when I walked in, he greeted everyone except me, like I was invisible! I felt bad the first time but chalked it up to an oversight. However, the second time it happened I was angry and that is why I'm posting the review. I ended up not signing in at the desk either time, although I know you are supposed to. My friend mentioned some instructors aren't that friendly or helpful but she likes the classes and its close to her house so she comes anyway. She also said that Mike was the owner so I was especially not impressed. Customer service is important even more for owners!\n\nThe classes were okay but I feel they are overpriced even if you buy on a promotion. I go to another yoga studio where we get corrections to our poses much more often, and I prefer it that way. Here, only a few students get corrections even though many people are doing wrong things.\n\nOverall, I would not recommend this place and don't plan on going back for any more free classes. I want to be treated well when I'm doing my yoga.\n\nUpdate: In response to the owner's reply:\n\nHello Lisa,\n\nThank you for your message. You are right in that I did not write the review immediately. I was reminded of my experiences when I got together with my friend yesterday for dinner. You said my review is unfair, I don't agree. For instance, according to her, when she signs in some instructors sometimes just make sure she scans the tag, they don't say hello, they just say thanks when the tag scans. Some instructors don't always say hello when she says hi to them, they just look at her to make sure the tag scans. She would never review your business because you know her and she doesn't want to make it awkward. It's not always friendly but she feels the classes are good for her health.\n\nIt sounds like you are coming up with reasons to excuse Mike for not greeting me when it would have been sufficient just to apologize for it and commit to it not happening again. I didn't \"bother\" to sign in at the desk because he was rude and I didn't want to speak with him. There were a fair amount of people at the free classes but the desk was not crowded either time when I got there and everyone except for me was acknowledged both times. I can't dismiss it as chance both times. Then you are commenting on the date of my review so as to discredit it. Unfortunately your response does not create any good faith, nor does it give me any motivation to return to the studio.",
        "rating": 2,
        "usernamefeed": "Sonia Aryd"
      },
      {
        "text": "I’ve been going to the studio for just over six months and cannot say enough about Mike & Lisa plus their ace staff.  Great facility, wonderful teachers, superb classes, lots of solid advice, and mats + clothing for purchase.   Also a month ago I took both of my kids to one of Lisa’s kids classes and they have now fallen in love with yoga.",
        "rating": 5,
        "usernamefeed": "Grant Padley"
      },
      {
        "text": "A few thoughts on Hot Yoga&Pilates Mississauga.. so now I'm a month and a half into my seventh year of practicing. (and Mike STILL welcomes me!) as do all instructors. If you searched the planet for the person least likely to practice yoga it would be me! Which is exactly the reason I love it. A studio designed for Bikram yoga from the front to the back, from the floor to the ceiling. Not some random cobbled together room with a couple space heaters and a vaporizer from Walmart, offering \"hot yoga\". This is the real deal. Classic 90, 60 for those with time restraints and a couple \"Yin\" classes for good measure. The Hot Inferno Pilates has to be experienced to be believed. Many do both. Or all three. A spotless well managed studio, qualified instructors that always make time to answer questions are the reasons it is consistently voted #1. In fact, if you are thinking of starting a business, you may want to use this one as a template.",
        "rating": 5,
        "usernamefeed": "Frank Ciccone"
      },
      {
        "text": "I've been going to this studio for over 4 years and it is such a great yoga studio. I tried out a few others and when I found Mike and Lisa's studio I felt like I was home. The instructors are fabulous and atmosphere is very welcoming. Nothing but great energy and good vibes.",
        "rating": 5,
        "usernamefeed": "Olivia C"
      }
    ]
  },
  {
    "name": "YogaStudio@Vyaniti Canada",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNLIkOfs6lXHaNVlx0SODhIiEr18Oqiwds1SEJz=s1600-w595-h277",
    "rating": 5,
    "website": "https://yogastudiovyaniticanada.business.site/",
    "phone": "(647) 640-7370",
    "description": "Vyaniti yoga studio headed by Praveen has been spreading the good news about Yoga and its healing powers. Starting from breathing right to correct stretches to healthy eating to sleeping right, managing stress, being energetic and fresh  throughout the day and many more powers of Yoga are taught in Vyaniti. \nI have experienced the healing powers of Yoga and very happy to be part of Vyanti.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "455 Apache Court #102, Mississauga",
    "lat": 43.61866389999999,
    "lng": -79.6488521,
    "commentfeed": [{
        "text": "I had not done a \"real\" yoga for the past five years, so I decided on a restorative class. I couldn't be happier of my decision.  \nI was also really impressed by how much attention yoga instructor (Praveen) paid to my needs and made modifications to avoid back and neck pains. I went through lung problems and was on Ventilator support for 3 weeks. The breathing techniques taught by Praveen really helped me strengthen lungs. Even my doctor is impressed by this improvement.\nOverall this was an incredibly positive experience. I wish I lived closer and attended class in person!",
        "rating": 5,
        "usernamefeed": "Sandhya Rao"
      },
      {
        "text": "I have learnt yoga from various places and practiced on and off. Though I have not taken in person classes with Praveen, the guru at Yogatherapy4all Canada, he has guided me and responded promptly every single time I had a query- be it on asanas or breathing or meditation. He is a living example of the true power of yoga- the inner peace and mental strength he demonstrates vouch for that. He exemplifies selfless giving -teaching and sharing his knowledge with anyone that is interested. If you need a dose of strength or positivity, you know which guru to reach out to!",
        "rating": 5,
        "usernamefeed": "Viji Karthikeyan"
      },
      {
        "text": "This yoga institute is excellent.  Its completely diffrent from the standard North America class of yoga as we leave the yoga class with principles that we can practice in our daily lives.  The yoga instructor / guru takes unbelievable amount of extra time after and before class for questions and any clarifications we need.  I started taking these classes because I experienced lack of energy levels mid-end of day.  But the breathing exercises, particular arsanas, and eating habits I have learnt from this class have helped me so much!  My energy levels have increased dramatically and I am able to get so much out of my day!",
        "rating": 5,
        "usernamefeed": "S Abbas"
      },
      {
        "text": "Yogatherapy4all’s mainly focuses on systematic building of inner strength and inner peace, more importantly how to apply yogic principals in day to day life. One of the important principle is not to stop breathing while performing asana’s which you hold for more counts, only after joining this studio I realised that I would hold my breath while focusing on some issue in daily life. Right breathing is what yoga instructor(Praveen) makes you practice through out the class which you will remember even after class. This studio offers practice schedule based on you needs and health conditions rather than a set of asana’s to be followed by all.\nIn short Yogatherapy4all makes sure every student inculcates yogic principles in daily life and be strong, peaceful, positive, happy 😊 and spread the same around you!!\nI am a happier person now :)\nKudos to amazing class and guru!!",
        "rating": 5,
        "usernamefeed": "Gajelli Jyotsna"
      }
    ]
  },
  {
    "name": "Parivartan Hot Yoga Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNmDCxFAIzl5hqBZ-PW9rvcWd5XlwgG290HPJK2=s1600-w1024-h1024",
    "rating": 4.3,
    "website": "http://www.parivartanyoga.com/",
    "phone": "(905) 897-8680",
    "description": "Really great place to begin or continue advancing your practice. Classes available for all levels. Teachers are very patient and knowledgeable offering a myriad of variations depending on student ability. I have been to  two classes so far and I’m really excited and inspired to continue going as long as I live in this area. \n\nThe studio is really clean and well maintained. The owner Michelle is very responsive and will address any concerns escalated to her in a very urgent, prompt and sincere way! 5 stars for Parivartan 🕉.",
    "amenities": [
      "Parking",
      "Shower",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "350 Burnhamthorpe Road East #5A, Mississauga",
    "lat": 43.6003902,
    "lng": -79.62605280000002,
    "commentfeed": [{
        "text": "Has been my favourite studio for the past 8 years. Amazing, relaxed atmosphere, great instructors. The owner is awesome!!! Thank you Michelle for running this great studio at very competitive pricing ☺",
        "rating": 5,
        "usernamefeed": "Vesna S"
      },
      {
        "text": "Best thing that's ever happened to me when finding this gem of a studio.  Very welcoming and helpful.  I would recommend people to try this studio out.",
        "rating": 5,
        "usernamefeed": "#meandyou Louro"
      },
      {
        "text": "I've always felt welcomed in this studio, and became hooked on yoga after my first class there. I have been practicing here for years, and love the community aspect of the studio. The classes are fun and challenging and everyone is friendly. A great place for beginners and advanced yogis!",
        "rating": 5,
        "usernamefeed": "Cassandra Popescu"
      },
      {
        "text": "Wide variation of instructors and classes. There will be one for your personality type! If you like to be pushed or like to go at your own pace, there is an instructor to motivate you! Michelle and Dino both highly recommended! Also I like there is a non heated room with a perinatal trained instructor for modifications if you are pregnant. The two studios at the Mississauga branch are small, so come early to get your spot in the class! Only wish the rooms were bigger, but the place is very clean and non-intimidating.  ",
        "rating": 5,
        "usernamefeed": "Katherine Kure"
      }
    ]
  },
  {
    "name": "Infinite Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNu6hFRtUW3yP0ko8EL-rqze2eQK_tTi3beiF5D=s1600-w1024-h1024",
    "rating": 3.9,
    "website": "https://www.infiniteyoga.ca/",
    "phone": "(416) 830-3418",
    "description": "Love the studio. I have been practicing here for 5+ years. The staff are wonderful.",
    "amenities": [
      "Parking",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "4870 Tomken Road, Mississauga",
    "lat": 43.625834,
    "lng": -79.62927079999997,
    "commentfeed": [{
        "text": "I have an accruing injuries for playing different kind of sports. I never thought that hot yoga can help my body gain flexibility and help my lower back releases tension and tightness. I been practicing hot yoga at Infinite Yoga Studio for years and I'm glad I did. The community that they created is great. People are nice, they treat you well, I tried different classes and meet different teachers and every one got  different style and practices and mostly respectful to the students. They show modifications, show's how to use props and also they show the proper alignment towards poses. What I really like is they make you are feel welcome every time you come to the studio. They talked to you and pay attention if you have any questions on how to improve your poses. Everyone has a favourite teacher and classes to attend, they alternate teachers and I also go different days and time depending with my availability from work. But ever since I'm glad that Infinite Yoga is part of my community and through yoga it teaches me how to be more aware of my body.",
        "rating": 5,
        "usernamefeed": "Anthony Dimitri"
      },
      {
        "text": "Spent $45 on Uber to go to their New Years 5pm Hot Yoga that they advertised. The place was closed.",
        "rating": 3,
        "usernamefeed": "Lamar Timmins"
      },
      {
        "text": "Highly recommend.\nChange room is clean and well kept. The staff are friendly and approachable. The class size (I go to the afternoon session) is perfect for a beginner like me. The instructors are helpful and offer suggestions and/or corrections so no injuries occur.\nI will absolutely be back again and again!",
        "rating": 5,
        "usernamefeed": "Mzzz Nono"
      },
      {
        "text": "On a delightful Saturday afternoon, I had the pleasure of attending a complementary class at Infinite Yoga in Mississauga. I have a rather thorough history with hot yoga, so I was excited to try a new studio.\nTo speak to the facility itself, it is mid sized with a good \"yoga vibe\". All I mean to say is that it's decorated well, and is somewhat calming. From what I saw, there are two large practice rooms and two change rooms. The mens change room has two small showers and enough space to get your business done, though they've opted for an open shelf rather than lockers. In their defence though, they're not the only studio that doesn't have lockers.\nThe class itself was A-OK. The instructor was a really welcoming lady, who kept the experience light hearted and jovial. The difficulty level of this particular class was more on the introductory side, (which I had no qualms with), but I've got a couple minor beefs. The first may be me nitpicking, but the way that the instructed coached our breathing seemed off. It felt like when the natural next breath was an inhale, she would advise an exhale, and vice versa. Am I high maintenance? Probably. Next up, I found that for a couple poses, the instruction lacked a bit of specificity that some great instructors have. The kind where you can go through the practice solely on vocal instruction and no peeping at your peers. Last up, is the temperature of the room. This is a matter of preference, but I'm definitely a HOT yoga fan. The heat and the humidity were on the lower end.\n\nWith all that being said, I'm generally happy with the experience, but I can't say that this studio stands out amoung other options. If it's convenient for you, go try it out.",
        "rating": 3,
        "usernamefeed": "Kojo Asante"
      }
    ]
  },

  {
    "name": "Balanced Life Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipOEPzf5Pt81EaHiaxzebsvs2OmI6MGsIWyUutx-=s1600-w960-h960",
    "rating": 4,
    "website": "http://www.balancedlifeyoga.ca/",
    "phone": "(905) 428-2300",
    "description": "Started practicing yoga at this studio at a young age. Welcoming, inviting, respectful and inspiring community. Amazing and kind people who create beautifully sequenced classes.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "274 Mackenzie Avenue #250, Ajax",
    "lat": 43.84235160000001,
    "lng": -79.02970979999998,
    "commentfeed": [{
        "text": "Wrong account. Apologies. That's my work account. Here is proper info: After beginning training there I found it is more of a business than a sacred space. Seeing behind the scenes really ruined it for me, I went home crying twice after heavy judgement from Shasta. I was consistently intimidated by the senior staff and felt I had to prove my worthiness which is not in the spirit of yoga. As someone with a disability I was tossed, charged thousands of dollars, and held to an impossibly high standard where I was met with criticism rather than education. The studio has a very fake atmosphere where I consistently felt out of place, even when I was just a student. Overall, I wouldn't recommend...especially for anyone who struggles with any type of special needs or disability.",
        "rating": 1,
        "usernamefeed": "Zee Malvern"
      },
      {
        "text": "The founder Sasha and her team are amazing. Professional, positive and friendly environment. They always make you feel welcomed each time you enter and motivate you to reach your goals. Excellent studio and amazing products. Stories are shared and goals are reached. A must try for all people who want some positivity in their lives. An amazing place to be and learn. Be respectful,friendly and have an open mind to learn from instructors who are experienced and have a passion to teach and answer any questions you may have.",
        "rating": 5,
        "usernamefeed": "Live Learn"
      },
      {
        "text": "Balanced Life yoga completely changed my life for the better. Reiki healing, the various workshop and class offerings along with the Inspiring Spirit 200 hour teacher training - I have been a member of this incredible community for 3 years and as a result my fears have truly dissolved and my life has become abundant and enriching. There is always such a welcoming and comforting positive energy held in this amazing space. I have met lifelong sisters and mentors. Through this community I finally feel I have found my true self and place in this world and I cannot express the gratitude I have to Shasta for attracting and creating such a powerful and amazing community and to all the members and teachers who were called and said yes. I love you all and wish you peace and love always - Anyone with an opportunity to come here, you may not know for what or why- trust in it and I promise you will not regret it!",
        "rating": 5,
        "usernamefeed": "Nadia Y"
      },
      {
        "text": "Cindy's beginner classes are amazing. Great for anyone who has never done yoga, or those who want to really learn the proper way to do things. The drop in classes I've been to have also been fantastic. Very friendly and warm atmosphere.",
        "rating": 5,
        "usernamefeed": "Pia Kaukoranta"
      }
    ]
  },
  {
    "name": "Ahimsa Yoga Whitby",
    "image": "https://lh3.googleusercontent.com/p/AF1QipN0i_os2CWdTSDvhZE4Xq8SwMvrVm11edwLMM2b=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.ahimsayoga.com/",
    "phone": "(905) 999-0429",
    "description": "Love and inclusion radiates out of JP. He teaches from his heart and lives yoga as opposed to just doing yoga. I always love when there is a discussion or learning in a class, and the class I attended was just that. Adjustments are very important to me in a class- to take me deeper and to focus breath. There were two people performing them which was amazing.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "3, 100 Dundas Street West, Whitby",
    "lat": 43.8799405,
    "lng": -78.9423559,
    "commentfeed": [{
        "text": "I really enjoy Rebecca's class, she is doing such a great job.",
        "rating": 5,
        "usernamefeed": "rosemarie reichl"
      },
      {
        "text": "Great yoga studio. Famtastic teachers, classes and workshops. Easy parking.",
        "rating": 5,
        "usernamefeed": "Doug Brick"
      },
      {
        "text": "Wonderful staff and AMAZING classes.  I recommend this studio to all :)",
        "rating": 5,
        "usernamefeed": "Audrianna Martin Del Campo"
      },
      {
        "text": "Friendly , welcoming and very helpful",
        "rating": 5,
        "usernamefeed": "Shelley Shaubel"
      }
    ]
  },
  {
    "name": "Anahata Yoga Therapy",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMJjVkDsPQVE6v4fkxpNCCqUvbYAI5mCx4w-Ukx=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.anahatayogatherapy.net/",
    "phone": "(905) 431-9656",
    "description": "I've never found a better place to do yoga!",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "11 Atkinson Court, Ajax",
    "lat": 43.8602164,
    "lng": -79.01513749999998,
    "commentfeed": [{
      "text": "",
      "rating": 5,
      "usernamefeed": "Rocco Zambri"
    }]
  },
  {
    "name": "Glow Yoga Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipODIxsmkzM6ZSAKO__CBBV5M8FK9c2DQHwrRSLl=s1600-w980-h980",
    "rating": 5,
    "website": "http://www.glowyogastudio.ca",
    "phone": "(905) 668-4569",
    "description": "Fantastic facilities, both on Brock Street and coronation road, and Carol and her team do a fantastic job of providing both fantastic workout and magical energy",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "4535 Coronation Road, Whitby",
    "lat": 43.9183578,
    "lng": -78.9895555,
    "commentfeed": [{
        "text": "This studio is so incredibly beautiful, surrounded by gorgeous nature. Imagine doing yoga in the midst of hearing a water fountain from a pond just outside and the sounds of birds and trees blowing in the wind. I had the opportunity to do a class in the outside studio made of wood surrounded by trees. I also went to a workshop which was filled with the aroma of sacred frankincense. I did another restorative class in the winter and the walk alone down the hill and into the studio was like a trip to heaven. It's just gorgeous and serenity for your mind. The instructors teach from their heart. They are all so kind and provide hands on support. I am so happy to be a part of the studio. I cannot wait to take more classes!",
        "rating": 5,
        "usernamefeed": "Therisita Meditation"
      },
      {
        "text": "Such a great welcoming studio.",
        "rating": 5,
        "usernamefeed": "kelly graff"
      },
      {
        "text": "Need a stretch? Visit Glow Yoga and they will provide you with the Top Notch exercises and advice that you need:) They are trusted, proven by the Top Choice Award survey as they were voted the Top yoga studio in the Durham region..",
        "rating": 5,
        "usernamefeed": "David Silvestre"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Francoise Bosse"
      }
    ]
  },
  {
    "name": "YogaBliss",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM9Y0A2e84LRAl-fn9lbZteumyMXu3bg82fp3k=s1600-w960-h960",
    "rating": 5,
    "website": "http://yogabliss.me/",
    "phone": "(905) 903-9642",
    "description": "I came in with my friend for the first time to Yoga Bliss and immediately were welcomed in. It's always a little nerve wracking entering a new studio, but the environment was so comforting and nonjudgmental. The studio itself is absolutely beautiful, and a true gem to the Whitby core. Our class was lead by Nienke who was a wonderful teacher -very thorough, and knowledgeable. We did Yin yoga -I have insomnia, and at the best of times cannot sleep -by the end of her class I was so relaxed and zen that I could have passed out happily! I can not wait to make this part of my weekly routine!",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "105 Colborne Street West, Whitby",
    "lat": 43.87866100000001,
    "lng": -78.94201399999997,
    "commentfeed": [{
      "text": "",
      "rating": 5,
      "usernamefeed": "stan griffiths"
    }]
  },
  {
    "name": "Livewithspirit.ca",
    "image": "https://lh3.googleusercontent.com/p/AF1QipORn8nHopf2JKs5nJw_7xtAb2vnQ946VSGsMSmW=s1600-w1024-h1024",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(905) 620-1151",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "101 Mary Street West, Whitby",
    "lat": 43.88142999999999,
    "lng": -78.94318199999998,
    "commentfeed": [{
      "text": "This is good yoga studio. I love it!",
      "rating": 4,
      "usernamefeed": "Alex Parrish"
    }]
  },
  {
    "name": "Yoga Group Inc",
    "image": "https://images.pexels.com/photos/374101/pexels-photo-374101.jpeg",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(905) 426-4022",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "Ajax",
    "lat": 43.84666319999999,
    "lng": -79.01916720000003,
    "commentfeed": [{
      "text": "This is good yoga studio. I love it!",
      "rating": 4,
      "usernamefeed": "Alex Parrish"
    }]
  },
>>>>>>> tuesmorn
  {
    "name": "440 Fitness",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPuB0j8s8v82kPjrU0g_Sy5kC6ZVMzbryKJhXTy=s1600-w1024-h1024",
    "rating": 4.7,
    "website": "http://www.fourfortyfitness.ca/",
    "phone": "(905) 639-1440",
    "description": "I couldnt do squats as it was too painful for my knees. After seeing the professionals at 440 fitness I can proudly say I can do squats pain free. The proof is in the pudding. Its the first place I've been to where I get results. Highly recommend.",
    "amenities": [
      "Parking",
      "Showers",
      "Lockers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "442 Pearl St, Burlington, ON L7R 2N1, Canada",
    "lat": 43.3272169,
    "lng": -79.79601389999999,
    "commentfeed": [
      {
        "text": "Great atmosphere. Always clean and nice smelling! The staff are friendly and the place provides a safe and non-judgemental space to work out in. ",
        "rating": 5,
        "usernamefeed": "Vanesa Sale"
      },
      {
        "text": "Osteopathic services are great here.",
        "rating": 4,
        "usernamefeed": "Charyl Brooker"
      }
    ]
  },
  {
    "name": "7th Wave Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMw1nVJbvVmceYNZBemnuWg1iYM3xvrXoAgNJB6=s1600-w960-h960",
    "rating": 5,
    "website": "https://www.7thwaveyoga.com/",
    "phone": "(905) 467-9642",
    "description": "Beautiful Yoga studio! Melinda is such an amazing person! Love all the classes!!",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "468 Brant St 2nd floor, Burlington, ON L7R 2G4, Canada",
    "lat": 43.32682740000001,
    "lng": -79.80002150000001,
    "commentfeed": [
      {
        "text": "The first time I tried yoga was a little over nine months ago and since then have gone from a once a week student to a monthly member and I have never felt better. I don’t just mean physically, but an overall feeling of well being.\nMelinda, both the owner and an instructor at the 7th wave, always says “it’s yoga practice not yoga perfect” so it doesn’t matter whether you are young or old, a beginner or an expert you will never feel out of place in this beautiful and calming yoga studio.\nThere are many different teachers, styles and levels of yoga to choose from so you will be able to find the one that’s right for you. \nStop by and check it out when you are in the neighborhood you will be glad you did.",
        "rating": 5,
        "usernamefeed": "Andrew Taylor"
      },
      {
        "text": "Beautifully designed and decorated yoga space in downtown Burlington. Friendly people and a beautiful space to let go and relax.",
        "rating": 5,
        "usernamefeed": "Kyle Pearce"
      },
      {
        "text": "I recently joined 7th Wave Yoga in Burlington.  I have been advised for years to try yoga, but never had the time or the inclination.  Due to some work and health issues, I was desperate to find something to help me cope with debilitating anxiety. I was extremely nervous to go my very first yoga class as I had visions of feeling awkward and looking like a complete fool in front of what I thought would all be \"perfect students\" who knew every pose and did each to perfection and a teacher that was just barking out poses. I couldn't have been more wrong.  The owner of the studio, Melinda, is one of the most compassionate people I have ever met and I felt welcome from the second I stepped foot in the studio.   The atmosphere is welcoming no matter what level of yoga you're at.  There are young people, middle-aged people and older people who come in;  it's awesome.  I WOULD HIGHLY RECOMMEND GIVING THIS STUDIO A TRY;  it's one of the best things I've ever done for myself.  Melinda is not only kind, but is an amazing teacher who is patient and helpful.  The students that I have met have also been really nice and extremely welcoming.  I suffer with anxiety and Yoga at 7th Wave is actually helping me tremendously with that.  Thank you Melinda for guiding me with kindness to a new chapter in my life.  SO, TO THOSE OF YOU WHO HAVEN'T TRIED 7TH WAVE YOGA BECAUSE YOU'RE NERVOUS, PLEASE DON'T BE - I'M THE POSTER CHILD FOR FEELING THAT WAY, BUT I OVERCAME IT BECAUSE OF THE WAY MELINDA RUNS HER STUDIO.",
        "rating": 5,
        "usernamefeed": "Melanie J"
      }
    ]
  },
  {
    "name": "Be Yoga & Wellness",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNyyblECxhtMgPVM0lHWp4tUijdlhOtzDqZZ3FT=s1600-w736-h311",
    "rating": 4.8,
    "website": "http://www.beyogabe.com/",
    "phone": "(905) 634-5852",
    "description": "Be Yoga is absolutely the best place to practice in Burlington.\n\nThe variety of classes will suit anyone at any yoga level. A great place to practice in clean,  beautiful, and comfortable surroundings.\n\nTry the 30 days for 40 dollars introductory offer and you'll definitely be hooked by the end.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "4031 Fairview St #103, Burlington, ON L7L 2A4, Canada",
    "lat": 43.361108,
    "lng": -79.77936599999998,
    "commentfeed": [
      {
        "text": "I absolutely adore this studio and the lovely people who teach, work and volunteer here! I definitely can't get enough of Lauren's Aerial Yoga classes. They are the perfect blend of fun and relaxation which definitely brings me into the studio more often! Dustin is also such a knowledgeable and encouraging teacher that he makes me want to improve and put more energy into my practice. All in all, great space and great choice to start or continue your practice!  5/5 :D",
        "rating": 5,
        "usernamefeed": "Andrea P"
      },
      {
        "text": "Friendly, knowledgeable spiritually inclined teachers for all ages, hot, regular and aerial.",
        "rating": 5,
        "usernamefeed": "Sunil Vidyarthi"
      },
      {
        "text": "I read the reviews for Be Yoga South and totally agree. Best studio in South Charlotte.",
        "rating": 5,
        "usernamefeed": "Sherrie ODonnell"
      },
      {
        "text": "Nice facility. Warm welcoming staff.\nGreat instructors.\nLots of different class times!",
        "rating": 5,
        "usernamefeed": "Louis Lau"
      }
    ]
  },
  {
    "name": "Chrysalis Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPf-sKfZXgoomSPnGbG4tnTDgqlqXMvJ35Hgil8=s1600-w1024-h1024",
    "rating": 4.6,
    "website": "http://www.chrysalisyoga.ca/",
    "phone": "(905) 319-9111",
    "description": "The studio is very big and impressive! Very clean and friendly people. The classes were just way too large for me. I was one of maybe 20 people. The whole place smelled strongly of insense which gives me migraines and the hot yoga was overwhelmingly hot.  I would have left but they have a pretty intense coming and going policy, I did not feel comfortable. There is also a $2.00 charge to rent a yoga mat.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "4040 Palladium Way #11, Burlington, ON L7M 0V6, Canada",
    "lat": 43.3968,
    "lng": -79.82865700000002,
    "commentfeed": [
      {
        "text": "WELCOME HOME! The best decision of my entire life was to join this incredible community of passionate instructors and fellow yogis. Shanine (the owner) is lovely, so approachable, and passionate. She takes pride in the studio, as do all of the teachers. I was intimidated initially having had no experience but I quickly learned that it didn't matter as we are all on our own path. Fast forward 4 years and I don't know what I would do without them. They have classes for all levels- both hot, reduced heat, and regular temperature rooms. Thank you Shanine, Natalie, Jennifer, Rachel, Amanda, Kaitlyn, Michelle, Johanna, Kristina, Anwar, Justyna, Marion, Sarah B., Karli, Robyn, Stephanie, Angela D., Angela J., Wendy, and Carolyn for your ongoing support and love.",
        "rating": 5,
        "usernamefeed": "Christine Kluczynski"
      },
      {
        "text": "I really enjoyed coming here. Very knowledgable instructors and a nice clean studio. I did find it a bit crowded and cramped some classes but for the most part it was lovely. The staff are very welcoming kind and skilled. They really try to make you feel at home here. I recommended this place for an old neighbour and i swear she lives here now.",
        "rating": 4,
        "usernamefeed": "MiSs MaNdA"
      },
      {
        "text": "Fantstic vibe , loved the classes espicially Caroline she is the best.",
        "rating": 5,
        "usernamefeed": "Nicole Wood"
      },
      {
        "text": "I have been coming here a year now. Super clean yoga studio, friendly staff, well trained, knowledgeble, passionate yoga instructors. This place and the people who work and come here make you feel at home. Thank you Chrysalis! ",
        "rating": 5,
        "usernamefeed": "Nikoletta Szemelveisz"
      }
    ]
  },
  {
    "name": "Moksha Yoga Burlington",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNuP4d6vbyW-v7dy2yUFtH7ut54KFAJc-LYX3R5=s1600-w1024-h1024",
    "rating": 5,
    "website": "https://burlington.mokshayoga.ca/",
    "phone": "(905) 631-9595",
    "description": "I was welcomed warmly and being a rookie at Yoga I felt very comfortable and at ease with the staff. I want to thank Laura for delivering my first class, even though it was core, I definitely felt it during , afterwards and the next day. She made the experience that much more enjoyable and I look forward to my next visit.",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "676 Appleby Line, Burlington, ON L7L 5Y1, Canada",
    "lat": 43.3714818,
    "lng": -79.76181609999998,
    "commentfeed": [
      {
        "text": "Beautiful studio and friendly staff.  I loved Moksha when I was in Toronto and I'm happy to find the same quality  in Burlington.",
        "rating": 5,
        "usernamefeed": "angel charette"
      },
      {
        "text": "Moksha Burlington has great instructors - warm, articulate, knowledgeable, insightful.",
        "rating": 5,
        "usernamefeed": "James Zante"
      },
      {
        "text": "Great studio, amazing instructors. Very clean and welcoming.",
        "rating": 5,
        "usernamefeed": "Michele Johnson"
      },
      {
        "text": "Comfortable and relaxing environment. Lots of class types and times to choose from to mix it up. Good vibes",
        "rating": 5,
        "usernamefeed": "Callie Moore"
      }
    ]
  },
  {
    "name": "Sacred Movement Yoga",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTzAgGXwA-SuaUaaBgSy4Pp1fPc5ta2b6ApPFQogYMgyg8mBD2a9A",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(905) 320-3589",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "1285 Ontario Street, Apt. 303, Burlington, ON L7M 4C4, Canada",
    "lat": 43.32380800000001,
    "lng": -79.80170069999997,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Santosha Yoga",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQS9MuSRxBVnzYYbzYCXYaO0N_K2saBef897N8EU_QzCL5k0H__cg",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(905) 876-4839",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "541 Brant St, Burlington, ON L7R 2G6, Canada",
    "lat": 43.3286133,
    "lng": -79.80178389999998,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Craniosacral & Shiatsu",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcReYkre4lZn2FJKV-YRRDyaLM_t98zs_cWmLiosZGtki7v000uJ",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(905) 634-0444",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "1214 Bellview St, Burlington, ON L7S 1C7, Canada",
    "lat": 43.3184755,
    "lng": -79.80524880000002,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Kinetic Yoga & Pilates",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRT76s1QCmwqRi88DhxP-Zfwz-w6izqzNG09ZO5nh4t8_ENX1ehxg",
    "rating": 5,
    "website": "http://kineticphysiotherapy.ca/",
    "phone": "(905) 637-1414",
    "description": "A great place - started doing Yoga and Pilates after an injury led me to get some physiotherapy here.  (an ounce of prevention is cheaper than a pound of cure)\n\nThe instructors are pretty varied - you can find someone that suits your style easily.  Being a smaller studio they're able to help you when you're not doing something correctly and there's no pressure to do something if you're unable or are working through an injury.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "401 Pearl St, Burlington, ON L7R 2M8, Canada",
    "lat": 43.326443,
    "lng": -79.79423429999997,
    "commentfeed": [
      {
        "text": "This place is so warm and inviting! The teachers are welcoming and experts at offering modifications for different conditions and body types. I always feel at home here. ",
        "rating": 5,
        "usernamefeed": "Eryl McCaffrey"
      }
    ]
  },
  {
    "name": "Ashtanga Yoga Burlington",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRZ2nLnNzxF8PtaXFjXr8ePLjJtKyPrPp3TF6uG32OV-v3NfyOB",
    "rating": 4.9,
    "website": "http://ashtanga-yoga.ca/",
    "phone": "(905) 630-2842",
    "description": "I had taken yoga all over the GTA at various studios, but didn't experience the benefits of yoga until I started taking this class. Brahn is an amazingly good teacher!",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "பர்லிங்டன், அண்டாரியோ L7M 4J8, Canada",
    "lat": 43.38184079999999,
    "lng": -79.7999102,
    "commentfeed": [
      {
        "text": "Amazing and informative instructor! Assists his students with proper alignment and pays attention to ensure that you are in proper positioning. Challenges those that are looking for something a little more, while modifying poses for those that require it. Definitely worth the personal experience of signing up for a class series instead of drop-in's at all the big name studios. Even if you've done yoga for years, this will change the way you practice! ",
        "rating": 5,
        "usernamefeed": "Kaleigh Mullen"
      },
      {
        "text": "I have been going to this particular yoga class for approximately 4 years and really enjoy it.  Brahm is wonderful teacher, always very supportive and knowledgeable.I have a bad back and neck and this class helps keep every thing in alignment and working properly. If I do have some pain when I start the class- by the end class or by the next day the pain is greatly reduced or gone completely. Would definitely recommend this class to all, regardless of their level of yoga experience. ",
        "rating": 5,
        "usernamefeed": "Laura Clark"
      },
      {
        "text": "Brahn's yoga instruction is precise, consistent and easy to understand. I've tried other Yoga classes in the past and this is the best by far. The classes follow a simple pattern so after a few lessons you don't have to worry about which pose is which, and instead just focus and breathe!",
        "rating": 5,
        "usernamefeed": "Andy Brook"
      },
      {
        "text": "Excellent classes!  Best instructor I have ever had.  I highly recommend this class. It is so difficult to find good yoga... this is it!",
        "rating": 5,
        "usernamefeed": "April Smith"
      }
    ]
  },

  {
    "name": "Ahimsa Yoga Whitby",
    "image": "https://lh3.googleusercontent.com/p/AF1QipN0i_os2CWdTSDvhZE4Xq8SwMvrVm11edwLMM2b=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.ahimsayoga.com/",
    "phone": "(905) 999-0429",
    "description": "Love and inclusion radiates out of JP. He teaches from his heart and lives yoga as opposed to just doing yoga. I always love when there is a discussion or learning in a class, and the class I attended was just that. Adjustments are very important to me in a class- to take me deeper and to focus breath. There were two people performing them which was amazing.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "3, 100 Dundas St W, Whitby, ON L1N 2L9, Canada",
    "lat": 43.8799405,
    "lng": -78.9423559,
    "commentfeed": [
      {
        "text": "I really enjoy Rebecca's class, she is doing such a great job.",
        "rating": 5,
        "usernamefeed": "rosemarie reichl"
      },
      {
        "text": "Great yoga studio. Famtastic teachers, classes and workshops. Easy parking.",
        "rating": 5,
        "usernamefeed": "Doug Brick"
      },
      {
        "text": "Wonderful staff and AMAZING classes.  I recommend this studio to all :)",
        "rating": 5,
        "usernamefeed": "Audrianna Martin Del Campo"
      },
      {
        "text": "Friendly , welcoming and very helpful",
        "rating": 5,
        "usernamefeed": "Shelley Shaubel"
      }
    ]
  },
  {
    "name": "Anahata Yoga Therapy",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMJjVkDsPQVE6v4fkxpNCCqUvbYAI5mCx4w-Ukx=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.anahatayogatherapy.net/",
    "phone": "(905) 431-9656",
    "description": "I've never found a better place to do yoga!",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "11 Atkinson Ct, Ajax, ON L1S 5E4, Canada",
    "lat": 43.8602164,
    "lng": -79.01513749999998,
    "commentfeed": [
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Rocco Zambri"
      }
    ]
  },
  {
    "name": "YogaBliss",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM9Y0A2e84LRAl-fn9lbZteumyMXu3bg82fp3k=s1600-w960-h960",
    "rating": 5,
    "website": "http://yogabliss.me/",
    "phone": "(905) 903-9642",
    "description": "I came in with my friend for the first time to Yoga Bliss and immediately were welcomed in. It's always a little nerve wracking entering a new studio, but the environment was so comforting and nonjudgmental. The studio itself is absolutely beautiful, and a true gem to the Whitby core. Our class was lead by Nienke who was a wonderful teacher -very thorough, and knowledgeable. We did Yin yoga -I have insomnia, and at the best of times cannot sleep -by the end of her class I was so relaxed and zen that I could have passed out happily! I can not wait to make this part of my weekly routine!",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "105 Colborne St W, Whitby, ON L1N 1W9, Canada",
    "lat": 43.87866100000001,
    "lng": -78.94201399999997,
    "commentfeed": [
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "stan griffiths"
      }
    ]
  },
  {
    "name": "Balanced Life Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipOEPzf5Pt81EaHiaxzebsvs2OmI6MGsIWyUutx-=s1600-w960-h960",
    "rating": 4,
    "website": "http://www.balancedlifeyoga.ca/",
    "phone": "(905) 428-2300",
    "description": "Started practicing yoga at this studio at a young age. Welcoming, inviting, respectful and inspiring community. Amazing and kind people who create beautifully sequenced classes.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "274 MacKenzie Ave #250, Ajax, ON L1S 2E9, Canada",
    "lat": 43.84235160000001,
    "lng": -79.02970979999998,
    "commentfeed": [
      {
        "text": "Wrong account. Apologies. That's my work account. Here is proper info: After beginning training there I found it is more of a business than a sacred space. Seeing behind the scenes really ruined it for me, I went home crying twice after heavy judgement from Shasta. I was consistently intimidated by the senior staff and felt I had to prove my worthiness which is not in the spirit of yoga. As someone with a disability I was tossed, charged thousands of dollars, and held to an impossibly high standard where I was met with criticism rather than education. The studio has a very fake atmosphere where I consistently felt out of place, even when I was just a student. Overall, I wouldn't recommend...especially for anyone who struggles with any type of special needs or disability.",
        "rating": 1,
        "usernamefeed": "Zee Malvern"
      },
      {
        "text": "The founder Sasha and her team are amazing. Professional, positive and friendly environment. They always make you feel welcomed each time you enter and motivate you to reach your goals. Excellent studio and amazing products. Stories are shared and goals are reached. A must try for all people who want some positivity in their lives. An amazing place to be and learn. Be respectful,friendly and have an open mind to learn from instructors who are experienced and have a passion to teach and answer any questions you may have.",
        "rating": 5,
        "usernamefeed": "Live Learn"
      },
      {
        "text": "Balanced Life yoga completely changed my life for the better. Reiki healing, the various workshop and class offerings along with the Inspiring Spirit 200 hour teacher training - I have been a member of this incredible community for 3 years and as a result my fears have truly dissolved and my life has become abundant and enriching. There is always such a welcoming and comforting positive energy held in this amazing space. I have met lifelong sisters and mentors. Through this community I finally feel I have found my true self and place in this world and I cannot express the gratitude I have to Shasta for attracting and creating such a powerful and amazing community and to all the members and teachers who were called and said yes. I love you all and wish you peace and love always - Anyone with an opportunity to come here, you may not know for what or why- trust in it and I promise you will not regret it!",
        "rating": 5,
        "usernamefeed": "Nadia Y"
      },
      {
        "text": "Cindy's beginner classes are amazing. Great for anyone who has never done yoga, or those who want to really learn the proper way to do things. The drop in classes I've been to have also been fantastic. Very friendly and warm atmosphere.",
        "rating": 5,
        "usernamefeed": "Pia Kaukoranta"
      }
    ]
  },
  {
    "name": "Glow Yoga Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipODIxsmkzM6ZSAKO__CBBV5M8FK9c2DQHwrRSLl=s1600-w980-h980",
    "rating": 5,
    "website": "http://www.glowyogastudio.ca",
    "phone": "(905) 668-4569",
    "description": "Fantastic facilities, both on Brock Street and coronation road, and Carol and her team do a fantastic job of providing both fantastic workout and magical energy",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "4535 Coronation Rd, Whitby, ON L1P 1Y3, Canada",
    "lat": 43.9183578,
    "lng": -78.9895555,
    "commentfeed": [
      {
        "text": "This studio is so incredibly beautiful, surrounded by gorgeous nature. Imagine doing yoga in the midst of hearing a water fountain from a pond just outside and the sounds of birds and trees blowing in the wind. I had the opportunity to do a class in the outside studio made of wood surrounded by trees. I also went to a workshop which was filled with the aroma of sacred frankincense. I did another restorative class in the winter and the walk alone down the hill and into the studio was like a trip to heaven. It's just gorgeous and serenity for your mind. The instructors teach from their heart. They are all so kind and provide hands on support. I am so happy to be a part of the studio. I cannot wait to take more classes!",
        "rating": 5,
        "usernamefeed": "Therisita Meditation"
      },
      {
        "text": "Such a great welcoming studio.",
        "rating": 5,
        "usernamefeed": "kelly graff"
      },
      {
        "text": "Need a stretch? Visit Glow Yoga and they will provide you with the Top Notch exercises and advice that you need:) They are trusted, proven by the Top Choice Award survey as they were voted the Top yoga studio in the Durham region..",
        "rating": 5,
        "usernamefeed": "David Silvestre"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Francoise Bosse"
      }
    ]
  },
  {
    "name": "Livewithspirit.ca",
    "image": "https://lh3.googleusercontent.com/p/AF1QipORn8nHopf2JKs5nJw_7xtAb2vnQ946VSGsMSmW=s1600-w1024-h1024",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(905) 620-1151",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "101 Mary St W, Whitby, ON L1N 2R4, Canada",
    "lat": 43.88142999999999,
    "lng": -78.94318199999998,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "P3 Yoga Zone",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQjZ_wUCB2EPtFJAafpywC_EU8NxAqiw0LTHfufqoBIdZEWbQzg",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(905) 409-8861",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Showers",
      "Lockers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "1050 Brock Rd #20, Pickering, ON L1W 3X4, Canada",
    "lat": 43.835112,
    "lng": -79.06953699999997,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Yoga Group Inc",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTONTYWoU8fMBbiGjZ1hNTfbSbRzX3ntNlt9tVZydJvF56iCOHl",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(905) 426-4022",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "Ajax, ON L1S 3B9, Canada",
    "lat": 43.84666319999999,
    "lng": -79.01916720000003,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Moksha Yoga Ajax",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTjqUMBOgJ4Lj2KVJZZVqcnFHguJDMDBD5BQB1uu2fCTWE5bHxbuA",
    "rating": 4.5,
    "website": "http://pickering.mokshayoga.ca/",
    "phone": "(905) 831-4888",
    "description": "Great place to keep your stress levels all time low.. i love moksha hot yoga classes\nThey do need improvement in yin yoga and meditation but still a good place for yoga over all with nice small studio",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "1099 Kingston Rd, Pickering, ON L1V 1B5, Canada",
    "lat": 43.8279394,
    "lng": -79.09720670000002,
    "commentfeed": [
      {
        "text": "Been coming here for 2 years now and loving the studio more and more each time.  The teachers and staff are friendly and knowledgeable.  Talk to them before and after the class if you have any concerns.  The hot yoga series are challenging yet flexible.   The place is age and gender friendly and I love seeing a diverse class.  If you sign up for an account on the online booking system, you can even earn points and trade for class or yoga wear.   If you are still unsure,  get the intro month pass for a great deal.",
        "rating": 5,
        "usernamefeed": "Yvonne Ouyang"
      },
      {
        "text": "Changed my life",
        "rating": 5,
        "usernamefeed": "Emran Singh"
      },
      {
        "text": "Hot yoga at Moksha rocks, great time everytime",
        "rating": 5,
        "usernamefeed": "Terri J"
      },
      {
        "text": "Great hot yoga. Instructors are really nice and knowledgeable. ",
        "rating": 5,
        "usernamefeed": "Mich D"
      }
    ]
  },
  {
    "name": "Hot Yoga Ajax",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTjqUMBOgJ4Lj2KVJZZVqcnFHguJDMDBD5BQB1uu2fCTWE5bHxbuA",
    "rating": 4,
    "phone": "(905) 426-1998",
    "description": "",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "377 MacKenzie Ave, Ajax, ON L1S 2G2, Canada",
    "lat": 43.84053249999999,
    "lng": -79.02724739999996,
    "commentfeed": []
  },
  {
    "name": "Moksha Yoga Brampton",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMRLbY3UZK1d95nHnnWbeJgDFb2I8SFr-3xFThw=s1600-w768-h960",
    "rating": 4.6,
    "website": "http://www.mokshayogabrampton.com/",
    "phone": "(905) 497-9477",
    "description": "Most amazing yoga facility. The teachers are amazing and the atmosphere is electric. I would highly recommend this place over anywhere else. They have classes for all levels and great timing available. Must try",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "50 Peel Centre Dr #205, Brampton, ON L6T 4G8, Canada",
    "lat": 43.714673,
    "lng": -79.72643599999998,
    "commentfeed": [
      {
        "text": "This is my second home (well, besides work that is)!!! If I can go everyday, I would!  I have been practicing with Moksha Brampton since 2014 and I have tried other moksha locations. Nothing beats my second home.  You are simply the best!  I love the  place, ambiance and most of all the instructors.  All the instructors are excellent!  Staff is very friendly and approachable.  They would go an extra mile to accommodate your needs and concerns.  Thank you everyone!",
        "rating": 5,
        "usernamefeed": "Jen O"
      },
      {
        "text": "Moksha yoga is such a peaceful and open minded place. All the teachers are highly qualified, and teach us something different each class. I highly recommend this place for all level of yoga adepts!!",
        "rating": 5,
        "usernamefeed": "Sophie P"
      },
      {
        "text": "The instructors are helpful and very nice. The studio is very clean and such a nice peaceful environment. I am enjoying my practice thus far and look forward to many more classes.",
        "rating": 5,
        "usernamefeed": "Sarah Singh"
      },
      {
        "text": "This Center is filled with love and kindness. The classes are great and the instructors are thoughtful. Amazing place to practice yoga!",
        "rating": 5,
        "usernamefeed": "Joyce Marri"
      }
    ]
  },
  {
    "name": "Ignite Evolution Fitness",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMrVyUOcD9HoGiGp-OF_8cmlZYohOmgflYP4Es7=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.igniteevolutionfitness.com/",
    "phone": "(905) 867-5889",
    "description": "This studio offers an experience far beyond your average yoga class. It truly lends itself to a mind, body and spiritual transformation. Melanie is an incredible teacher and goes out of her way to make every class memorable. I will never go anywhere else for yoga !",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "10 Henderson Ave #3, Brampton, ON L6Y 2A4, Canada",
    "lat": 43.678311,
    "lng": -79.76342299999999,
    "commentfeed": [
      {
        "text": "Love having this local yoga & fitness studio in my neighborhood. Melanie & all the instructors are welcoming, friendly and knowledgeable. I had no experience when I first started attending classes and I never felt out of place. Melanie has created a community in her studio that is open and fun for everyone.",
        "rating": 5,
        "usernamefeed": "Tara Burke"
      },
      {
        "text": "I echo a lot of what the other reviews say. Great location, competitive pricing, excellent variety of classes, very skilled and experienced teachers. I personally love the AcroYoga class led by Sandra and I think it's quite a unique challenge from anything else I've ever done. Great community in here. Highly recommend trying out classes here.",
        "rating": 5,
        "usernamefeed": "Gavin Demonte"
      },
      {
        "text": "I have been attending this fitness studio for a year, and have loved every moment of the experience. The teachers are extremely knowledgeable, and care about each student's progress. Plus, they are the only studio in Brampton offering AcroYoga, what more could you ask for!",
        "rating": 5,
        "usernamefeed": "Jennifer Yu"
      },
      {
        "text": "Beautiful human, who had created such a safe sanctuary for people to evolve where ever they are in their journey. Melanie genuinely cares and is passionate about coaching and igniting others to pursue more out of themselves. She is a friend and a healer to all that reach. Go get ignited Go evolve, and Go sweat a little.",
        "rating": 5,
        "usernamefeed": "Michael Tiani"
      }
    ]
  },
  {
    "name": "EasternVibes Yoga ",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMW2PnmS8t__BAOggJoZSUfBslUOZGYYWz-GD8u=s1600-w1024-h1024",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(416) 520-2325",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "22 Willow Park Dr, Brampton, ON L6R 2M9, Canada",
    "lat": 43.74747489999999,
    "lng": -79.75338149999999,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Yogacafe.ca",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPtjLWjjNWLQw3mbMEtqrshxeS9LlvIk9Bg7R56=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.yogacafe.ca/",
    "phone": "(416) 833-4738",
    "description": "I attended my first gentle yoga class with Evangeline this morning. I am so glad I did! She is very gentle, thorough in that she is careful to explain all the different angles and difficulties of each pose. The room she uses in quiet and peaceful and there is never any pressure to overextend yourself. Lovely! I am signing up for the spring session.\n\nDiana Aspin",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "46 Wadsworth Cir, Brampton, ON L6Z 1W7, Canada",
    "lat": 43.735631,
    "lng": -79.81092999999998,
    "commentfeed": [
      {
        "text": "I was having neck and shoulder problems that neither acupuncure, Shiatsu nor deep-tissue massage could ease for more than a day or two. A couple of massages from Evangeline took care of the problem. Highly, HIGHLY recommended.",
        "rating": 5,
        "usernamefeed": "Bill Taylor"
      },
      {
        "text": "Everything. Small class. Wonderful instructor who takes everybodies 'failings' into account, precise instructions for every move, personal help at all times!",
        "rating": 5,
        "usernamefeed": "Diana Aspin"
      }
    ]
  },
  {
    "name": "Kaulika Yoga & Pilates",
    "image": "https://lh3.googleusercontent.com/p/AF1QipOOCPSSZO9FLMxGT9msAOQaji0Fg72JW-rUHZE9=s1600-w1024-h1024",
    "rating": 4.9,
    "website": "http://www.kaulikayoga.com/",
    "phone": "(905) 451-9642",
    "description": "I couldn't speak more highly of this yoga studio. All the instructors are so kind and helpful. The classes range from great ones for beginners (Carrie Sage's are really informative while being just challenging enough) to really difficult ones (Cassandra Marcon's Saturday class is rigorous and I find it leaves me in an amazing mood. Miriana Simpraga's classes are incredibly challenging, but well worth it). I find all the class times to be convenient, the space is welcoming and calming. Highly recommend trying out this studio whether beginning or more advanced in your practice.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "57 Mill St N Unit 301, Brampton, ON L6X 1S9, Canada",
    "lat": 43.686613,
    "lng": -79.76696800000002,
    "commentfeed": [
      {
        "text": "For nearly 2 years this place has been my sanctuary!  I love the classes, the teachers and the atmosphere.  There is just  sense of calm and togetherness, whether you are a social butterfly or more reserved (me!) this place is for everyone.  There are classes for everyone - beginners to advanced.  Ursula, Carrie, Rachel, Larissa...amazing teachers!  Thank You Kaulika!!",
        "rating": 5,
        "usernamefeed": "Jess Woods"
      },
      {
        "text": "Such a zen space. Love the Studio and the community of yogis.",
        "rating": 5,
        "usernamefeed": "Lenita Mendes"
      },
      {
        "text": "Truly a place of healing - - to rejuvenate and nurture the self (mind, body and spirit) back to a state of balance.  Instructors are an embodiment of their practice, thus able to affect transformational change to students - breath after breath.  As the saying goes, \"when I change, the world changes\".  Keep up the great work and momentum !!!  Your contribution 🌐 is unlimited ... congratulations! \nLots of thanks, 😇😍 and blessings.\n~ namaste ~ 🙏",
        "rating": 5,
        "usernamefeed": "maristel"
      },
      {
        "text": "This yoga studio has an amazing community and even more amazing teachers. Each with their own style, they work with each student with where their practice is at to make sure that they get the best experience. I don't do yoga anywhere else!",
        "rating": 5,
        "usernamefeed": "Courtney Scott"
      }
    ]
  },
  {
    "name": "Indian Yoga Centre",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNYyQeo1opWR_PmIhuHScZ1RMptJDQbtFMOiB4v=s1600-w1024-h1024",
    "rating": 4.7,
    "website": "http://indianyoga.ca/",
    "phone": "(905) 866-2485",
    "description": "I happened spend some time with Sarabhjit Ji when he visited us Vancouver month ago ,till then i had no faith in Yoga ,but I was severely suffering from back pain due to accident.Thank you Sarabhjit ji for helping me and introducing Yoga in my life I am still doing  and its really helpful.I wish I am in Brampton and attend your classes everyday.Big Thanks",
    "amenities": [
      "Parking",
      "Showers",
      "Lockers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "5 Brisdale Dr #209, Brampton, ON L7A 0S9, Canada",
    "lat": 43.683894,
    "lng": -79.81168200000002,
    "commentfeed": [
      {
        "text": "I am very happy to join Indian Yoga and Meditation Center. It has very nice facilities for Hot Yoga, non heated option is available too.I take this opportunity to thank owner  and all the teachers for being so wonderful, knowledgeable and \"being there\" whenever I need. The center has provided me opportunity to refresh my  yoga practice and start my definite healing journey towards achieving ultimate Divine goal.\nOnce again - feeling grateful, Thanks a lot.",
        "rating": 5,
        "usernamefeed": "Neeta Desai"
      },
      {
        "text": "Great place for beginners to learn and practice yoga.  The studio has a heated room as well as a non-heated room for those who do not want the heat. They offer several sessions during the day allowing you to pick the one that's most convenient. Since they have different teachers conducting different sessions through the week you're sure to learn something new each session. It keeps the sessions from getting repetitive. The size of the studio is large enough to accommodate a sizable number of people yet no so big that the instructor can't pay attention to individuals. Every session I have attended so far has been interesting and fun. Great place to get started on those awesome yoga moves :-)",
        "rating": 5,
        "usernamefeed": "Chaitali Mulay"
      },
      {
        "text": "I've been going to IY for 3 years. On my first day, I was instantly welcomed. I tried all the classes with the different teachers, and each has their own way of teaching and are very dedicated to their practice. I love Sally! She is so receptive to the students and changes the flow of the class to fit the students energy level. I always feel encouraged to do my best by all teachers.",
        "rating": 4,
        "usernamefeed": "Michelle Pagliaro"
      },
      {
        "text": "On a whim I decided to avail of the great  introductory offer and I am very happy I did so. \nThis is a simple, clean and no fuss place purely focusing on delivering good yoga practice. I love the option of heated or regular rooms where one can switch from either even mid class! They have  supportive, dedicated and enthusiastic instructors, each with a different style that makes every class interesting. The owner, Sarabjit, is a pleasure to deal with. \nIf you care about your health and well being, don't procrastinate...start today. \nBTW I'm not paid nor have ties  with this place to write this review. I'm just one satisfied member who wants to share and spread a good word.",
        "rating": 5,
        "usernamefeed": "lorr d"
      }
    ]
  },

  {
    "name": "Hot Yoga Brampton",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcScga-KPgIjlnReXjW2-dxmldmGIXz_SrWGKoQL2mKq4liWYrf0",
    "rating": 4.1,
    "website": "http://hotyogawellnessbrampton.com/",
    "phone": "(416) 220-3987",
    "description": "I gave 1 star because owner is very polite and nice. But he is scared to tell the yoga instructor that they are not doing well.  We go to yoga classes  to learn , not to watch them that they are doing yoga.  Yoga instructor are too fast and they don't care if others can learn or do . She just keep her own stuff . They have to think  that some people are new and they can't do like others.  We go to learn , and if we knew how to do yoga , we will not go there and pay money . They say instructor is there to help u but reality is that they don't help u . They don't even show to how to do . U just have to follow them .",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "2 Automatic Rd, Brampton, ON L6S 6K8, Canada",
    "lat": 43.754578,
    "lng": -79.70834790000004,
    "commentfeed": [
      {
        "text": "I was new to hot yoga and was convinced by a friend to give it a try. I did and have never looked back. I miss it on days when I can't make my class. The studio is very neat and clean, instructors are friendly and with variety of classes, it is a complete experience.\nLove the vibe here sooo relaxing. Sometimes tough but great workouts in Rupa’s classes.",
        "rating": 5,
        "usernamefeed": "Shammi M."
      },
      {
        "text": "I’ve been to many yoga studios in the past but this one so far has been my all time favourite. It’s super clean, very posh and the staff is very nice and welcoming! Their customer service is on point with everything and if your coming for the first time...trust me you will not feel uncomfortable at all. Workouts are better when you have clean and positive environment around you. And the best part is that the studio does not smell bad like other studios in the area... Keep it up guys!👍🏼🙏🏼",
        "rating": 5,
        "usernamefeed": "Sukhraj Nirwan"
      },
      {
        "text": "Great design of the studio, very clean, doesn't smell like other places I've been, and friendly staff. Great first experience! Just a little busy but didn't seem to matter during the class. Great core at the end 😃 ",
        "rating": 4,
        "usernamefeed": "Stephanie Bellissimo"
      },
      {
        "text": "Excellent studio, instructors and staff....",
        "rating": 4,
        "usernamefeed": "gary Gill"
      }
    ]
  },
  {
    "name": "The Eternal Yogi",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcToqMBbbvefac9sNhB9Rh3Sttl0N3OkiVCRKQm7lAmxhGQu8_5v",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(226) 998-1818",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "65 Brickyard Way #83, Brampton, ON L6V 4M2, Canada",
    "lat": 43.7016219,
    "lng": -79.7801895,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Harmony Yoga Centre",
    "image": "https://lh3.googleusercontent.com/p/AF1QipN8me8fYVU6J93XXmJE7mHWewIHCvonrKzCzerC=s1600-w1024-h1024",
    "rating": 4.7,
    "website": "http://www.harmonyyogacentre.com/",
    "phone": "(905) 488-5709",
    "description": "I got terrible back pain from work. I went for physio, and tried every other possible solutions to my problem. I went to yoga here just for one day, and I started feeling better and I am happy to say that as of now my back pain is completely cured! Thanks to HYC!",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "57 Mission Ridge Trail, Brampton, ON L6P 0B5, Canada",
    "lat": 43.78662229999999,
    "lng": -79.67945889999999,
    "commentfeed": [
      {
        "text": "A perfect place to unwind and relax oneself with yoga poses. And get rejuvenated with meditation,breathing techniques and supreme knowledge. The instructor (Dhiren) is very passionate about sharing his love for yoga with others, his classes offer everyone the chance of learning new things. He has playful approach to encourage people to live in positivity. I was suffering with thyroid from last 5 years after practicing yoga from almost 15 months has only made it better. Yoga improves all over health . Check out harmony yoga classes for great adventure.",
        "rating": 5,
        "usernamefeed": "Rupal b Babbar"
      },
      {
        "text": "I have been going to these classes for over a year now and I honestly think it's amazing!! The instructor, Dhiren, does an extraordinary job catering towards each student's needs and abilities and assists to achieve each of their personal goals. I stopped my gym membership after starting these classes as I feel yoga does more wonders to my health than the gym ever did! I would totally recommend this to anyone!!",
        "rating": 5,
        "usernamefeed": "Tharsika Paramsothy"
      },
      {
        "text": "I have had the pleasure of attending Yoga classes at Harmony Yoga Centre and it has been enlightening and enjoyable! Our Instructor Dhirenbhai leads his Yoga classes creatively by pulling together his vast experience and study of many types of yoga and building a flowing sequence that is both beneficial to the students and a whole lot of fun! He has a great sense of humor and will often begin the session with warm-ups followed by an energetic mix of well planned targeted poses. His ability to connect with the students is whole and instinctual, making his teaching that much more potent and alive. \nI highly recommend attending class at Harmony Yoga Centre. I guarantee that you will learn a lot and have so much fun in the process!",
        "rating": 5,
        "usernamefeed": "James Webb"
      },
      {
        "text": "After my graduation in 2014, I was kind of lost during the recession period. I was searching for a purpose and goal in life. Yoga came to the rescue. I started yoga at Harmony Yoga Centre in May 2014. Ever since then, yoga has brought a very positive change. It helped me define a goal in life. Also, it helped me remove negative thoughts. I see huge health benefits and it helped eliminate stress. I would recommend Harmony Yoga Centre to everybody. The earlier you start the better!!",
        "rating": 5,
        "usernamefeed": "Siddharth Lawande"
      }
    ]
  },

  {
    "name": "Ahimsa Yoga Courtice",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM23rhYKFqNhBs3lKfIudFt10kR9wyncIhF_-TQ=s1600-w640-h427",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(289) 385-0010",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "1430 Pebblestone Rd, Courtice, ON L1E 2K5, Canada",
    "lat": 43.9298471,
    "lng": -78.82018419999997,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Yoga Jungle Aerial Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPP0KnFVaYS7xH4MeAXxZzQdcVXqavTZEXN-OtU=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.yogajungle.ca/",
    "description": "Jenna is such an incredible teacher - making you feel completely at ease with the hammock and so encouraging! Her space is absolutely gorgeous, fresh white industrial loft vibe with soft twinkle lights and tons of plants. You won't be disappointed!",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "182 Wellington St, Bowmanville, ON L1C 1W3, Canada",
    "lat": 43.9163348,
    "lng": -78.69526810000002,
    "commentfeed": [
      {
        "text": "Amazing flow, BEAUTIFUL studio, and really great energy all together!",
        "rating": 5,
        "usernamefeed": "Angelica M"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Nik Bayley"
      }
    ]
  },
  {
    "name": "Power Yoga Canada Oshawa",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPzlKjn2CLF99TxDGpRsrMmdSD8OMtYatXMSb8W=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://poweryogacanada.com/oshawa/",
    "phone": "(905) 240-7926",
    "description": "THIS PLACE has changed my life! I started here 4 years ago and wow what an amazing community. The energy of this space is felt the moment you walk in. I have been teaching here for the last 3 years now and it's my second home. There is nowhere like it! Come check out the amazing teaching and energy exchange staff. You will not only gain strength and flexibility in your practice but you will make some connections that last a lifetime ",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "866 Taunton Rd W #1, Oshawa, ON L1L 0P1, Canada",
    "lat": 43.926182,
    "lng": -78.911203,
    "commentfeed": [
      {
        "text": "Love Power Yoga Oshawa!  The studio is amazing.  Kelly and Denise are amazing, so encouraging and supportive.  I was intimidating about trying hot yoga but now I'm hooked.  What a great and supportive community of people.  Can't imagine going anywhere else.",
        "rating": 5,
        "usernamefeed": "R Dm"
      },
      {
        "text": "Power Yoga Canada in Oshawa literally changed my life! The people there are so welcoming & friendly. It makes me smile just to walk through the door. I have made so many amazing friends & love the way I feel so rinsed & clear after a class🙏🏽",
        "rating": 5,
        "usernamefeed": "Morgan McPhee"
      },
      {
        "text": "The best place in the world! Best people in the world! My second home. Such a good workout and everyone is so welcoming and friendly. If you're on the fence, don't be. Just go! You won't regret it.",
        "rating": 5,
        "usernamefeed": "Lindsay Hogg"
      },
      {
        "text": "Power Yoga Canada Oshawa offers such an inclusive and positive environment for all who enter the studio! Regardless of any prior experience, or lacking of, their is a a class accessible to you! Overall, LOVE this studio and I am so glad to have found such an amazing and supportive community!",
        "rating": 5,
        "usernamefeed": "Jade Stephenson"
      }
    ]
  },
  {
    "name": "Ahimsa Yoga Whitby",
    "image": "https://lh3.googleusercontent.com/p/AF1QipN0i_os2CWdTSDvhZE4Xq8SwMvrVm11edwLMM2b=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.ahimsayoga.com/",
    "phone": "(905) 999-0429",
    "description": "Love and inclusion radiates out of JP. He teaches from his heart and lives yoga as opposed to just doing yoga. I always love when there is a discussion or learning in a class, and the class I attended was just that. Adjustments are very important to me in a class- to take me deeper and to focus breath. There were two people performing them which was amazing.",
    "amenities": [
      "Parking",
      "Showers",
      "Lockers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "3, 100 Dundas St W, Whitby, ON L1N 2L9, Canada",
    "lat": 43.8799405,
    "lng": -78.9423559,
    "commentfeed": [
      {
        "text": "I really enjoy Rebecca's class, she is doing such a great job.",
        "rating": 5,
        "usernamefeed": "rosemarie reichl"
      },
      {
        "text": "Great yoga studio. Famtastic teachers, classes and workshops. Easy parking.",
        "rating": 5,
        "usernamefeed": "Doug Brick"
      },
      {
        "text": "Wonderful staff and AMAZING classes.  I recommend this studio to all :)",
        "rating": 5,
        "usernamefeed": "Audrianna Martin Del Campo"
      },
      {
        "text": "Friendly , welcoming and very helpful",
        "rating": 5,
        "usernamefeed": "Shelley Shaubel"
      }
    ]
  },
  {
    "name": "Lava Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNI6tHjEsfaphi3c7LpCXjU6fRpIHoAf0lao7hk=s1600-w1024-h1024",
    "rating": 4.8,
    "website": "http://www.lava-yoga.com/",
    "phone": "(905) 725-5282",
    "description": "Great brand new space right in the heart of downtown Oshawa! Once you enter, the outside sounds are dull at most. Beautifully remodeled after having been a bank space for so long.  Only yoga studio I’ve been to on ground level ... unique and accessible ... no stairs to navigate!  Energy in the space is very inviting, warm and clean. Staff are very friendly. The salad & smoothie bar is going to be a great feature once opened. Nice variety of classes available on the schedule. Plenty of parking.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "1 Simcoe St N, Oshawa, ON L4G 1R7, Canada",
    "lat": 43.89786669999999,
    "lng": -78.86354340000003,
    "commentfeed": [
      {
        "text": "Very welcoming atmosphere. Got a hug on my first visit! Thank you!",
        "rating": 5,
        "usernamefeed": "Jonathan French"
      },
      {
        "text": "Lava yoga is a wonderful place where compassionate and open minded community is being created. Oshawa needed this.  Great location for the corporate world to take a break from office and do yoga at lunch.  Amazing instructors. Powerful classes.  Super friendly staff.  Love Lava!",
        "rating": 5,
        "usernamefeed": "Ivona Stefanski"
      },
      {
        "text": "Genuine and Helpful. \nI have been coming to the studio 5 times per week since Lava opened because I value the ownership, the instructors, and the facility. Lava has exceeded my expectations. I found that people here are down to earth, and the instructors encourage this same attitude in their patrons. I find the classes are helping me sink into deeper levels of healing in my physical, emotional, and energetic 'bodies'. Each class is well structured with common threads that link movements together, amd also provides enough variety for the avid attender to always feel like they are growing in their practice. I am also very thankful for a number of simple and kind gestures made by the staff. These have made me see that Lava brings MORE than just a business to downtown Oshawa, but also a the vibration of joy. I feel content, nourished, and safe here.",
        "rating": 5,
        "usernamefeed": "Maygen"
      },
      {
        "text": "Awesome yoga studio. The instructors are great and you get an excellent workout. Good vibes and a friendly environment here - would recommend to everyone (even beginners). A+",
        "rating": 5,
        "usernamefeed": "Kevin DeMara"
      }
    ]
  },
  {
    "name": "ReSoulution Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNt0xKqyqweJKC95MLIryyGw0qJjsGfKkx0LDly=s1600-w1024-h1024",
    "rating": 4.7,
    "website": "http://resoulution.ca/",
    "phone": "(289) 600-2929",
    "description": "Great instructors. They are all friendly and welcoming and treat everyone with kindness and respect. The teachers are great at guiding you into poses and given tips to help get into more challenging poses. They always go the extra mile to help you get the most out of your class. The teachers even give wonderful neck, shoulder or head massages  to finish a class. A treat to attend these classes! Also a great variety in terms of styles and levels of difficulty.",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "98 King St W, Bowmanville, ON L1C 1R2, Canada",
    "lat": 43.9130483,
    "lng": -78.69196420000003,
    "commentfeed": [
      {
        "text": "I have been seeing Romy for several months now for my lash extensions. I wouldn't go anywhere else! She is so thorough and detail-oriented, so I always leave with perfect lashes. The whole experience is very relaxing. Highly recommend - 10/10!",
        "rating": 5,
        "usernamefeed": "Jennifer McNish"
      },
      {
        "text": "Awesome yoga! \nFrom beginner to advanced classes are available for all levels.  The instructors are knowledgeable, professional  and friendly. \nIf you have never practiced yoga the beginner series offered by the owner Jana is a perfect introduction to the practice of yoga.  If you are a seasoned yogie the hot advanced classes are amazing!\nThe spa is spotless and professional.",
        "rating": 5,
        "usernamefeed": "Kate Kunath"
      },
      {
        "text": "I am blessed to have this Studio right in my hometown. From the moment you walk in you are made to feel welcome. The Owner & her Teachers are knowledgeable, kind, caring, truly want you to have the very best experience, without judgement. I cannot recommend trying this studio out, a variety of classes & times from beginner to advanced. Jana’s Studio is my Happy Place.",
        "rating": 5,
        "usernamefeed": "Dorothy Afonso"
      },
      {
        "text": "Very poor spa services that was given in past , not worth the money that was charged. The owner will ignore you for a while hoping you will give up and go away, until you are persistent and do not give up until she responds , she will finally respond to a complaint or issue but weeks or a good month later on, but do not give up, call if the emails are being ignored. You have to be persistent with this management style, and if no response, you can always report this business behaviour as most businesses should be responsible and respond right away to complaints and issues .",
        "rating": 1,
        "usernamefeed": "Lilly S"
      }
    ]
  },
  {
<<<<<<< HEAD
    "name": "Wendy's Gentle Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMIaDmuXMApJfLgMJUMx7uy0FrHzzay_AcJ_54w=s1600-w1024-h1024",
=======
    "name": "Redwood Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNvBwo2O0TGjMnuN4dNeta__VwEWATGl-3Bnxmw=s1600-w990-h503",
>>>>>>> tuesmorn
    "rating": 5,
    "website": "http://wendysgentleyoga.ca/",
    "phone": "(289) 927-3340",
    "description": "Wendy's Gentle Yoga has helped me in regaining  my flexibility, moving with ease and reduction of pain. Her talent for adjusting the lesson for the needs of each person in the class is inclusive and positive. Wendy's studio has  a significant amount of props so there is no need for personal financial investment or need to carry props and equipment to class. You will love how easy your stride is after a class.",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "1050 Grandview St N, Oshawa, ON L1K 2L3, Canada",
    "lat": 43.931768,
    "lng": -78.835647,
    "commentfeed": [
      {
        "text": "I am proud to say I am Wendy's first student.  In 2008 I fell 15 ft sustaining a burst L1fracture.  Two years later my fracture was well healed but I still had a fair amount of discomfort. I had never done  a yoga class so I started with private classes. Wendy was very patient and with the use of props I was able to get in most poses.\n\nWendy is constantly learning and sharing her knowledge with her students.\n\nWendy's studio is still my happy place 6 years later.",
        "rating": 5,
        "usernamefeed": "Patti Watson"
      },
      {
        "text": "Wendy is a fantastic yoga teacher. I've been going with my girlfriend for a few years now- very welcoming to guys and appropriate for all levels of experience. I had no experience when I started and have learnt to relax and enjoy it. Highly recommend it!",
        "rating": 5,
        "usernamefeed": "jordan Michaud"
      },
      {
        "text": "I was new to yoga when I first met Wendy 2 years ago, and was not sure I could do yoga with arthritis and degenerative disk disease.  Wendy changed that as she consistently customizes her yoga for each & every student in the class!  I have noticed such a difference in my physical condition, but one of the best things about yoga with Wendy is the emotional/spiritual support she provides.  I am lucky to be a student of Wendy's!",
        "rating": 5,
        "usernamefeed": "Cathie Ketcheson"
      },
      {
        "text": "Wow! If I knew yoga could be like this I would have started years ago! Wendy is amazing and so attentive to each student. I went in to her class skeptical but came out feeling rejeuventated and relaxed! I highly recommend Wendy's yoga studio to everyone!",
        "rating": 5,
        "usernamefeed": "Holly Davies"
      }
    ]
  },
  {
    "name": "Lotus Yoga Studio",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR_ANSx2fJthaB-aOW1nIMxYjs7Gqrg5nfQ3-pM1Wu-eOxCsIH2pg",
    "rating": 5,
    "phone": "(905) 449-8612",
    "description": "Absolutely loved the yoga classes at the Lotus Blossom. The studio has a very calming atmosphere. Beautiful place to do yoga and meditate!",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "78 John Walter Crescent, Courtice, ON L1E 2W7, Canada",
    "lat": 43.900384,
    "lng": -78.78925500000003,
    "commentfeed": []
  },
  {
    "name": "Moonstone Healing Arts",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRp-a7b9Ziv_cXdpUZqi-2OYEdRqHmx5UO44qOMMpW0Da2wnkUoqQ",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(905) 429-0257",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "Ovens Rd, Newtonville, ON L0A 1J0, Canada",
    "lat": 43.932233,
    "lng": -78.49989800000003,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Clarington Fitness Centre",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNvyOIykcw_y2xs9KDkJePqDjtY9XcWpGTQIRWO=s1600-w251-h251",
    "rating": 4.5,
    "website": "http://www.claringtonmartialarts.com/",
    "phone": "(905) 697-1473",
    "description": "We were at the self defense class tonight.  The class was incredibly powerful.  Karen was fantastic.  We didn't just learn \"moves\".  We also talked about mindset which I found unexpected and perhaps even more informative.  I highly recommend this class and look forward to talking the next one.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "234 King St E, Bowmanville, ON L1C 1P5, Canada",
    "lat": 43.9116818,
    "lng": -78.67660109999997,
    "commentfeed": [
      {
        "text": "Clean facility and friendly staff!",
        "rating": 5,
        "usernamefeed": "michelle watton"
      },
      {
        "text": "I am a current CMA member I've been doing it for 5 years the belts are super easy to get because I am three belts away from Black",
        "rating": 5,
        "usernamefeed": "DTNG"
      },
      {
        "text": "Our family has had experience with other martial arts places in Clarington, and we have found CMA to be the most established and professional. Karen has extensive experience in martial arts and sports in the area and brings that wealth of knowledge to CMA. Her students always seem happy and engaged. It's a great family place at a great location.",
        "rating": 5,
        "usernamefeed": "Dana Grant"
      },
      {
        "text": "I am currently a student in this place and i love it the staff are welcoming and you don't feel awkward at home, i get a stripe almost every week because I went to belt criteria class, over all probably the best martial arts gym I have went to, the best part is that they have judo taekwondo and boxing",
        "rating": 5,
        "usernamefeed": "Nathaniel Manoj"
      }
    ]
  },

  {
    "name": "Chandra Yoga Shala",
    "image": "https://lh3.googleusercontent.com/p/AF1QipN_zoiJazVNzIMWNL1v9oOgIpsgeCTh1K64VFep=s1600-w323-h323",
    "rating": 5,
    "website": "http://www.chandrayogashala.com/",
    "phone": "(416) 259-7101",
    "description": "Just excellent. The best class I've taken.",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "200 Evans Ave Unit 101, Etobicoke, ON M8Z 1J7, Canada",
    "lat": 43.6185538,
    "lng": -79.51386660000003,
    "commentfeed": [
      {
        "text": "Best Ashtanga studio in Etobicoke. Traditional practice, experienced teachers and big sense of community.  Highly recommend.",
        "rating": 5,
        "usernamefeed": "florent balsez"
      }
    ]
  },
  {
    "name": "Moksha Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMJYbl8ha_UUmCSSwoRguQBXTMbQ2H1_hh1p6T6=s1600-w1024-h1024",
    "rating": 4.6,
    "website": "http://www.mokshayogaetobicoke.com/",
    "phone": "(416) 253-9642",
    "description": "If you're looking for variety, quality, and friendliness this is a great place to go.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "1138 The Queensway, Etobicoke, ON M8Z 1P7, Canada",
    "lat": 43.6228048,
    "lng": -79.5197116,
    "commentfeed": [
      {
        "text": "I just love this studio!",
        "rating": 5,
        "usernamefeed": "Melody And Diane"
      },
      {
        "text": "Love this place! Some of the negative reviewers sound like winey little children OR have something to gain by reviewing negatively. I certainly have no affiliation and am not even a member but I'm treated professionally and greeted with a smile every time I show up. Keep up the good work Moksha Etobicoke!",
        "rating": 5,
        "usernamefeed": "Nuno Fonseca"
      },
      {
        "text": "Not only do they offer Amazing classes, I always feel welcomed and enjoy every teacher. I’ve tried out many studios in the area and this studio is the one I’ve chosen.",
        "rating": 5,
        "usernamefeed": "Sarah Faraone"
      },
      {
        "text": "Good Lordy. Where do I begin? This is a great little place to practice yoga... on certain dates only. Let me explain and try to maintain my composure while doing so:\n- This place is located in a weirdly small little plaza right on a the busy road. Limited parking spots. There are some spots on the side road and back but you have to risk getting a ticket.\n- Their practice room is in a very small room in the basement. I repeat. In the basement. In. the. basement. with. no. windows. So, if you're claustrophobic; be prepared to meet your death.\n- Imagine 50 people cramped together in a little room in the basement, with the heat on. Each and every single person is sweating profusely. The Instructor repeatedly asks everyone to \"stick out their tongue and sigh and breathe out loudly\". So basically, you are breathing other people's vile breath and odour for the ENTIRE duration of the practice. If you like breathing in other people's breath/odour for 60 straight minutes while you bask in puddles of other people's sweat, then YOU WILL FEEL RIGHT AT HOME. Personally, I'd rather do my breathing exercises and poses in fresh air.\n- In order to avoid over-crowding, you have to go in at odd times (early on weekends)\n\nOverall, it's a great place. However, the over-crowding room with stinky people, dingy basement and an extremely limited parking space makes it a deal breaker for me. I hope you have a better experience than I did.",
        "rating": 1,
        "usernamefeed": "Janine D"
      }
    ]
  },
  {
    "name": "Bliss Yoga Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMduelHzRNs3EKE7QKq7oAuiDTtJXrOWkJ9vofJ=s1600-w1024-h1024",
    "rating": 4.6,
    "website": "http://blissyogastudio.net/",
    "phone": "(416) 207-9642",
    "description": "True Yogic atmosphere. Professional management. Fact that many students are members for years - proves the quality! Many great students** I am very happy to teach Yoga @ Bliss",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "2992 Bloor St W, Etobicoke, ON M8X 1C2, Canada",
    "lat": 43.64775290000001,
    "lng": -79.51026809999996,
    "commentfeed": [
      {
        "text": "Great studio & varied classes. Excellent instructors & good friendly atmosphere. Overall a very positive experience so far!",
        "rating": 5,
        "usernamefeed": "Maria F"
      },
      {
        "text": "Welcoming and experienced instructors and a beautiful space to practice in.",
        "rating": 5,
        "usernamefeed": "Ena Music"
      },
      {
        "text": "",
        "rating": 3,
        "usernamefeed": "Shahida Adil"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Jessica Bachana"
      }
    ]
  },
  {
    "name": "ALIVE yoga & fitness",
    "image": "https://lh3.googleusercontent.com/p/AF1QipO-eyr3YnulDE_0BAwsfBFcUMEZkteJU2pCVw1n=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.aliveyogato.com/",
    "phone": "(647) 926-3948",
    "description": "Love this place!  It's a wonderful atmosphere to come and unwind after a long day.  All of the instructors are very friendly and always accommodate for any injuries or provide alternative poses.  The owners are great and always make you feel at home.  Everyone at Alive yoga & fitness go the extra mile to make your yoga experience as great as it can be.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "2240 Lake Shore Blvd W #229, Etobicoke, ON M8V 0B1, Canada",
    "lat": 43.621064,
    "lng": -79.48331999999999,
    "commentfeed": [
      {
        "text": "From the minute you walk into the space, you're welcomed with a smile and you instantly feel more calm. Stef and Seb are two of the most genuinely kind hearted warm people. The classes are great, and all the trainers are knowledgeable and welcome all levels with open arms. The space is super clean and I love that they offer tea (that tastes amazing by the way)! Highly recommend this place!",
        "rating": 5,
        "usernamefeed": "Michelle Bialy"
      },
      {
        "text": "As a novice I was anxious about starting at Alive, but I didn’t need to be. Stef, one of the owners, was my teacher for my first class and she made me feel totally welcome and instantly put me at ease.  I loved that first class and i’ve been a member there for over 3 months now.  \nAlive is a beautiful bright space with two studios. It has excellent facilities. There is a large changing area with plenty of lockers, and a bathroom with showers. The walls are adorned with artwork, there is filtered water, complimentary teas, and plenty of high quality equipment for your practice. They have a variety of classes for all levels and preferences, and I have been able to try most of them.  All of the teachers there are fantastic, super knowledgeable and approachable, and they all add to the positive atmosphere. I love everything about Alive!\nI occasionally drive there and the free parking under the attached condos is a bonus.",
        "rating": 5,
        "usernamefeed": "Sarah Oakley"
      },
      {
        "text": "I absolutely love this studio. Not only is it an aesthetically pleasing and extremely friendly and welcoming space, each teacher has their own unique aspect that makes every class special and worth trying. I have been so happy since ALIVE opened up. The teachers are so approachable and encouraging and the owners are truly so kind. I recommend ALIVE 100%",
        "rating": 5,
        "usernamefeed": "Valerie Stachurski"
      },
      {
        "text": "I discovered Alive through ClassPass when I was in search of local yoga studios. After one class at Alive, my search ended. Since then, I have enjoyed a variety of mixed-level classes with great, non-pretentious instructors in a clean facility with a serene view. I recommend this studio for anybody wanting to try yoga for the first time, and for more seasoned yogis too.",
        "rating": 5,
        "usernamefeed": "Adriana d’Entremont"
      }
    ]
  },
  {
    "name": "Power Yoga Canada",
    "image": "https://lh3.googleusercontent.com/p/AF1QipO_VOh-BVffX-hAaMuvR6GvhmR_P25dQ0QysYNe=s1600-w1024-h1024",
    "rating": 4.8,
    "website": "http://poweryogacanada.com/etobicoke/",
    "phone": "(647) 729-4631",
    "description": "The hot class is nice and it you feel really good after it. Friendly people there",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "1092 Islington Ave, Etobicoke, ON M8Z 4R9, Canada",
    "lat": 43.6365102,
    "lng": -79.52068700000001,
    "commentfeed": [
      {
        "text": "I’ve been going to PYC since about 2013. PYC has helped me through a number of injuries and I am stronger and fitter than I’ve been in decades.",
        "rating": 5,
        "usernamefeed": "Jeff Vogan"
      },
      {
        "text": "I just started at PYC Etobicoke this past month and fell in love. The energy and the positive vibes of the space, the teachers and the individuals that come out to sweat it out on their mats. Incredible. Also it's only $40 for your first month. :)",
        "rating": 5,
        "usernamefeed": "Miranda Scott"
      },
      {
        "text": "Went to Saturday morning hot power yoga 60 taught by Denise. Nice facilities and provided minty smelling shampoo. Would definitely go back for more classes.",
        "rating": 5,
        "usernamefeed": "Monica Lee"
      },
      {
        "text": "I’ve been attending yoga classes at the Etobicoke PYC for the past 1.5yrs. Love it - excellent instructors and classes. Highly recommend.",
        "rating": 5,
        "usernamefeed": "John Capozzolo"
      }
    ]
  },
  {
    "name": "Maureen Rae's Yoga Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM25BIGXu_A8h9CPIjB1MzxtF0nhY7dg5geyX00=s1600-w1024-h1024",
    "rating": 4.3,
    "website": "http://mraesyogastudio.com/",
    "phone": "(416) 716-7589",
    "description": "Great studio. Wonderful instruction, never the same class. Maureen really runs this place well. My only issue here is the limited choice of classes but great studio & instruction if the day/time suits you. Conveniently located near ample parking, bus stops and the Kipling subway station",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "5324 Dundas St W, Etobicoke, ON M9B 1B4, Canada",
    "lat": 43.6347841,
    "lng": -79.54207550000001,
    "commentfeed": [
      {
        "text": "Maureen is wonderful. The only reason I didn't give the studio 5 stars is because Maureen doesn't teach all of the classes. The studio is welcoming and homey, it isn't pretentious. It doesn't have as many extras as some other studios but I would say the price reflects that and the focus is really on the people and the yoga.",
        "rating": 4,
        "usernamefeed": "K"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Marina Quattrocchi"
      }
    ]
  },
  {
    "name": "Modo Yoga Bloor West",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPdRmjgnmZNJKBkZLeK31Zsgexxpm-aNI8FNKOh=s1600-w1024-h683",
    "rating": 4.3,
    "website": "http://mokshayogabloorwest.com/",
    "phone": "(416) 766-9642",
    "description": "The teachers here are knowledgeable, kind and caring.  The space is relaxing and inclusive of everyone.  I love that they honour each individual to do what they can do and to do what is right for them.  The community they are dedicated to creating in Bloor West is inspiring.  For my own well-being I feel they are part of my ongoing optimization physically, emotionally and spiritually.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "2481a Bloor St W, Toronto, ON M6S 1P7, Canada",
    "lat": 43.648597,
    "lng": -79.48507029999996,
    "commentfeed": [
      {
        "text": "Such an uplifting environment.  The instructors take the time to truly get to know their students and show they care about your wellbeing and progress. Since I have moved from Toronto, I have not been able to find a studio as inspiring as Moksha Bloor West -  It really is a special place. Can't wait to come back to visit!",
        "rating": 5,
        "usernamefeed": "Genevieve Clare"
      },
      {
        "text": "I understand there has been some controversy surrounding a Facebook post made by this studio around the time of the April van attacks. I understand why this has offended some. My review is not based around that. \n\nThis studio is run by wonderful people, despite what some may be posting regarding the controversial post. I worked at this studio as an Energy Exchanger for a few months and honestly I wasn't even practicing yoga at the time. I just volunteered because I was going through an emotional time in my life and wanted to be surrounded by positive people, spend time in a peaceful space and do what I could to grow during a difficult time in my life. I loved the space, the environment and the people. Don is a very wonderful man. I never had the chance to meet Meg, but everyone only had great things to say about her. \n\nThey are very mindful and considerate of the fact that some people may need yoga in their lives, but cannot afford it. This is the only studio I have known to operate on a sliding scale so that everyone can feel the positive effects of yoga. To me, this is the embodiment of yoga. \n\nThey keep a very clean space, have fair prices and it is a wonderful community. I would recommend this studio to anyone. I would also recommend their Energy Exchange program to anyone who would like to practice yoga regularly but cannot afford it, and anyone who would like to surround themselves with like-minded individuals.",
        "rating": 5,
        "usernamefeed": "Carly Brennan"
      },
      {
        "text": "I love this studio! Everyone is so warm and welcoming and there is no judgement.  I couldn't be more happy to be a member of this studio.  Every teacher is amazing and are truly gifted of the art. The studio is very clean and cozy. I have fallen asleep in the zen den on more than one occasion.   As a mother of two babies wanting to get back into shape it is extremely overwhelming.  Coming into the studio I feel very safe and it eases that feeling of being overwhelmed.  I love this studio and I can't say that enough. Thank you Moksha Bloor West for being my safe get away.",
        "rating": 5,
        "usernamefeed": "Marcela Amaral"
      },
      {
        "text": "I've practiced Yoga at many yoga studios (including a few different Moksha'). I especially love this studio. Beautiful physically (especially the practice room with its windows and the \"Zen Den\" with books, many live tropical plants, and musical instruments tea and fruit, people relaxing and chatting) great energy, amazing teachers/staff, many classes throughout the day for busy schedules etc. It is a very special place and i'd recommend setting up a regular practice there to get in with the community and make some friends, let alone the benefit of regular Yoga. Very positive vibes and will impact your life in POSITIVE ways.",
        "rating": 5,
        "usernamefeed": "Sean Hutchison"
      }
    ]
  },
  {
    "name": "Branch Yoga & Wellness",
    "image": "https://lh3.googleusercontent.com/p/AF1QipOKcfas-tis4m-WVhdB2awR7hU11gXTG-C8wXLO=s1600-w1024-h1024",
    "rating": 4.9,
    "website": "http://branchyoga.com/",
    "phone": "(647) 293-5360",
    "description": "Great studio! Always clean! Amazing instructors, always very helpful. I definitely recommend this place to anyone wanting to try yoga for the first time. I only recently started and this place has made it so easy! The aerial class by far has to be my favorite! Will continue coming here!",
    "amenities": [
      "Parking",
      "Showers",
      "Lockers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "3301 Lake Shore Blvd W, Etobicoke, ON M8W 1M8, Canada",
    "lat": 43.5964487,
    "lng": -79.5241059,
    "commentfeed": [
      {
        "text": "I’ve been going to Branch for a few months, after trying several yoga studies in the Mississauga area. As soon as I walked in I felt safe and at home. There are no mirrors in the studio, so no judgement. The staff and teachers are incredible, such an incredible energy.",
        "rating": 5,
        "usernamefeed": "Creasy"
      },
      {
        "text": "This studio is very inviting and welcoming. They are fully stocked with bolsters, blocks, blankets. They also do aerial yoga which is both fun and exciting. The instructors are patient and provide excellent instruction. My things were stuck in a jammed locker once but they were very apologetic about it and did everything they can to get the door open.",
        "rating": 5,
        "usernamefeed": "Shellen Chak"
      },
      {
        "text": "What I like about Branch Yoga is the variety of classes. Yoga Gym gives you an intense workout, Budokon challenges you to move in new and playful ways, and Vinyasa is a mix of more traditional yoga movements. The instructors are approachable and really know their stuff; every class there is something different that pushes you beyond your comfort zone. Get the intro pass and try different classes- you'll find something you love.",
        "rating": 5,
        "usernamefeed": "Anna Kuznetsov"
      },
      {
        "text": "Not crowded clean environment. Good studio!",
        "rating": 5,
        "usernamefeed": "Agatha Love"
      }
    ]
  },
  {
    "name": "Padma Yogi",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNyQ4h9cUpZxaLlHqe-RLUtayZuglGZXyNs5ZKZ=s1600-w851-h638",
    "rating": 5,
    "website": "http://www.padmayogi.com/",
    "phone": "(416) 522-1667",
    "description": "Melissa is a great prenatal yoga instructor. Very calming environment and beneficial classes.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "1066 The Queensway, Etobicoke, ON M8Z 1P7, Canada",
    "lat": 43.6232038,
    "lng": -79.5175423,
    "commentfeed": [
      {
        "text": "Melissa is simply the best.",
        "rating": 5,
        "usernamefeed": "Emma Lackner"
      }
    ]
  },
  {
    "name": "Breathe Yoga ",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMxIcn785cch8BZqEFolw41i-kcm2eYblS2eEFb=s1600-w1024-h1024",
    "rating": 4.8,
    "website": "http://breatheyogastudio.com/",
    "phone": "(416) 926-9642",
    "description": "I love Breathe Yoga! I have been going here for almost a year now and absolutely love the amount of classes offered every single day. I have a busy schedule and it’s great to know that no matter what comes up, I can almost always fit a class in. There are so many different class types, leaving room for growth, and the teachers are amazing. The environment is calming and I love that tea is provided. It’s great to know that if I get to class early I can always enjoy a cup, or look around the shop. Highly recommend... 100% worth the money you pay.",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "2968 Dundas St W #305, Toronto, ON M6P 1Y8, Canada",
    "lat": 43.6656705,
    "lng": -79.4683162,
    "commentfeed": [
      {
        "text": "I love Breathe Yoga Studio. The yoga instruction top notch. The faculties are always clean and very welcoming. All the staff makes you feel good every time I leave the studio. I feel so much better and am to cope with everything I need to do. I have brought yoga into my life everyday. Thanks breathe! I have been with Breathe Yoga Studio since the beginning (15 years). It has helped me in every aspect of my life. I highly recommend it.",
        "rating": 5,
        "usernamefeed": "Motria Dzulynsky"
      },
      {
        "text": "I appreciate the open, clean and kind environment with teachers who know their practice and never make anyone feel as though they aren't good enough to get something meaningful out of the classes. I also enjoy the wide range of classes and class times offered. I particularly enjoy the fact that there are several classes that are not technically 'yoga', but are exercise and meditation classes based on yoga and yoga poses (i.e. Total Body Dynamics, Stretching & Strengthening, Restorative...). Finally, I am grateful that the pricing is not overly prohibitive, especially if you purchase class passes for longer time periods. That said, a community or pay-what-you-can class would be a great benefit to the community",
        "rating": 5,
        "usernamefeed": "Alex Bowron"
      },
      {
        "text": "I recently completed Breathe Yoga Studio's 200 hour Teacher Training Program and my experience was excellent. I recommend it to anyone. All of the program's instructors were very knowledgeable and approachable. Christine, the program director, is a constant source of learning and inspiration. It is obvious Christine truly cares about her students and her passion is infectious. Svitlana and her team have created a beautiful yoga community and I am proud to have graduated from Breathe. My yoga practice was transformed and so was my relationship with myself.",
        "rating": 5,
        "usernamefeed": "Tara Knott"
      },
      {
        "text": "Place is very clean and well organized. Big selection of yoga styles. I was able to find several instructors that I really liked. The only issue is that sometimes the room is too hot even for the \"non-heated\" classes. Overall - I would recommend this place.",
        "rating": 5,
        "usernamefeed": "Alex Keselman"
      }
    ]
  },
{
    "name": "Redwood Hot Yoga Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNvBwo2O0TGjMnuN4dNeta__VwEWATGl-3Bnxmw=s1600-w990-h503",
    "rating": 5,
    "website": "http://www.redwoodhotyoga.com/",
    "description": "Awesome studio with a friendly and welcoming attitude. Challenging workouts for all levels. After you try hot yoga you will never go back to regular yoga. They offer pilates here as well.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "2638 St Clair Ave E, East York, ON M4B 3M1, Canada",
    "lat": 43.705417,
    "lng": -79.31377900000001,
    "commentfeed": [
      {
        "text": "This studio is so flexible (no pun intended), professional and friendly. I have lived in the area for years and have seen this go from one owner to another. J is great! He is very prompt to answer any questions or concerns. Instructors from my experience have been wonderful. They just added Hot Pilates as well. I appreciate a yoga studio like this in the neighbourhood and I look forward to going to the classes! \nHighly recommend! \nJust make sure you are on time --- as no one likes interruptions!",
        "rating": 5,
        "usernamefeed": "D. Roudka"
      },
      {
        "text": "I've been to 3 yoga studios and Redwood is my favourite.  Some of the classes have unconventional poses that get students to activate muscles we rarely use in day-to-day life.  Smart, dedicated instructors and owner.",
        "rating": 5,
        "usernamefeed": "Michael Sgabellone"
      },
      {
        "text": "I appreciate how the class has a lot of interesting postures for helping the lower back pain and shoulder/neck tension. Nice people too! Highly recommend it.",
        "rating": 5,
        "usernamefeed": "Mariam Al-Naser"
      },
      {
        "text": "Great instructors, great atmosphere and absolutely love that they offer 6am classes!",
        "rating": 5,
        "usernamefeed": "Victoria Grigg"
      }
    ]
  },
  {
    "name": "Amor Healthy Lifestyle",
    "image": "https://lh3.googleusercontent.com/p/AF1QipN_EpC_Sw8reO6zjmAu6lyGlEF7BR_hGXmM_wMc=s1600-w727-h576",
    "rating": 5,
    "website": "http://www.amorhl.com/",
    "phone": "(416) 559-0522",
    "description": "Amazing place for yoga classes!",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "40 Production Dr, Scarborough, ON M1H 2X8, Canada",
    "lat": 43.7789429,
    "lng": -79.23872719999997,
    "commentfeed": []
  },
  {
    "name": "Reach Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM_02AjnWjoD9njqTeFQVXqaM34W5Rg2wKC7nGP=s1600-w484-h721",
    "rating": 4.8,
    "website": "http://www.reachyoga.ca/",
    "phone": "(416) 803-9907",
    "description": "Love the Monday night yoga in Don Mills!",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "40 Underhill Dr, North York, ON M3A 2W7, Canada",
    "lat": 43.7440939,
    "lng": -79.3266481,
    "commentfeed": [
      {
        "text": "A worthy practice with heartfelt guidance.",
        "rating": 4,
        "usernamefeed": "Fran Masterson"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Avinash Kaur"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Tiffany Fleming"
      }
    ]
  },

  {
    "name": "YOGA YOGA EAST",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNca3oxTKIj_O4t4UsR9TwEHd978h-yMfyrLbaI=s1600-w1024-h1024",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "33 East Rd, Scarborough, ON M1N 1Z9, Canada",
    "lat": 43.68851739999999,
    "lng": -79.2713415,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "PUR YOGA Toronto",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPo4ug9He2ZXIChEF5uocVDd0wq3yl5UMo9B5-v=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.puryogatoronto.com/",
    "phone": "(416) 694-9642",
    "description": "This studio is the Beaches sanctuary. I love it. It's a safe space where I can clear my head, meditate, connect to a friendly supportive yoga community in a family-like atmosphere. Thank you Liz for creating such a beautiful space for our community to enjoy. So many wonderful memories made! I especially love the many options of classes from Iyengar Yoga to SUP YOGA , Paddle boarding in the summer out on the lake, to Vinyasa, Hatha, Yin & Restorative Yoga and TRX. This studio has so many props, which is lovely to feel supported. They even use chairs, straps and blocks in most of the classes to open up deeper and relax into postures. The teachers are so experienced and you can tell they truly care about their student community.\n\nThere's so much happening here from the special guest events with Crystal Bowl Sound Healing Therapy, to Reiki and Massage to Kirtan and Sacred Music Evenings. \n\nThis place is so special. - Caitlan Carver",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "2245 Queen Street East, Lower Level, Toronto, ON M4E 1G1, Canada",
    "lat": 43.6709824,
    "lng": -79.29457230000003,
    "commentfeed": [
      {
        "text": "PUR YOGA is my perfect fit. The genuinely caring and involved owners, are part of our community and are authentically interested in listening to and building the PUR community. The classes offered are diverse and interesting, the instructors are experienced and their styles diverse so you will find exactly the right fit for getting what you want from your yoga experience and the studio is small enough to feel relaxed and intimate. Perfect.",
        "rating": 5,
        "usernamefeed": "Susan Ward"
      },
      {
        "text": "Loved the atmosphere and the small class size. Feels like a community. ",
        "rating": 5,
        "usernamefeed": "Kelly Bennett"
      }
    ]
  },
  {
    "name": "Fore! Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPsvS-V2ov0YOXkMbAFEgkdCtV5hd03dG7_yOql=s1600-w1024-h1024",
    "rating": 4.9,
    "website": "http://www.foreyoga.ca/",
    "phone": "(416) 617-6273",
    "description": "Very centralized and easy to access location.  Lots of parking.  Studio is located on second floor and is very peaceful with its soft lighting.  Add great teachers to the mix and you have a recipe for a wonderful yoga experience!  Will definitely go back!",
    "amenities": [
      "Parking",
      "Showers",
      "Lockers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "1110 Birchmount Rd, Scarborough, ON M1K 5G7, Canada",
    "lat": 43.7362514,
    "lng": -79.2809916,
    "commentfeed": [
      {
        "text": "Soulful experience!  In this crazy fast pace world we live in having Fore! Yoga and specifically Chantal to help calm the body mind and sole is a much needed break. Chantal has taught me so much about the restorative benefits of breath and relaxation. I'm am not a golfer so if you are thinking that because you don't golf this is not for you - think again!  Thank you Chantal for always helping me calm\nMy crazy world. I always leave feeling clam, relaxed and energized!  Namaste",
        "rating": 5,
        "usernamefeed": "Tracey Sullivan"
      },
      {
        "text": "Chantal is a skilled communicator and instructor who spends the time to teach the yoga positions. Her gentle manner and watchful eye can immediately detect when a correction or re-alignment is required. Although the classes are specialized for golfers, the sessions are focused on the yoga practice and my individual ability and now a part of my regular wellness routine.",
        "rating": 5,
        "usernamefeed": "cate hazell"
      },
      {
        "text": "I attend the Tuesday night \"Gentle Yoga\" classes on Tuesday night at this location. It is a very warm, inviting, and comfortable environment! The instructor is accommodating to each individual participant and sensitive to the needs of all!\nFacilities are terrific! Parking is excellent!!!",
        "rating": 5,
        "usernamefeed": "Larraine Schoop"
      },
      {
        "text": "What a fantastic space with great energy!  Chantal and Lisa are lovely!  Whether you're a beginner yogi or seasoned practitioner, do your self a favor and check out Fore! yoga!",
        "rating": 5,
        "usernamefeed": "Chloe Westman"
      }
    ]
  },
  {
    "name": "Yogaaah",
    "image": "https://lh3.googleusercontent.com/p/AF1QipOyhNyGqysmtVZVV6HZ02SsMMoMOjKdzj7JH5xD=s1600-w960-h564",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(647) 876-0842",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "#105 (Onsite Services), 1 Firvalley Ct, Scarborough, ON M1L 1N8, Canada",
    "lat": 43.70324,
    "lng": -79.28059999999999,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Satya Yoga",
    "image": "https://images.pexels.com/photos/374101/pexels-photo-374101.jpeg",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(416) 993-2360",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "248 Scarborough Golf Club Rd, Scarborough, ON M1J 3G8, Canada",
    "lat": 43.74837230000001,
    "lng": -79.21088450000002,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Guildwood Yoga Studio",
    "image": "https://iamyoga.ca/wp-content/uploads/2017/04/studio-experience.jpg",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "3785 Kingston Rd, Scarborough, ON M1J 3H4, Canada",
    "lat": 43.74746560000001,
    "lng": -79.207605,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Moksha Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipONUbPQ7uIcIBS1nKH3Yqz7RB3DA0HoGe7Mv8aP=s1600-w560-h294",
    "rating": 4.7,
    "website": "http://markham.mokshayoga.ca/",
    "phone": "(905) 604-5683",
    "description": "Moksha Yoga Markham offers such a clean space and beautiful atmosphere. There are so many classes to choose from, between the two studios, and every teacher who has led my classes has been present, warm and inclusive of all levels. They also offer a variety of workshops every month that allow its members to continue to deepen their practice.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "# LMN, 8200 Birchmount Rd, Markham, ON L3R 9W1, Canada",
    "lat": 43.8568213,
    "lng": -79.32440880000001,
    "commentfeed": [
      {
        "text": "Very good experience trying hot yoga!  Nice environment and instructors.  As a beginner, I never feel strange if I can't do some poses.  I like the flexibility of the schedule, open early and close late!",
        "rating": 5,
        "usernamefeed": "Lolita Wong"
      },
      {
        "text": "5/5! Had previously tried classes at the Thornhill location and my expectations were low. However, this location is a lot smaller and the teachers do hands-on adjustments which I love!! Also, for some reason, the hot room isn't as unbearably hot as the other location, and I'm pretty sure it's because the classes are much smaller! Super clean studio, nice staff, amazing teachers, and free street parking! So happy I gave it a try!",
        "rating": 5,
        "usernamefeed": "Maddy R"
      },
      {
        "text": "If you have never tried hot yoga before I strongly suggest you try it at Moksha Yoga Markham. The studio is fantastic, friendly staff, tranquil  environment and great variety of classes make Moksha Yoga Markham one of the best kept secrets in Markham. Try it once and you will be hooked. The instructors are very helpful and will help ensure you get the best of your yoga session. Move at your own pace is one of their key principles.",
        "rating": 5,
        "usernamefeed": "Rohit Malik"
      },
      {
        "text": "This location is great for hot yoga, especially if you are a beginner! I always recommend it to my friends and bring them along whenever i get the chance. I recommend aways arriving early as classes can get pretty full quickly!",
        "rating": 4,
        "usernamefeed": "Christine Tan"
      }
    ]
  },
  {
    "name": "The Yoga Mat",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNSECcS5u8FAlGa8244gfpGNPyQP2bOltVMfGNh=s1600-w1024-h1024",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(647) 961-4363",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "115 Apple Creek Blvd #201a, Markham, ON L3R 6C9, Canada",
    "lat": 43.8573583,
    "lng": -79.35628029999998,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Yoga Tree Richmond Hill",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNJCZUagyeSmmWCBDeMf0xCf5Tw_tZ80kjHDlCO=s1600-w800-h533",
    "rating": 4.3,
    "website": "https://www.yogatree.ca/richmond-hill/",
    "phone": "(905) 882-9642",
    "description": "Jason's class is consistently challenging. I always get a great workout and leave feeling proud that I finished his class. I feel refreshed and like how I learn more about yoga poses, transitions between poses and more awareness about myself. Not all yoga classes nor studios are the same. It is an art form and Yogatree is the best in Toronto, hands down.",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "360 Hwy 7 #1, Richmond Hill, ON L4B 3X7, Canada",
    "lat": 43.84145700000001,
    "lng": -79.397219,
    "commentfeed": [
      {
        "text": "Yoga Tree - FINALLY!  I have tried many studios over the years, but none measured up. A friend recommended yoga tree. I tried several classes with various instructors. They were all excellent. The studios and change rooms are so clean, light and meticulously kept.  The support staff is friendly and always ready to help. If you are looking for a professional studio look no further. Yoga Tree is the perfect oasis to escape to during a busy day. Your body will thank you.",
        "rating": 5,
        "usernamefeed": "victoria dombrower"
      },
      {
        "text": "The instructors here are great and I enjoy the classes but today when I went to the restorative class, they overbooked it and the there was literally no space.  I left.  The receptionist informed me that they let people in because they came as a couples.  Kind of like the airlines only instead of being refused a seat, they expect you to share yours!! This is not the first time I have left the class because they overbooked it. Extremely disappointed.  Once it gets to the maximum, then they shouldn't allow anyone else in.  Only ruins the experience for everyone.",
        "rating": 2,
        "usernamefeed": "Ron Jervis"
      },
      {
        "text": "Yoga Tree Richmond Hill is by far my favourite yoga studio. The entire staff is extremely kind, friendly, and accommodating. Definitely would recommend this location time and time again.",
        "rating": 5,
        "usernamefeed": "Negin FA"
      },
      {
        "text": "Thanks to beautiful Pamela - Front Desk girl,  for helping me in a situation where I thought I cannot make it.",
        "rating": 5,
        "usernamefeed": "Najma Zuberi"
      }
    ]
  },
  {
    "name": "Hub Climbing",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPnVAV6a5-O72qj2P88_yMqgXVwbvI-bK4uswSz=s1600-w1024-h1024",
    "rating": 4.7,
    "website": "https://hubclimbing.com/",
    "phone": "(905) 604-4588",
    "description": "The atmosphere is very friendly and welcoming. The gym itself is a lot of fun and great for groups or soloing. I love the large variety of auto belays available! The routes are more challenging than other gyms in the area and each one helps you work on different techniques. Great work! :D",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "165 McIntosh Dr, Markham, ON L3R 0N6, Canada",
    "lat": 43.85713699999999,
    "lng": -79.3575558,
    "commentfeed": [
      {
        "text": "I had my daughter’s birthday @ The Hub recently and I was very impressed that the staff was extremely helpful, friendly and organized. \nMy party group was well looked after by 3 trained staff who stayed with the group until it was pizza time. \nThe front desk staff had great customer skills, especially Andrew, who looked after my party sign in. He was patient and friendly. \nI would highly  recommend The Hub for a birthday party because the staff made everything easy and all the kids had a great time, including the novice climbers.",
        "rating": 5,
        "usernamefeed": "649 Ping"
      },
      {
        "text": "We hosted a birthday party here today, we had a fabulous time! The staff were very helpful in setting up the party room, as well as cleaning afterwards, they even helped us carry our boxes to the parking lot!  The coaches were attentive and encouraging.  All the girls enjoyed the climbing, including the first timers!  We would definitely recommend hosting your birthday party here.",
        "rating": 5,
        "usernamefeed": "Cathy Wong"
      },
      {
        "text": "Some ppl call it the place where climbing shoes go to die. Since the climbs can wear out your climbing shoes very quickly. Staffs are amazingly friendly and the climbs change frequently. Plus the place is big enough so you won’t get bored even if you go 2-3 times a week.  Also people who climb there are usually really friendly so you can meet climbing buddy’s pretty easily",
        "rating": 4,
        "usernamefeed": "Robin Ling"
      },
      {
        "text": "I came in with my daughter to have her climb the other evening after work, first visit. The front desk was staffed by a VERY sick girl, who should have been in bed resting. I asked her why she was working, and was told that there no other staff scheduled. Her co-worker had stayed late to make sure she wasn't alone, and looked exhausted and harried. I couldn't believe it. The size of this gym, and one sick person was scheduled to supervise everybody?! I brought this up to the girl, and was told that management had been made aware but she didn't have any further info on when it would be resolved. She didn't sound particularly hopeful that it would be to me, though she was very professional in her responses. I was then told because my child was under 12, she could not climb higher than a certain height. Alright. The height, however, was not marked anywhere except one wall, and was more or less 1 foot lower than the actual routes?! I asked for clarification on how a 10 year old was supposed to recognize this, and apparently the staff and myself would be responsible for 'ensuring they stayed within the limits'. Given the amount of people there, this was an absolutely ridiculous limitation, and there was NO WAY that this poor girl and her exhausted colleague working the front desk (conveniently placed facing away from the marked wall where she could not keep an eye on the beginner area) could do so. I will NEVER bring my child here. I suggest anyone thinking of doing so seriously reconsider. I have been to True North Climbing, which is inconveniently further away, but always staffed sufficiently and I have always felt myself and child have been treated safely.",
        "rating": 1,
        "usernamefeed": "Sarah Stildman"
      }
    ]
  },
  {
    "name": "Moksha Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNuuEODGwcjsHW_C4-T7cF6NdZqlIDBlGBpQlcw=s1600-w960-h720",
    "rating": 4.1,
    "website": "http://markham.mokshayoga.ca/",
    "phone": "(905) 474-9642",
    "description": "Its Saturday afternoon,  I'd love to go to yoga but they aren't open. All week I had 1-3:30pm open ...unfortunately no classes between 2-5pm. Finding it hard to practice, especially with new rules, I'm afraid to preschedule in case I get too busy and cancel late. The summer was absolute chaos and my husband refused to go back after only attending once since one of the locations had renovations and classes were packed. Wont give up.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "5051 Hwy 7 #2,3&4, Unionville, ON L3R 1N3, Canada",
    "lat": 43.86528269999999,
    "lng": -79.28950050000003,
    "commentfeed": [
      {
        "text": "I have been going to this location for 3 weeks now. The classes are amazing and the instructors are very knowledgeable. If you are a beginner, it is an excellent place to start.",
        "rating": 5,
        "usernamefeed": "Russell Ali"
      },
      {
        "text": "i dont know why this yoga has so much harsh rules to their member，like if you sign up online but you can't attend in it and you forget to cancel it, you need to pay extra 25 dollars to next class if you want to attend it, otherwise you can't join the class any more. and there are a lot of people every time，even there are no way to stench the leg and even can kiss other guys foot who stand in front of you. It is a really terrible studio that I ever attend in. And I will never go to this store.",
        "rating": 1,
        "usernamefeed": "katie wu"
      },
      {
        "text": "Loved the atmosphere, the yoga studio was at perfect temperature for hot yoga, and the instructors were very helpful throughout the sessions without delaying the classes.",
        "rating": 4,
        "usernamefeed": "emily chan"
      },
      {
        "text": "Moksha Yoga Markham has gone above and beyond to become and remain as the best yoga studio in Markham. The facility is constantly being cleaned in between the classes. Considering how much sweating goes on, this is particularly important to maintain proper cleanliness. Unlike the typical changeroom, the ones at this studio are spa-like. All this aside, the most important aspects are the staff and the availability of classes. All the teachers are great, and they have a lot of class times. There is even a class at 9:45pm, which accomodates people like me who finish work late. High recommendations for this place!",
        "rating": 5,
        "usernamefeed": "Derek Ng"
      }
    ]
  },
  {
    "name": "Hot Yoga Buttonville",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPX6RqzjQDswbSz5LgEbbU-oWEET0GRBk6EFBCr=s1600-w1024-h1024",
    "rating": 4.8,
    "website": "http://www.hotyogawellness.com/buttonville/classes/",
    "phone": "(905) 604-5150",
    "description": "I am so sad that this place is closed down. We were informed of a few available time slots to get the refund. Rita was nice and very honest to us.  I hope I can practise with them soon and all the best to their next endeavour!",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "50 McIntosh Dr #111, Markham, ON L3R 9T3, Canada",
    "lat": 43.8548275,
    "lng": -79.35838409999997,
    "commentfeed": [
      {
        "text": "A really great studio to practice hot yoga. I've been a member of this studio in the past and of other studios too and have recently looped back to the Buttonville location. The environment is always calming, relaxing and clean. Plus, the instructors are helpful and friendly - they're there to challenge and help you to reach your yoga goals. A few of my favourite classes are with Jacinda (hot core) and Jenny (mixed yoga). You're never going to feel cramped jockeying for a spot on the floor, overheated, or lost in class. Rita has done a great job in creating a friendly and supportive environment. Did I mention, there are small healthy snacks that you can help yourself to after class? A really nice bonus after you've sweated it out on the mat. :)",
        "rating": 5,
        "usernamefeed": "Lisa S"
      },
      {
        "text": "I want give 0 star.   we went there for refund, because they are closing this location. They make many reason for refusing to give your money back. When we pay the money they told us the course will expire in 18 months, but today when we there, they said the course already expired. all course will expire in 6 months. On the receipt, there is no any word which telling you the yoga course will be expire in 6 months after you paid. and they told us it is good for 18 months. Now because they are closing this location, and we are there for refund , now they told us course already expired. what a joke this company. I cannot believe this kind of company can survive in Canada.",
        "rating": 1,
        "usernamefeed": "192 666"
      },
      {
        "text": "It was very sad to see this studio had to close. I had great time and met with great people in this studio. I received generous refund from the owner. I hope this studio could re open in the near future.",
        "rating": 5,
        "usernamefeed": "Vera An"
      },
      {
        "text": "I've been going to Hot Yoga Wellness Buttonville for the past 3 weeks now.  The experience has been exceptional.  Why?\n\nHere's why:\n\n1. Place is clean and well organized\n2. Little refreshments at the end of the class\n3. Best of all, the PEOPLE!  From the staff, instructors to the people I practice with.  They are all so friendly.  \n\nI enjoyed all of the 9:30am classes.  Thanks to Rita, Dory, Jacinta, and Julia.",
        "rating": 5,
        "usernamefeed": "Min Sue"
      }
    ]
  },
  {
    "name": "Akasa Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipO9IqMVEOGCNZdW37F8T98nycS50nCgLF72RSaz=s1600-w1024-h1024",
    "rating": 4.9,
    "website": "http://www.akasayoga.ca/",
    "phone": "(647) 779-2863",
    "description": "Had a great time learning aerial yoga and hatha yoga from Thomas. Best part is that it’s a small class (10-15 people, but sometimes less) so the instructor can teach you what you need to work on. He also has an assistant (I forgot her name) who helps beginners so no one falls behind. The teacher is also trilingual in English, Cantonese and Mandarin. Would definitely recommend!",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "401 Alden Rd #8, Markham, ON L3R 4N4, Canada",
    "lat": 43.8338866,
    "lng": -79.33296100000001,
    "commentfeed": [
      {
        "text": "Friendly and professional teacher, very clean space and provide lockers with locks. \nPadded studio and provide different varieties of yoga equipment for practice. \n\nThe first 2 times for aerial yoga have experienced dizziness,  but when body has adapted at the 3rd time, we enjoy the hanging practice afterwards. New comers should give your body a few more times to adapt. It's  especially good for correcting posture and relax back muscles. \n\nWe also attend the Hatha yoga,  my husband said it's even more stretching than the aerial yoga but very helpful for him whom sits a lot for driving and working on computer.",
        "rating": 5,
        "usernamefeed": "Josey Wong"
      },
      {
        "text": "Good things come in time and yoga is one of those things. I signed up for unlimited yoga for a month and let me share my experience with you.\n\nAerial yoga: i have taken this previously at another gym that used hammocks where as Akasa uses silks. You're upside down a lot and if you have low blood pressure like me you'll get dizzy and might feel like your head might explode. This takes time getting used to. Don't be afraid to get back upright to take a rest. I also would like to stress for beginners to wear a tight shirt and leggings. It is uncomfortable with the fabric rubbing against your skin and armpits with all your body weight on it. Aerial yoga is fun and it takes time for your body to get used to it and to build the necessary muscles to do more advance poses.\n\nHanuman: this is a truely different type of yoga. Youll be hanging upside down with a rope (a lot less fabric compared to silks) supporting your hips. It'll create a lot of pressure on your inner tighs and may cause a bit a bruising. It'll take some time to get used to as well. Once you're comfortable with repositioning yourself it'll get easier.\n\nTeaching: based on majority of the class it can be taught in english, mandarin or cantonese but most importantly its easier to watch first then practice. There's no levels so everyone goes at their own pace which can be annoying since it takes a long time to teach beginners how to invert. But i do like that every class is different and the instructors push you to excel. The instructors are very helpful and ensure that everyone is practicing safely.\n\nIf you love the burning pain and sense of accomplishment then this place is for you. \n\nDisclaimer: not for people scared of heights, pain or gives up easily.",
        "rating": 4,
        "usernamefeed": "Monica Yiu"
      },
      {
        "text": "Amazing studio and amazing team.  They are so patient with the varying levels of skill that come through the door!",
        "rating": 5,
        "usernamefeed": "Cheshta Bajaj"
      },
      {
        "text": "Great experience! Instructors are very patience and friendly. very clean environment. Always have enough parking. As I am very prone to wrist and knee injury, this is definitely a great place for me.",
        "rating": 5,
        "usernamefeed": "Annie Chu"
      }
    ]
  },
  {
    "name": "Hot Yoga Richmond Hill",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMmcXt3hqBWFoxBsFmtTG-sfLqODIZWphdfsjAS=s1600-w1024-h1024",
    "rating": 4.9,
    "website": "http://www.hotyogawellnessrichmondhill.com/",
    "phone": "(905) 881-0010",
    "description": "A fantastic place to learn, grow, and get inspired. Lots of classes to choose from and all instructors are highly qualified. Whether you're looking to try yoga out for the first time (as I was a couple months back) or try out a new studio - this place won't disappoint! And the best part is, all levels are catered to - from beginner to pretty freakin advanced and everything in between!",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "1455 16th Ave #10-12, Richmond Hill, ON L4B 4W5, Canada",
    "lat": 43.8612372,
    "lng": -79.38839050000001,
    "commentfeed": [
      {
        "text": "I have been going to this yoga studio since 2012. A lot has changed in the past a few years but this is still one of my fav yoga studio in Toronto. (This studio previous is moksha Richmond hill, then it changed to my hot yoga studio, then changed to hot yoga wellness. Name change, owner changed.)\n\nThe studio is very good size, cozy but big enough. one room for both hot and regular temperature. Hold around up to 25 people. Rarely get too crowded. There is a mirror in the excise room, little decoration, very minimal. 4 large size shower and rarely get too busy either. Change room does not have locker but it was never needed. \n\nThis studio is always clean, does. It have strange smell some other yoga place. Sometime they use essential oil defused and I love it. \n\nStaff are very friendly despite there has been so many changes going on, there are a few Excellent teacher teach in this studio regularly. \n\nWhat I like the best is the temperature - this studio has best temperature for practice yoga, regular is warm, hot yoga is not too hot. In fact practice yoga in a external hot room is not best to our body - this studio make it just right. \n\nClass around 12$ - 20$ depends on drop in or buy class card. Membership is 135, couple is 175. (Membership is unlimited class). I normally buy family class card so I can share with families and, have flexible schedule. \n\nThe only thing I would I recommend - recent a year, there are students talking before and after class in the practice room - it shall and need to be a quiet practice, I hope staff and teacher will inform and educate new student on silence practice so it won’t interfere others practice or meditation before/after the class. Add some snack will also be nice. If there are some matt sort and small dry towel in the practice room to clean matt would be really nice as there is only a small rack outside to hang matt. \n\nOverall, if you looking for real yoga, great teacher, none fancy and none pretentious place for your yoga practice, this is the one.",
        "rating": 5,
        "usernamefeed": "Marine Zhang"
      },
      {
        "text": "I have been going to this location since it opened (previously I had been a member of the Woodbridge location). Kind staff, great teachers, clean studio, diverse and comprehensive schedule. I would recommend anyone to try this place.",
        "rating": 5,
        "usernamefeed": "Katie Daniels"
      },
      {
        "text": "I must say, the teachers here are great. They really involve themselves in ensuring your poses are accurate and that you're getting the most out of it.  I am really happy with my experience.  They also use interesting music and scented inscense.  They have this real focus on healing.  Especially Jennifer on friday night classes! She is my favourite teacher so far.  The reason they get 4 stars is because the room isn't hot, even for hot yoga.",
        "rating": 4,
        "usernamefeed": "Bharti Dhillon"
      },
      {
        "text": "The owner Stella is amazing. Great instructors .",
        "rating": 5,
        "usernamefeed": "Selena Jee"
      }
    ]
  },
  {
    "name": "Hot Yoga Markham",
    "image": "https://cdn6.dissolve.com/p/D187_218_100/D187_218_100_1200.jpg",
    "rating": 4.8,
    "website": "http://www.hotyogamarkham.com/",
    "phone": "(905) 489-9642",
    "description": "Fantastic teachers.  Would benefit from being able to correct students postures and giving clearer instructions.",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "3621 Hwy 7, Markham, ON L3R 0G6, Canada",
    "lat": 43.8540662,
    "lng": -79.33746780000001,
    "commentfeed": [
      {
        "text": "Most instructors are very helpful. My favorite is Jovita and Ben.  They come over to help and correct your poses from time to time.  Nice studio and with lockers.  A bit down side is they don't have many schedules as the others.",
        "rating": 5,
        "usernamefeed": "peggy cheng"
      },
      {
        "text": "Great",
        "rating": 5,
        "usernamefeed": "Manjeet Cheema"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Cindy J"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Cecilia Chan"
      }
    ]
  },
  {
    "name": "Yoga in Unionville",
    "image": "https://st2.depositphotos.com/1518767/6900/i/950/depositphotos_69001081-stock-photo-people-exercising-on-fitness-mats.jpg",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(905) 479-9329",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Showers",
      "Lockers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "8b Station Ln, Unionville, ON L3R 1R3, Canada",
    "lat": 43.8646289,
    "lng": -79.31115260000001,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },

  {
    "name": "Yoga Netwok of Canada",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPKntiY4A5DnVfgZv9sRGcIwmJgvekL5LhjMJQ=s1600-w1024-h1024",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(416) 662-3785",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "30 Eglinton Ave W #258, Mississauga, ON L5R 0C1, Canada",
    "lat": 43.6056743,
    "lng": -79.65275429999997,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },

  {
    "name": "Power Yoga Canada City Centre",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNRV_suRDAssiwmJ_nUvvL45Y0N7Hr-SD1gBmE7=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.poweryogacanada.com/city-centre",
    "phone": "(905) 949-9997",
    "description": "Amazing place with awesome offerings. Sarah and Tania are very warm and welcoming! They are attentive to every detail.I strongly recommend this community for its instructors and programs. Thank you!",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "925 Rathburn Rd E Unit B1, Mississauga, ON L4W 4C3, Canada",
    "lat": 43.61608299999999,
    "lng": -79.61757599999999,
    "commentfeed": [
      {
        "text": "The location of PYC City Centre is so convienant. The staff and EE's are awesome! 9:30 am classes are the BEST way to start the day. So happy a PYC opened up in this area 🙌🙌🙌",
        "rating": 5,
        "usernamefeed": "Nicole Henry"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Kristina Pancevski"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Sarah Desiree"
      }
    ]
  },
  {
    "name": "moksha yoga square one",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNfWLe898cP89cDcFqZbBGkVIJcoXpjv3ENA-qm=s1600-w1024-h1024",
    "rating": 4,
    "website": "http://www.mokshayogasquareone.com/",
    "phone": "(905) 232-0165",
    "description": "I love this studio, the teachers and the staff. The classes are amazing. My body and sleep really appreciate it. Thanks... Moksha Yoga Square One =)",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "4175 Confederation Pkwy #5, Mississauga, ON L5B 0H1, Canada",
    "lat": 43.58880299999999,
    "lng": -79.64948729999998,
    "commentfeed": [
      {
        "text": "The most gracious studio I have ever been to! The staff are super supportive and really care about the people who come in. I hurt myself and couldn't make it in for a week, and without asking they called me to extend my 1 month pass since I hadn't visited in a while. Instantly brightened my day; a true testament to their culture and sense of community.",
        "rating": 5,
        "usernamefeed": "Rachel Cheng"
      },
      {
        "text": "It’s an absolutely wonderful community of people. Sabrina, Pearl, Normando on the drums and the live musicians that come play are fantastic. I highly recommend this facility to anyone that needs to relax and have a peace of mind, and have a great workout! Any issues I ever have the staff know exactly how to handle the issue with the best care.",
        "rating": 5,
        "usernamefeed": "Olivia Ha"
      },
      {
        "text": "The people that work here are very friendly! Something amazing happened to me that I will always remember. I lost a wallet 3 years ago at this location and it was recently found with everything inside intact. Special thanks to Pearl for assisting me.",
        "rating": 5,
        "usernamefeed": "John Lazo"
      },
      {
        "text": "Nice clean studio with good high energy classes. Most of the teachers are very good. The only negative is the parking. Sometimes it's hard to get a place in the underground lot. If you park on the street you have to pay. It's only $2.00 but I really don't want to pay more than what I already have paid to attend class. ",
        "rating": 4,
        "usernamefeed": "Michael Bairstow"
      }
    ]
  },
  {
    "name": "Holistic BodyWorx",
    "image": "https://lh3.googleusercontent.com/p/AF1QipP1pGAYDmVMEqOiRpCiqY24ze0mTACmJlKxJLpx=s1600-w713-h712",
    "rating": 4.3,
    "website": "http://www.holisticbodyworx.ca/",
    "phone": "(905) 281-3737",
    "description": "I purchased a Groupon for this studio and I'm so glad I started coming here. The Pilates classes are an amazing workout where you are pushed and motivated throughout the entire class. I only started coming here recently and within just a few classes I can feel and see results already. Very happy with this studio and I look forward to every class I attend for a new challenge!",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "1, 4259 Sherwoodtowne Blvd, Mississauga, ON L4Z 1Y5, Canada",
    "lat": 43.6009576,
    "lng": -79.639814,
    "commentfeed": [
      {
        "text": "I love attending classes at Holistic BodyWorx. The entire team from reception, to the various instructors and Tina and Roy are wonderful! Very friendly and informative!\nI really appreciate that they respect the time and effort of those who show up on time! When people are late it disrupts class so I'm thrilled they do not permit people to enter class after the class has started - very much appreciated.\nI've been going for about 2 years and the classes are great- a lot of variety from various types of yoga, pilates (both classic and a combination class which incorporates a little cardio) and body sculpt! I love them all :)",
        "rating": 5,
        "usernamefeed": "Cristina Barillari"
      },
      {
        "text": "I have been a member of Holistic Bodyworx for close on 10 years. The studio offers a variety of classes from Classical Pilates, Hot Pilates , cold and hot Yoga and Body Sculpting and I have pretty much attended all of them!! It has been an awesome experience. I’ve recently had the pleasure of attending the  Hatha Flow Yoga classes on Thursday morning taught by Angie Fumo.\nIt is a truly delightful experience , I look forward to Thursday mornings knowing that there will be a wonderful blend of yoga poses, instruction and music. It is obvious that Angie takes great care in her choice of music so that it matches the poses and all combines to make for an instructive, challenging and soothing experience all at the same time. She is a wonderful addition to the Holistic Bodyworx staff.",
        "rating": 5,
        "usernamefeed": "Elaine Odetoyinbo"
      },
      {
        "text": "The most incredible yoga and pilates studio ..you are treated with the most warm welcome in every visit..the classes are amazing..with variety of intensities..great schedule awesome instructors..love the heated classes as infrared hesting is used.its super clean..location central..and free parking is a huge bonus...my home away from home..highly recommended.",
        "rating": 5,
        "usernamefeed": "Zee PARUK"
      },
      {
        "text": "Great classes and very nice people",
        "rating": 5,
        "usernamefeed": "ana b"
      }
    ]
  },
  {
    "name": "Hatch Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMQ8N-L9M1Qiu-QL51VDVoiFTbTBsaKolT6QW0y=s1600-w1024-h1024",
    "rating": 4.8,
    "website": "http://www.hatchyoga.com/",
    "phone": "(905) 232-2292",
    "description": "Hatch is a wonderful and welcoming studio! The instructors are lovely, varying class times and a beautiful (+clean) studio. Its a win win! Personally I love and recommend the restorative practice on Mondays at 8pm!",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "626 Burnhamthorpe Rd W #202, Mississauga, ON L5B 2C4, Canada",
    "lat": 43.58023619999999,
    "lng": -79.6500332,
    "commentfeed": [
      {
        "text": "There aren't enough words to say just how amazing this Yoga studio is! If you are anything like me, a newbie to Yoga, this is the place to start. Setting aside the obvious amazing intro deal of $30 for your first month of unlimited classes, The people and staff are just as amazing. I was so nervous and shy to start this new Yoga journey in fear or not being able to do poses correctly and feeling like an outsider, but every instructor made sure that wasn't the case. They were all so friendly and encouraging I never once felt intimidated. Every class made me feel confident and proud and it made going back more and more that much easier. I'm incredibly sad that I will be moving away and won't be able to take Hatch Yoga with me, but I will definitely be returning on days I am ever back in town. If you ever look at expanding up north, be sure to let me know :) Namaste.",
        "rating": 5,
        "usernamefeed": "Erica Sarasua-Reid"
      },
      {
        "text": "Hatch Yoga is an oasis of serenity in the middle of Mississauga. Every detail is finely tuned so that yogi and yogini of all levels of experience feel at home and get most out of their practice. \n\nThe instructors are knowledgeable, provide variations to accommodate practitioners of different levels, and create a nurturing environment. The class variety is outstanding: there are heated, warm, and non-heated classes that vary from restorative to vinyasa to arm balances. \n\nThirty minutes between classes allow the practitioners to come early (or leave late) and get into that first flow, meditate, or surrender into a relaxation pose. Being able to take a nice nap after restorative classes was a total game-changer for me ;) .\n\nAbove all else, everyone knows everybody by name. You are treated like family: members are initiated into the mysteries of proper alignment in a series of complimentary semi-private classes by the studio director herself. If you never had semi-private or private yoga classes, these will transform your practice. Proper alignment is the key to enjoying the full benefits of the poses, deepening your practice, and preventing injury.\n\nYoga is transformational, and Hatch Yoga is the perfect place for practice.",
        "rating": 5,
        "usernamefeed": "M P"
      },
      {
        "text": "I first heard about this studio from groupon, I really enjoy it! The instructors are fabulous and there’s plenty of class variety. The classes are also smaller and intimate so there’s more 1 on 1 time with the instructors and lots of space for you (I can’t stand when you can barely stretch your arms out due to over crowding). There’s also lots of parking which is a plus. I highly recommend this studio!",
        "rating": 5,
        "usernamefeed": "Jessica S"
      },
      {
        "text": "It is a nice place to practice yoga. They have enough everything to make us feel comfortable. The facility is nice and clean. The instructors are knowledgeable and helpful. The classes are not big so the instructor can look after every single one there. I would recommend this place for someone who are interested in learning yoga.",
        "rating": 5,
        "usernamefeed": "Tri Duong"
      }
    ]
  },
  {
    "name": "Hot Yoga and Pilates",
    "image": "https://lh3.googleusercontent.com/p/AF1QipP58BLD21NwLVUUtcv-vTXXDrojc-PDy9UOaN3z=s1600-w1024-h1024",
    "rating": 4.7,
    "website": "http://www.hotyogaandpilates.com/",
    "phone": "(289) 521-1468",
    "description": "I've been here a few times with a friend (who comes more often) when they have had a promotion for a free class. Interestingly, both times I came, Mike was teaching the class and both times, when I walked in, he greeted everyone except me, like I was invisible! I felt bad the first time but chalked it up to an oversight. However, the second time it happened I was angry and that is why I'm posting the review. I ended up not signing in at the desk either time, although I know you are supposed to. My friend mentioned some instructors aren't that friendly or helpful but she likes the classes and its close to her house so she comes anyway. She also said that Mike was the owner so I was especially not impressed. Customer service is important even more for owners!\n\nThe classes were okay but I feel they are overpriced even if you buy on a promotion. I go to another yoga studio where we get corrections to our poses much more often, and I prefer it that way. Here, only a few students get corrections even though many people are doing wrong things.\n\nOverall, I would not recommend this place and don't plan on going back for any more free classes. I want to be treated well when I'm doing my yoga.\n\nUpdate: In response to the owner's reply:\n\nHello Lisa,\n\nThank you for your message. You are right in that I did not write the review immediately. I was reminded of my experiences when I got together with my friend yesterday for dinner. You said my review is unfair, I don't agree. For instance, according to her, when she signs in some instructors sometimes just make sure she scans the tag, they don't say hello, they just say thanks when the tag scans. Some instructors don't always say hello when she says hi to them, they just look at her to make sure the tag scans. She would never review your business because you know her and she doesn't want to make it awkward. It's not always friendly but she feels the classes are good for her health.\n\nIt sounds like you are coming up with reasons to excuse Mike for not greeting me when it would have been sufficient just to apologize for it and commit to it not happening again. I didn't \"bother\" to sign in at the desk because he was rude and I didn't want to speak with him. There were a fair amount of people at the free classes but the desk was not crowded either time when I got there and everyone except for me was acknowledged both times. I can't dismiss it as chance both times. Then you are commenting on the date of my review so as to discredit it. Unfortunately your response does not create any good faith, nor does it give me any motivation to return to the studio.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "1170 Burnhamthorpe Rd W Unit 28, Mississauga, ON L5C 4E6, Canada",
    "lat": 43.5679783,
    "lng": -79.66273330000001,
    "commentfeed": [
      {
        "text": "I enjoy myself every time I come here and also get a killer workout--there is a nice variety of classes and I'm pretty sure I have taken classes with each of the instructors. Everyone is super welcoming and helpful. The studio is always clean and the hot yoga room is top notch! The best part is the sense of community and how the owners, Mike and Lisa, are so passionate about their practice, and really try to make everyone feel welcome walking in. I love the encouraging atmosphere.",
        "rating": 5,
        "usernamefeed": "Natalie C"
      },
      {
        "text": "I’ve been going to the studio for just over six months and cannot say enough about Mike & Lisa plus their ace staff.  Great facility, wonderful teachers, superb classes, lots of solid advice, and mats + clothing for purchase.   Also a month ago I took both of my kids to one of Lisa’s kids classes and they have now fallen in love with yoga.",
        "rating": 5,
        "usernamefeed": "Grant Padley"
      },
      {
        "text": "I've been going to this studio for over 4 years and it is such a great yoga studio. I tried out a few others and when I found Mike and Lisa's studio I felt like I was home. The instructors are fabulous and atmosphere is very welcoming. Nothing but great energy and good vibes.",
        "rating": 5,
        "usernamefeed": "Olivia C"
      },
      {
        "text": "A few thoughts on Hot Yoga&Pilates Mississauga.. so now I'm a month and a half into my seventh year of practicing. (and Mike STILL welcomes me!) as do all instructors. If you searched the planet for the person least likely to practice yoga it would be me! Which is exactly the reason I love it. A studio designed for Bikram yoga from the front to the back, from the floor to the ceiling. Not some random cobbled together room with a couple space heaters and a vaporizer from Walmart, offering \"hot yoga\". This is the real deal. Classic 90, 60 for those with time restraints and a couple \"Yin\" classes for good measure. The Hot Inferno Pilates has to be experienced to be believed. Many do both. Or all three. A spotless well managed studio, qualified instructors that always make time to answer questions are the reasons it is consistently voted #1. In fact, if you are thinking of starting a business, you may want to use this one as a template.",
        "rating": 5,
        "usernamefeed": "Frank Ciccone"
      }
    ]
  },
  {
    "name": "Infinite Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNu6hFRtUW3yP0ko8EL-rqze2eQK_tTi3beiF5D=s1600-w1024-h1024",
    "rating": 3.9,
    "website": "https://www.infiniteyoga.ca/",
    "phone": "(416) 830-3418",
    "description": "Love the studio. I have been practicing here for 5+ years. The staff are wonderful.",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "4870 Tomken Rd, Mississauga, ON L4W 1J8, Canada",
    "lat": 43.625834,
    "lng": -79.62927079999997,
    "commentfeed": [
      {
        "text": "I have an accruing injuries for playing different kind of sports. I never thought that hot yoga can help my body gain flexibility and help my lower back releases tension and tightness. I been practicing hot yoga at Infinite Yoga Studio for years and I'm glad I did. The community that they created is great. People are nice, they treat you well, I tried different classes and meet different teachers and every one got  different style and practices and mostly respectful to the students. They show modifications, show's how to use props and also they show the proper alignment towards poses. What I really like is they make you are feel welcome every time you come to the studio. They talked to you and pay attention if you have any questions on how to improve your poses. Everyone has a favourite teacher and classes to attend, they alternate teachers and I also go different days and time depending with my availability from work. But ever since I'm glad that Infinite Yoga is part of my community and through yoga it teaches me how to be more aware of my body.",
        "rating": 5,
        "usernamefeed": "Anthony Dimitri"
      },
      {
        "text": "Spent $45 on Uber to go to their New Years 5pm Hot Yoga that they advertised. The place was closed.",
        "rating": 3,
        "usernamefeed": "Lamar Timmins"
      },
      {
        "text": "Highly recommend.\nChange room is clean and well kept. The staff are friendly and approachable. The class size (I go to the afternoon session) is perfect for a beginner like me. The instructors are helpful and offer suggestions and/or corrections so no injuries occur.\nI will absolutely be back again and again!",
        "rating": 5,
        "usernamefeed": "Mzzz Nono"
      },
      {
        "text": "On a delightful Saturday afternoon, I had the pleasure of attending a complementary class at Infinite Yoga in Mississauga. I have a rather thorough history with hot yoga, so I was excited to try a new studio.\nTo speak to the facility itself, it is mid sized with a good \"yoga vibe\". All I mean to say is that it's decorated well, and is somewhat calming. From what I saw, there are two large practice rooms and two change rooms. The mens change room has two small showers and enough space to get your business done, though they've opted for an open shelf rather than lockers. In their defence though, they're not the only studio that doesn't have lockers.\nThe class itself was A-OK. The instructor was a really welcoming lady, who kept the experience light hearted and jovial. The difficulty level of this particular class was more on the introductory side, (which I had no qualms with), but I've got a couple minor beefs. The first may be me nitpicking, but the way that the instructed coached our breathing seemed off. It felt like when the natural next breath was an inhale, she would advise an exhale, and vice versa. Am I high maintenance? Probably. Next up, I found that for a couple poses, the instruction lacked a bit of specificity that some great instructors have. The kind where you can go through the practice solely on vocal instruction and no peeping at your peers. Last up, is the temperature of the room. This is a matter of preference, but I'm definitely a HOT yoga fan. The heat and the humidity were on the lower end.\n\nWith all that being said, I'm generally happy with the experience, but I can't say that this studio stands out amoung other options. If it's convenient for you, go try it out.",
        "rating": 3,
        "usernamefeed": "Kojo Asante"
      }
    ]
  },
  {
    "name": "Parivartan Hot Yoga Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNmDCxFAIzl5hqBZ-PW9rvcWd5XlwgG290HPJK2=s1600-w1024-h1024",
    "rating": 4.3,
    "website": "http://www.parivartanyoga.com/",
    "phone": "(905) 897-8680",
    "description": "Really great place to begin or continue advancing your practice. Classes available for all levels. Teachers are very patient and knowledgeable offering a myriad of variations depending on student ability. I have been to  two classes so far and I’m really excited and inspired to continue going as long as I live in this area. \n\nThe studio is really clean and well maintained. The owner Michelle is very responsive and will address any concerns escalated to her in a very urgent, prompt and sincere way! 5 stars for Parivartan 🕉.",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "350 Burnhamthorpe Rd E #5A, Mississauga, ON L5A 3S5, Canada",
    "lat": 43.6003902,
    "lng": -79.62605280000002,
    "commentfeed": [
      {
        "text": "Has been my favourite studio for the past 8 years. Amazing, relaxed atmosphere, great instructors. The owner is awesome!!! Thank you Michelle for running this great studio at very competitive pricing ☺",
        "rating": 5,
        "usernamefeed": "Vesna S"
      },
      {
        "text": "Best thing that's ever happened to me when finding this gem of a studio.  Very welcoming and helpful.  I would recommend people to try this studio out.",
        "rating": 5,
        "usernamefeed": "#meandyou Louro"
      },
      {
        "text": "I've always felt welcomed in this studio, and became hooked on yoga after my first class there. I have been practicing here for years, and love the community aspect of the studio. The classes are fun and challenging and everyone is friendly. A great place for beginners and advanced yogis!",
        "rating": 5,
        "usernamefeed": "Cassandra Popescu"
      },
      {
        "text": "Wide variation of instructors and classes. There will be one for your personality type! If you like to be pushed or like to go at your own pace, there is an instructor to motivate you! Michelle and Dino both highly recommended! Also I like there is a non heated room with a perinatal trained instructor for modifications if you are pregnant. The two studios at the Mississauga branch are small, so come early to get your spot in the class! Only wish the rooms were bigger, but the place is very clean and non-intimidating.  ",
        "rating": 5,
        "usernamefeed": "Katherine Kure"
      }
    ]
  },
  {
    "name": "Le Refuge Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipOMsg3tvCwkRX0oqJusz9H9pH8MI3dUKhZLXmw5=s1600-w1024-h1024",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(416) 704-0238",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Showers",
      "Lockers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "241 Cossack Ct, Mississauga, ON L5B 4C2, Canada",
    "lat": 43.583818,
    "lng": -79.62810100000002,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },

  {
    "name": "Jaya Yoga Centre",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPUwXN21rnwUI2D1o3njVcx4NrtJn4gbDu8IDJn=s1600-w554-h272",
    "rating": 4.6,
    "website": "http://www.jayayoga.ca/",
    "phone": "(647) 352-5292",
    "description": "Wonderful, knowledgeable teachers ...and great studio space",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "121 Willowdale Ave, North York, ON M2N 6A3, Canada",
    "lat": 43.7651307,
    "lng": -79.39982939999999,
    "commentfeed": [
      {
        "text": "I originally tried Jaya when a regular instructor at another school left for a few weeks vacation. Now I have moved my whole practice there. It's a great school. The space is lovely, but the real draw are the teachers. I have tried all of them now, and they are all wonderful. Each is very different from the other, but having that variety of teaching styles keeps it interesting. I love it at Jaya and will never go anywhere else. I highly recommend it.",
        "rating": 5,
        "usernamefeed": "Joelle Stromberg"
      },
      {
        "text": "\"Recently found this gem of a studio and being injured during a hot yoga class at a studio nearby. Tired of the hot yoga workout world, I can't believe how lucky I was to stumble onto Jaya Yoga. Great teachers, well educated and extremely helpful and therapeutic! The studio itself is warm and inviting, and is the perfect addition to my day. The owner is as sweet and kind as could be, and the vibe of the whole place is extremely special. True community yoga studio with authentic teachings\"",
        "rating": 5,
        "usernamefeed": "monika czekaj"
      },
      {
        "text": "This studio is way to overpriced for what they offer. I went to prenatal yoga classes the regular instructor Tatjana is great. However she went on vacation and it was replaced by an inexperienced instructor who does difficult postures in very fast pace, most of them don't even recommended in pregnancy. ( I am a health teacher and I have a colleague who is an experienced yoga instructor so I know What I am talking about) Half of the class left. I deeply regret because  I purchased 6 weeks pass instead of drop in. Be aware that they are very quick in taking your money and very slow in giving your money back , even when the instructor doesn't show up at the classes.   I went to another yoga studio with more professional standards , really experienced instructors, including substitute ones and more affordable prices. The extra driving is worth it. I do not remand this unprofessional studio where you have hard time to contact them by email or phone.",
        "rating": 1,
        "usernamefeed": "Mario Luca"
      },
      {
        "text": "Wow, I strongly disagree with the one star reviewer... in comparison to the other studios in this beautiful city, Jaya Yoga actually has the fairest policies as I've had issues with other places and so was quite interested in the details of the next studio i committed to after i moved into this area. I had the pleasure of meeting the owner Jacqualine and have never met anyone so genuine and kind. I think any complaints on here are from people who just need to complain about something... and probably need way way way more yoga in their life to help with that. \nI really feel at home at this studio and it's so cozy and magical. Bonus - They have registered massage inside too. If you're looking for a great yoga experience and home base, then look no further!",
        "rating": 5,
        "usernamefeed": "FunkeeStuff CEO"
      }
    ]
  },
  {
    "name": "Moksha Yoga North York",
    "image": "https://lh3.googleusercontent.com/p/AF1QipOZtmOxCADpNSPT9B1f3ojdgF6PCGA0lwcvitVS=s1600-w1024-h1024",
    "rating": 4.8,
    "website": "https://north-york.mokshayoga.ca/",
    "phone": "(416) 225-6767",
    "description": "Best hot yoga studio ever. The place is very spacious, and they have amazing staff members. It’s very welcoming, warm and cozy place where everyone is respectful and friendly to each other. The programs are amazing, and the instructors are really great as well. I can’t recommend this place enough to my friends and family!",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "100 Sheppard Ave E #100, North York, ON M2N 6N5, Canada",
    "lat": 43.76320679999999,
    "lng": -79.40547279999998,
    "commentfeed": [
      {
        "text": "This studio is where I started doing yoga for the very first time. I've been to other studios since then, but Moksha (either North York or Thornhill locations that I have been to) have been distinctively different. I enjoy practicing at this studio so much because the staff and instructors are amazing! Every single instructor at Moksha is well trained and does a fabulous job providing instructions. This is one of the few studios where instructors take the time to observe each client and help ensure that they are doing the postures correctly. Also, Moksha is probably one of the few studios where you actually get to relax before and after class - there's a very good culture established amongst members to ensure they are respectful of each other's practice. The only downside with this location is that it gets crowded (specially in the evening and at night), and that there is limited free parking (and only at certain hours).",
        "rating": 4,
        "usernamefeed": "Sanaz Baradaran"
      },
      {
        "text": "It's an amazing place to learn yoga and go a little deeper to know yourself. I love the place from the very first class. It's super positive aura make every practice more meaningful. All the instructors are full of a positive aura. I love Tess and Jes specially. Cheers to the team and all the Yogis!!!",
        "rating": 5,
        "usernamefeed": "NA"
      },
      {
        "text": "Emily’s class are the BEST! She has a true gift. What a blessing.",
        "rating": 5,
        "usernamefeed": "Oren Epstein"
      },
      {
        "text": "I've been practicing regularly here for a few months now and I love it. It has great instructors, lots of classes and clean facilities. Also, a membership lets you practice at the North York and Thornhill locations which opens up even more great classes. Front desk is always professional and friendly.",
        "rating": 5,
        "usernamefeed": "Farah Ng"
      }
    ]
  },
  {
    "name": "Ca Wellness Clinic",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNXDwTHCv_eYdwGTNJHsn_OEIMFXmIFt4IP4WWp=s1600-w480-h409",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(647) 918-1750",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "4632 Yonge St Unit 203-C, North York, ON M2N 5M1, Canada",
    "lat": 43.757413,
    "lng": -79.41019699999998,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Hot Yoga TNT",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMKNoL8rMR1fP8o_9kC18oLl3drTb2jxja5BmX-=s1600-w1024-h1024",
    "rating": 4.4,
    "website": "http://www.hotyogatnt.com/",
    "phone": "(416) 226-0440",
    "description": "This class is great ! I haven’t practiced yoga in 2 years and I am so happy to be back. My body and mind is looking forward to it! I am new to this location, I traveled 1 hour to and from! and I am impressed! I witnessed and experienced the true meaning of practicing it regularly, love the medicinal part of yoga... what it does to your body. I want to thank  the teachers...I met Sarah, Linda, David, Hannah, Maria... your guidance is so important to us teaching step by step the proper way of deep breathing, the poses, and of course the caring attitude  it’s so encouraging! Their passion and compassion is tremendous! it’s  a nice ambience  and very close to the subway...teachers are sweet and welcoming.  it’s a total exercise of wellbeing and it’s true Yoga is medicine  for the soul and body. Highly recommend!",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "500 Sheppard Ave E #208, North York, ON M2N 6H7, Canada",
    "lat": 43.766762,
    "lng": -79.388848,
    "commentfeed": [
      {
        "text": "Very nice yoga studio with a variety of great instructors and class types. Amenities provided are adequate and staff is very friendly. Class sizes can get a bit full at times but that attests to the popularity of the place. The app makes it very easy to see the schedule and book classes",
        "rating": 5,
        "usernamefeed": "Ian Robert Lau"
      },
      {
        "text": "Went in for a stretch after being away for a while. The class was a killer and worth every drop of sweat. I felt so refreshed and energized! The heat is strong and helps warming up your body for that incredible 90 min stretch. \n\nI consider myself to be in a good shape, this practice is by far the most challenging thing that I have ever done. Not only do you sweat, stretch, build strength and endurance, you also gain many health benefits, increased lung capacity, and tremendous mental strength.  In addition to the many many physical benefits, you also gain self esteem and learn to have a very positive outlook on things.\n\nThe instructors are great, encouraging and helpful.\n\nThere is free parking which is always a plus.  This is a great  studio for advanced and beginner practitioners alike.\nOverall: I'm excited to go back.",
        "rating": 5,
        "usernamefeed": "Larissa Dedkova"
      },
      {
        "text": "So glad I found this studio. The teachers are excellent and encouraging and really know there stuff. I love that they encourage everyone to focus on proper posturing and not  forcing poses. The studio is big,bright and clean and lots of great time slots to choose classes from.  I really enjoy having the option of a 60 minute bikram class which allows me to make it to yoga more often.  Best studio I've been to!",
        "rating": 5,
        "usernamefeed": "Tania Barrie"
      },
      {
        "text": "I loved my membership at Hot Yoga TNT. This location is always kept clean so I would highly recommend coming here. I went to 5 classes so far  and have gotten pretty familiar with most of the staff at the studio. Most of the staff were nice and most of the teachers were welcoming and professional. Inferno Pilates is a great activity and so good for your body!",
        "rating": 5,
        "usernamefeed": "Marcelo Guevara"
      }
    ]
  },
  {
    "name": "Breath   Yoga Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM2jBsM938Sxx78_fiF-eRAyL3wXgFBU1Idv5lO=s1600-w1024-h818",
    "rating": 5,
    "website": "http://www.breatheuptownpilates.ca/",
    "phone": "(416) 301-6968",
    "description": "Uptown Pilates has definitely become my second home over the past few months. I have been doing Pilates for about 13 years and have gone to numerous studios around the world, but once I found this studio and owner Andrea I can honestly say that this is one of the best. This private studio is truly a safe haven, where you come to release your worries and connect with your inner strength. Andrea is beyond qualified; she makes sure you are in good form and feel comfortable. She will challenge you when needed but never farther then they know you can handle. I recommend Uptown Pilates to anyone who wants to try Pilates. Andrea has an attention to detail that you will not find anywhere else and you will also get a great workout. Her place is more then just a Pilates studio, she will support you as well and for that I am forever grateful.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "4750 Yonge St #302, North York, ON M2N 5M6, Canada",
    "lat": 43.7603729,
    "lng": -79.41111539999997,
    "commentfeed": [
      {
        "text": "As a beginner to Pilates, I’d highly recommend Breathe Uptown Pilates & Yoga Studio. The studio’s instructor, Andrea, caters to the individual needs of each person in her classes whether it’s your first day doing Pilates or your 100th.  Andrea takes the time to clearly explain the exercises and helps you make corrections as needed. She challenges you to do your best every class. Andrea's created a welcoming, relaxing and fun space.",
        "rating": 5,
        "usernamefeed": "Emilia Di Luca"
      },
      {
        "text": "Andrea is a really good pilates instructor. I had a great experience. She was patient and knowledgeable in her guidance with the reformer. I highly recommend her studio.",
        "rating": 5,
        "usernamefeed": "RMT-Jesse Van Rooi"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "raheleh abbaci"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Sylvia Gerz"
      }
    ]
  },
  {
    "name": "Iyengar YogAnanta",
    "image": "https://lh3.googleusercontent.com/p/AF1QipOnnbrSQrjBo-wZyvnluJdqkmdlLv8HkWlmXG4v=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.iyengaryogananta.com/",
    "phone": "(416) 931-2103",
    "description": "Outstanding and the best way to experience it is to come and check it out for oneself. I wish I could give 10 stars as 5 seem to be too little. Highly recommended.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "40 Devondale Ave, North York, ON M2R 2E2, Canada",
    "lat": 43.7779477,
    "lng": -79.43690509999999,
    "commentfeed": [
      {
        "text": "Iyengar Yogananta is one of the finest, cosiest, most welcoming studios in Toronto with the beautiful setting and ambiance and most importantly the classes are out of the world experience. My first class with Niren was life changing. He teaches, inspires and motivates you, as he says, to make yoga your way of life and not just a day on your calendar. \nHis passion, dedication and devotion to art of yoga and teaching and his constant generosity, support and care for all his students, one by one, is exceptional.",
        "rating": 5,
        "usernamefeed": "Jasmina Vicentijevic"
      },
      {
        "text": "A very pleasant, well equipped studio run by a very sincere teacher with tremendous experience who is committed to Guruji BKS Iyengar's  methodology.",
        "rating": 5,
        "usernamefeed": "E Kva"
      },
      {
        "text": "If you are sincere in your desire to seek a teacher, and true to yourself in your drive to practice, you will be undoubtedly thrilled to have discovered Iyengar Yogananta and Niren Pandya. This yoga studio is less about the thrills and trends of modern yoga and all about the raw fundamentals of yogasana as prescribed by the sutras of Patanjali.\n\nNo student is perfect and neither is the teacher. In my humble opinion, the mark of a fantastic teacher is greatly attributed to his/her openness and willingness to continuously evolve as a human being and as a practitioner. Where the student is constantly in learning mode, the teacher must also be able to switch from teaching to learning and back again. Few teachers (outside of the most 'advanced' Iyengar instructors) have this capacity and exhibit it the way in which I believe that Niren does.\n\nI would highly recommend Niren to anyone who is new to yogic practice or who has been practicing for years. That being said, you do not need my suggestion to discover this, you simply need to dedicate yourself to the practice and experience Niren's teaching for yourself.",
        "rating": 5,
        "usernamefeed": "Adamo Vittiglio"
      },
      {
        "text": "Niren is an excellent instructor with tremendous knowledge,  patience and wisdom.",
        "rating": 5,
        "usernamefeed": "Karen Haar"
      }
    ]
  },
  {
    "name": "Ashtanga Yoga Centre",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM28E0F0_mJh66ruU4A8gemMAnx-QeMCkyi3_Et=s1600-w1024-h1024",
    "rating": 4.7,
    "website": "https://www.ashtangatoronto.com/",
    "phone": "(647) 342-6550",
    "description": "I really like this Yoga place. The instructors are great, the location is great and the Mysore classes are great. I feel much better every time I go. It would be awesome if there were earlier weekend classes. But maybe that's just me.",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "3215a Yonge St, Toronto, ON M4N 2L3, Canada",
    "lat": 43.7281763,
    "lng": -79.40285779999999,
    "commentfeed": [
      {
        "text": "I'm from Saudi Arabia and recently practicing Ashtanga in Arab yoga foundation school AYF  .. I came to Canada for tourism and I found this amazing school for practicing.. it's really amazing and i love it. Also i highly recommended for Ashtangi people. ",
        "rating": 4,
        "usernamefeed": "Toots Samman"
      },
      {
        "text": "This place is amazing!!! Everyone is so friendly. I felt so welcomed the minute I entered the space. I took my first Mysore class, and the instructors were kind. They guided my practice the entire time. I felt so safe and they held the space so well. ",
        "rating": 5,
        "usernamefeed": "Yara Elarabi"
      },
      {
        "text": "Walked into my first Ashtanga Yoga class after a few months of home practice. The Studio is a beautiful and welcoming space, and every teacher I've had has had tremendous knowledge and personal attention to give. I'm often amazed at how even when the room is full, the teachers and assistants are always keeping a watchful eye on you and are able to be constantly assisting students. I'm excited to learn more! ",
        "rating": 5,
        "usernamefeed": "Allison A"
      },
      {
        "text": "The morning mysore practice was very high energy and very well attended.  David was not there when my wife and I visited.  We were very impressed with the three teachers working the mysore room.  They were on the move constantly assisting students.  They are well trained and welcoming.  My wife and I enjoyed the experience thoroughly.   We live and practice and Boston.  Whenever we visit Toronto, we will definitely return to this studio.",
        "rating": 5,
        "usernamefeed": "gary barsomian"
      }
    ]
  },
  {
    "name": "The Basement Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipP2m-CI_z-CRXpqULABdEM3U-RG_PiHIGnq6_td=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.thebasementyoga.com/",
    "phone": "(416) 901-0500",
    "description": "I teach there. Love it :)",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "626C Sheppard Ave W, North York, ON M3H 2S1, Canada",
    "lat": 43.7556336,
    "lng": -79.44050089999996,
    "commentfeed": [
      {
        "text": "Really great teachers. Every one here genuinely cares about their students. Smaller class sizes means more attention to perfecting your alignment and posture.",
        "rating": 5,
        "usernamefeed": "Nadia Kismet"
      },
      {
        "text": "Great instructors. ",
        "rating": 5,
        "usernamefeed": "Gennaro Cioffi"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Michael g"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Patricia Guillen"
      }
    ]
  },
  {
    "name": "Yoga Interlude",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTokEy8ji2nX9x7m8T5f8HQVPIlHV78wrqR5YlXWOeGfG3TkYUPcw",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(416) 787-7877",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Showers",
      "Lockers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "211 Cameron Ave, North York, ON M2N 1E8, Canada",
    "lat": 43.7543512,
    "lng": -79.42146450000001,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Yoga Centre Toronto",
    "image": "https://static1.squarespace.com/static/5a64ecbca9db0927e61518c1/5b47c746758d467d3e40c06e/5b871d0840ec9a1031039d86/1535581773070/returning.jpg?format=500w",
    "rating": 4.3,
    "website": "http://yogacentretoronto.ca/",
    "phone": "(416) 482-1334",
    "description": "Good to see a Iyengar Yoga style based studio - however for serious yoga aspirants, monthly membership is a must, which I don't see in the fees schedule.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "3366 Yonge St, Toronto, ON M4N 2M7, Canada",
    "lat": 43.73233889999999,
    "lng": -79.40449109999997,
    "commentfeed": [
      {
        "text": "A yoga centre is only as good as its word.",
        "rating": 1,
        "usernamefeed": "Steve Lanys-Morris"
      },
      {
        "text": "Amazing place! The instructors are incredibly knowledgeable. I highly recommend",
        "rating": 5,
        "usernamefeed": "Angela larocque"
      },
      {
        "text": "Excellent yoga studio. Teachers are well versed in Iyengar yoga. Always a pleasure to return. It is a very precise and strict type of yoga with many health benefits if done right. Rest assured the teachers at YCT know what they are doing.",
        "rating": 5,
        "usernamefeed": "Albert"
      },
      {
        "text": "The teachers at Yoga Centre Toronto are very experienced and friendly.  I have been doing yoga there for 8 years now.  Iyengar yoga is very precise and can help those with physical issues.\n\nI have great confidence that doing this type of yoga at Yoga Centre Toronto has been responsible for easing my muscle pains, for helping with my posture and for helping keep me healthy!  I don't know what I would do without them!",
        "rating": 5,
        "usernamefeed": "Vasant R"
      }
    ]
  },

  {
    "name": "YYOGA Queen Street West",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNNXONt3iAI9UQv_bRYd7fOO9Dnl3O6uiKGzzF1=s1600-w1024-h1024",
    "rating": 4.1,
    "website": "http://www.yyoga.ca/locations/queen-street-west",
    "phone": "(416) 792-2211",
    "description": "I joined Yyoga about 2 years ago from the fall season into spring for 7 months - I'm only writing a review now because of an issue I had recently redeeming my YRewards.  I frequented Yyoga about 3 or 4 times a week while a member and as such I got an email letting me know I had 2 free classes to use with an expiration date of 6 months.  I waited until the last minute to redeem these classes as I had joined another studio and the weekend I decided to go happened to be a long weekend - long story short they wouldn't make an exception or let me use one of my passes, and the person I spoke to on the phone said \"it was a free class anyway.\" This attitude brought back memories less than pleasant with Yyoga staff - they were on the pretentious side.  \nOn a positive note, I really enjoyed their fitness classes like spinning, high intensity interval training mixed with pilates (I think it was called YFit) and their yoga classes were great in teaching the fundamentals.  But, lately, I think there's been turnover and one of the classes I attended on one of the passes was one of the worst ones I had ever taken there.  I still consider myself a novice, but this particular class left me bored out of mind. \n Maybe it was just a one off and the teacher had a particular style that I just didn't get.\n\nI wrote an email to Yyoga Admin on their website and then I also responded to the email that sent me the complimentary passes.  Someone responded right away and added a pass to my account and I was quite pleased, but then I got another email saying that there was nothing they could do.  I'm still hesitant to redeem it given my recent experience taking a class there, dealing with front desk, and getting conflicting emails.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "333 Queen St W #327, Toronto, ON M5V 2A4, Canada",
    "lat": 43.64955529999999,
    "lng": -79.39202069999999,
    "commentfeed": [
      {
        "text": "Plenty of classes for people of all levels. Highly recommend the hot yoga body flow and core workouts if you're looking for a real workout. Classes appeal to males and females and all are welcome.",
        "rating": 5,
        "usernamefeed": "Vips"
      },
      {
        "text": "Am now a member after shopping around, great seniors rates, clean bright, instructors filled with skill and love.  Beautiful interior design, as Architects we value this gorgeously detailed and well thought out studios, washrooms, changing and grooming areas. The air in the hot classes stays fairly fresh, low odours, the ambience is healing, fun, and not too in your face about yoga philosophy. There is every kind of class, from hot to cool, plus fitness,  & spin classes. Ian Jarvie  is a great instructor in all areas. They have a 30 days for $40 pass, good in Toronto Vancouver and Whistler. It's easy to love this place, Queen West or Harbourfront.",
        "rating": 5,
        "usernamefeed": "WinnifredM Hu"
      },
      {
        "text": "Terrific studio which is well lite with natural light, high ceilings, and clean facilities.  If you're looking for the opposite of a dark and dirty yoga studio this is it.\n\nVariety of classes is the best kept secret, in addition to a large number of yoga classes they also offer spin and boot camp (called yfit) classes.  Good instructors too.  Been a member for over 2 years now.",
        "rating": 5,
        "usernamefeed": "Patrick Martin"
      },
      {
        "text": "I bought a 10 class pass earlier this year March I think). As I had bought the pass about 5 minutes before the class started, the girl who sold me the pass did not discuss the pass with me, she sold me the pass and I went right into the room as to ensure I wasn't late for class. I had met a friend there to take the class together (she had a 1 month pass), in front of the girl working the cash register I said to my fiend that I didn't  want to purchase a 1 month pass as I rearely come to yoga. The cashier hearing that did not point out to me that there was any expiration date on the pass.\n\nLong story short: I went to a class last week, the receptionist told me my class package had expired and if I wanted to take the class I needed to pay a drop in class fee. I asked to speak to the manager and nobody was there. She told me she would ask the manager to call me and I have not received a call back. I called again on Friday and left a message for the manager to call me, I received no call back. I tried again yesterday (Monday) and was told there was no one there, management would review my membership and if they decided to honour my membership they would call me, if they wouldn't honour it nobody would call me back. \nI called again today and an answering machine came on.\n\nTheir customer service is terrible, they will not honour your memberships and won't even call you back. It's a shame as I was happy enough with the place but I won't be going back as I feel ignored. It takes a long time to build trust with your clients and you can lose it in a minute.",
        "rating": 1,
        "usernamefeed": "Bonny Greene"
      }
    ]
  },
  {
    "name": "Yoga Tree Spadina",
    "image": "https://lh3.googleusercontent.com/p/AF1QipO1wLcnAWWHeNtca_mDJWzoyMheEQ1AnrB1VnBv=s1600-w1024-h1024",
    "rating": 4.5,
    "website": "http://www.yogatree.ca/richmondspadina/",
    "phone": "(416) 603-9642",
    "description": "This is one of my favourite yoga studios! The teachers are great, very friendly and helpful, and the classes are super fun. The studios are beautiful and clean.",
    "amenities": [
      "Parking",
      "Showers",
      "Lockers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "140 Spadina Ave, Toronto, ON M5V 2J4, Canada",
    "lat": 43.6477442,
    "lng": -79.39624529999998,
    "commentfeed": [
      {
        "text": "I've been a yogi of yoga tree for over 6 years now and it has been the best studio! \nThe staff are very caring and friendly. The studio is very clean and not cliche like some other downtown yoga studios. They have a really good schedule too. Would recommend!",
        "rating": 5,
        "usernamefeed": "Atina Chang"
      },
      {
        "text": "One of the brightest and most beautiful yoga studios I’ve been to in the city. The teachers are great and I love the environment they’ve cultivated here",
        "rating": 5,
        "usernamefeed": "Kiah Price"
      },
      {
        "text": "GOOD: Friendly staff, overall great yoga teachers with a wide variety of personalities and styles, the most rounded teachers I have found in downtown Toronto so mixing class types is recommended. SUPER Clean. Great location with excellent TTC access. Great schedule on weekdays, Good schedule on weekends (weekends could be better). Self locking lockers.\nBAD: The customers. A lot of the people that go here don't behave and out of all the studios I've been to, Yoga tree is the most lax in enforcing some decorum in their classes. Its common, in my experience, to see people on their cellphone in the studios (thankfully not during class), bringing Starbucks frappucinos and lattes into the studio and being really loud pre and post class. Really hard to relax before or after the class and get into the yoga mood here. I wish the teachers were more willing to confront bad behaviour.\nOVERALL: I really like this studio - the location, the schedule and most of all the teachers make it a winner its just too bad its chock full of stuck up and inconsiderate Queen Westers who can't live without their phone for 2 seconds.",
        "rating": 3,
        "usernamefeed": "Tom J"
      },
      {
        "text": "I love this cozy little studio, the teachers and staff are inviting and supportive.  The classes are challenging and the teachers provide great adjustments and guidance based on your experience, I leave classes feeling energized and refreshed. I always look forward to going to my next class at Yoga Tree.  Jelayna and Angela M. are two my favorite teachers!!",
        "rating": 5,
        "usernamefeed": "Diane Liang"
      }
    ]
  },
  {
    "name": "BeHot Yoga Toronto",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNk7aBUaAVTu4KIdR7EwOIypNk_UY7gWkQK_Pfl=s1600-w1024-h1024",
    "rating": 4.7,
    "website": "http://behotyogatoronto.com/",
    "phone": "(416) 203-2382",
    "description": "Clean studio and good teachers. Vinyasa and hitt hot Pilates are the most popular classes and they fill up quickly, you have to book them one week in advance. There aren’t many clases in the morning and there are many students which makes it feel very impersonal. Good place if you’re are lucky to book a class, get a polite greeting, find a spot in the crowded change room and just do your yoga.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "43 Colborne St, Toronto, ON M5E 1E3, Canada",
    "lat": 43.648881,
    "lng": -79.37510399999996,
    "commentfeed": [
      {
        "text": "This is my hot yoga place.  I go weekly and I love the vibe.",
        "rating": 5,
        "usernamefeed": "elle, Persephone"
      },
      {
        "text": "I'm fairly new to yoga but thank to the teachers at this studio I can consider myself a intermediate yogi. Amazing vibe!!!. The staff is wonderful and you can tell how much they love to be there! Always with a big smile on their faces.  They will make you LOVE yoga. Variety of classes and lots of times to fit your schedule. I strongly recommend this studio.",
        "rating": 5,
        "usernamefeed": "Sergio Marchetta"
      },
      {
        "text": "They will take your money and not let you into the class even if arrive on the dot. As a first comer booking through ClassPass you just don't know. Very bad customer experience.",
        "rating": 1,
        "usernamefeed": "Florent Joly"
      },
      {
        "text": "I love coming here best service",
        "rating": 5,
        "usernamefeed": "Jennifer Dawson"
      }
    ]
  },
  {
    "name": "Iam Yoga Downtown",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMwLoWGSeBKSj_n2HFnulJPyomC_48ll844-49t=s1600-w1024-h1024",
    "rating": 4.5,
    "website": "http://www.iamyoga.ca/",
    "phone": "(416) 597-8557",
    "description": "Great service. Love how many different kinds of classes they offer.",
    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "MetroCentre, 200 Wellington Street W Concourse, Unit 450, Toronto, ON M5V 3C7, Canada",
    "lat": 43.64585230000001,
    "lng": -79.38786340000001,
    "commentfeed": [
      {
        "text": "I have gone to several studios throughout the years and never have I felt more at home as I do here and have never seen such results in my practice . The classes are diverse, as are the instructors, and it is a fantastic place to grow your practice . The ambiance is also beautiful and extremely clean. I recommend this studio to beginners and advanced students.",
        "rating": 5,
        "usernamefeed": "A. HR"
      },
      {
        "text": "",
        "rating": 3,
        "usernamefeed": "Maryana Segin"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Grainne Archbold"
      }
    ]
  },

  {
    "name": "Yoga Tree Bay & Dundas",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM5_7e_evM3MLSI7oH7XUgOPPf6Fk6KVd3UCjHd=s1600-w1024-h1024",
    "rating": 4.4,
    "website": "http://www.yogatree.ca/bay-dundas/",
    "phone": "(416) 205-9642",
    "description": "The classes and teachers at this studio are spot on. They offer many different types of classes which I enjoy, from relaxed to more upbeat options for when I'm feeling a little more vigorous. They offer different levels and options for poses in all classes and are consistent in the type of yoga offered depending on the class. They also offer herbal tea and cucumber water which I love. It is very clean and professional. I wish I could respond to some of the less favourable reviews on here because they really aren't fair. It is respectful to show up to class a little early (even 5-10min is fine) and remember to read the class description so you know what type of class to expect. The classes I've attended are described quite accurately and I really enjoy the variety. This is a great studio for the beginner or for someone a little deeper into their practice. If you want a little homier feel, I suggest visiting their Spadina location which is also top notch 👍🏼",
    "amenities": [
      "Parking",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "123 Dundas St W, Toronto, ON M5G 1C4, Canada",
    "lat": 43.655337,
    "lng": -79.384481,
    "commentfeed": [
      {
        "text": "I am a yoga teacher visiting from out of town & I loved this space. The staff were very respectful & helpful when needed & the teachers were very clearly qualified & skilled. Thank you Yoga Tree! Would definitely come back to this location.",
        "rating": 5,
        "usernamefeed": "Divine Roots Yoga"
      },
      {
        "text": "I was visiting from out of town, and this was my first time coming to Yoga Tree. I really enjoyed my time spend here, I attended two classes over the weekend and found the entire staff & teachers to be very welcoming. The space is beautiful, and very clean. I would definatly come back next time I'm in Toronto!",
        "rating": 5,
        "usernamefeed": "camilla zambito"
      },
      {
        "text": "Negative reviews of this place seem to be because people have arrived late and not been let in as the class has started.  I can only speak from my own experience, which has been nothing but excellent for the last three months.  The studios are clean and well maintained, staff have always been friendly and the instructors have been great.",
        "rating": 5,
        "usernamefeed": "Doug Welch"
      },
      {
        "text": "This is the WORST YOGA STUDIO in downtown Toronto, for sure. If you like feeling relaxed during your hot yoga practice and interacting with fellow human beings at reception who understand that life gets in the way sometimes, then DO NOT COME TO THIS LOCATION.\n\nMy friend and I arrived just before a yoga class and due to the unpredictability of life, we were not able to arrive 15 minutes prior to the class as suggested on the website. \n\nThe staff responded to our arrival with such disrespect. I've never been treated with such disrespect. At a yoga studio, nonetheless.\n\nThe girl working the front, and her fellow staff members chatting behind her, regarded my friend and I with disdain as we quickly signed waivers before getting ready for class. I apologized to the girl for being a few minutes late - class was at 7:15, we arrived to the front at 7:13. She shook her head with disapproval and asked if I was already changed. I nodded yes. She directed me to the lockers and I, now feeling the pressure to rush to my yoga practice, quickly misplaced my token. \n\nI rushed back to the desk asking for a new token and the girl responded with sheer disgust by shoving a token into my hand saying, \"You know what, you are already so late for your practice you better just go in\". \n\nAll I have to say is that it is extremely counter-intuitive for a YOGA STUDIO  (or anywhere  for that matter) to disrespect potential clients. I entered my yoga practice feeling guilty and upset like I had disappointed the studio by being their non-ideal client. I'll forever be regretting paying $20 for that drop-in session. \n\nThank goodness that the yoga instructor was very understanding of my tardiness. I only wish that the whole studio would embrace that same positive, warm energy. \n\nI should add that another girl working at the front grunted at my friend who, not knowing where to return her rented mat, tried to return the mat to the front desk. The girl angrily said, \"You return that back there\". We didn't even know what to do with that response. Where is 'back there'? Back where, exactly? \n\nHonestly, nothing could keep us there any longer after that.\n\nI will definitely be practicing yoga elsewhere in the future and spreading the news that this studio has horrible customer service.",
        "rating": 1,
        "usernamefeed": "Quenlin Cain"
      }
    ]
  },
  {
    "name": "The Yoga Sanctuary",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNbTliYKVO5e-VpXj73IUyty9EbFgGK_EKaMi_5=s1600-w1024-h1024",
    "rating": 4.4,
    "website": "http://www.theyogasanctuary.ca/",
    "phone": "(416) 928-3236",
    "description": "My favourite yoga studio in Toronto!  The have great specials for new students!",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "1 Wood St, Toronto, ON M4Y 2N4, Canada",
    "lat": 43.661988,
    "lng": -79.38292999999999,
    "commentfeed": [
      {
        "text": "This studio has best teachers in the town!! They also cover a wide range of styles of yoga you can pick, and Mysore classes you can practise with teacher’s assistance. In additional warm staff and good location. I took the YTT250 there and it was one of the best experiences I had!",
        "rating": 5,
        "usernamefeed": "Sunnie Yao"
      },
      {
        "text": "Love this place. Lots of great classes, never been disappointed. Lately I've been attending a lot of Trisha Sevilla's classes. She is a wonderful instructor. She is always positive, smiling, and inspiring. Thanks Trisha!",
        "rating": 5,
        "usernamefeed": "Emily McDonough"
      },
      {
        "text": "I completed my YTT here and love the staff, the building and the vibes from TYS!   High quality teachers with zero ego & great intentions. Cynthia is an amazing human & a great leader which sets this place apart from others.",
        "rating": 5,
        "usernamefeed": "Kristy Rachkowski"
      },
      {
        "text": "Wonderful community feel. Loved every class and I've been there since October 2016. The instructors are great. The schedule is awesome too and has extended hours to fit every schedule (so you don't have any excuse not to go haha). Their late night classes from 8:45-10pm are especially great if you have to work late or want something to make you sleep like a baby. I always float home right into bed with a huge smile on my face.",
        "rating": 5,
        "usernamefeed": "Natasha Nesrine"
      }
    ]
  },
  {
    "name": "The Basement Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipP2m-CI_z-CRXpqULABdEM3U-RG_PiHIGnq6_td=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.thebasementyoga.com/",
    "phone": "(416) 901-0500",
    "description": "I teach there. Love it :)",

    "amenities": [
      "Parking",
      "Showers",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "350 Queens Quay W #204, Toronto, ON M5V 3A7, Canada",
    "lat": 43.6386709,
    "lng": -79.38911860000002,
    "commentfeed": [
      {
        "text": "Cute place, great if you live in the neighborhood. They offer various yoga classes, including hot yoga. They have tea, lockers and offer free yoga mats and other yoga accessories. Friendly staff and instructors. I used to do alot of yoga and more recently I started getting into it and i felt some 'open to beginner classes' were a bit intense, but it's great if you if you're open to that.",
        "rating": 4,
        "usernamefeed": "Tharmila Raja"
      },
      {
        "text": "I came here for hot yoga, but the room's temperature was only a bit warm. Really disappointing, as I get free regular yoga at my gym, and it felt not very different from that. \nThe teacher and facility are great though. I'm sure it's fine for regular yoga, but not hot yoga.",
        "rating": 3,
        "usernamefeed": "Solaris"
      },
      {
        "text": "Staff are great but the class times and scheduling at this location could be improved.",
        "rating": 4,
        "usernamefeed": "Alyssia Armborst"
      },
      {
        "text": "The place is clean and the vibes are great but their hours are ridiculous!! Who are they trying to target with their class times? Rich housewives who have nothing to do all day? They know that most people work 9-5 and they have ZERO MORNING CLASSES, and all their good evening classes start at 5:15 pm or 5:30 pm. There's no way I can make it there straight from work. Definitely not spending my money buying a membership I can't use!",
        "rating": 2,
        "usernamefeed": "Mina Mt"
      }
    ]
  },
  {

    "name": "Breath Uptown Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM2jBsM938Sxx78_fiF-eRAyL3wXgFBU1Idv5lO=s1600-w1024-h818",
    "rating": 5,
    "website": "http://www.breatheuptownpilates.ca/",
    "phone": "(416) 301-6968",
    "description": "Uptown Pilates has definitely become my second home over the past few months. I have been doing Pilates for about 13 years and have gone to numerous studios around the world, but once I found this studio and owner Andrea I can honestly say that this is one of the best. This private studio is truly a safe haven, where you come to release your worries and connect with your inner strength. Andrea is beyond qualified; she makes sure you are in good form and feel comfortable. She will challenge you when needed but never farther then they know you can handle. I recommend Uptown Pilates to anyone who wants to try Pilates. Andrea has an attention to detail that you will not find anywhere else and you will also get a great workout. Her place is more then just a Pilates studio, she will support you as well and for that I am forever grateful.",

    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "680 Yonge Street #2, Toronto, ON M4Y 1A6, Canada",
    "lat": 43.667429,
    "lng": -79.38574899999998,
    "commentfeed": [
      {
        "text": "I have many positive things to say about this studio: great teachers, nice staff, excellent location and studio, warm and welcoming atmosphere to all level yogis.\nHowever evening and weekend can be really busy at this location as a result popular classes can feel a bit over capacity which compromises the beautiful experience so far. \nI have never been turn down to a class when signing up in the app, but I do believe they should probably start marking classes as \"full\" like other studios do.\nYou set time aside to focus and honor your practice rather than focusing on trying to not hit another yogui involuntarily during class. I am writing this review in hopes that they address this issue. \nThanks for reading this.",
        "rating": 3,
        "usernamefeed": "Alejandra Gonzalez Guel"
      },
      {
        "text": "I first attended Iam Yoga a couple years back through a Groupon promotion. I was a little overwhelmed at first as it was my first experience practicing yoga publicly. That feeling changed quickly the more classes I took. The instructors are all so kind, talented and really care about your well being! After taking a bit of a break from yoga, I came back as an energy exchange student and the experience was fantastic! I really got to experience yoga on a new level and get more involved in the Iam Yoga community. I have met lots of wonderful like-minded people and my whole experience has lead me to join the Yoga Teacher training they offer :)\nI highly encourage everyone to give Iam yoga a chance and to also try to come in on off-peak hours. It can get busy in the evening, but that just shows how great of a place it is! \nThe studio has lots of different teachers and classes to explore so try as much as you can to get the best experience!",
        "rating": 5,
        "usernamefeed": "Jasmynn Taylor"
      },
      {
        "text": "An excellent variety of yoga practices for all levels to experience. At one point they had a teacher giving classes entirely in Sanskrit. \n\nThe staff is courteous and the prices reasonable. They usually offer fairly decent introductory offers if you're new and want to try them out.",
        "rating": 5,
        "usernamefeed": "Jesse Harley"
      },
      {
        "text": "It has a lot of class.\nVarious time,\nPerfect place to practice yoga",
        "rating": 5,
        "usernamefeed": "emmily JOO"
      }
    ]
  },
  {
    "name": "The Yoga Lounge",
    "image": "https://journeytoyoga10.com/wp-content/uploads/2018/01/intention.jpg",
    "rating": 4.5,
    "website": "http://theyogalounge.net/",
    "description": "The instructor was amazing! I did the vinyasa flow class which was a great workout, and also included a great finishing touch of lavender oil at the end.",
    "amenities": [
      "Wifi",
      "Lockers",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "80 Sherbourne St, Toronto, ON M5B 2B5, Canada",
    "lat": 43.65227900000001,
    "lng": -79.3688426,
    "commentfeed": [
      {
        "text": "Yoga Lounge is some of the best yoga in the city of Toronto. The instructors really know what they are doing and they are highly experienced - Particularly Susan, the owner, and Carlyn. Classes are intimate with special attention given to each student. Well worth the price.",
        "rating": 5,
        "usernamefeed": "Elyssa Seidman"
      },
      {
        "text": "I had hit a wall in my journey to get healthy. I was stuck at 223 pounds and could not get below this number for nothing.  So I thought I needed to shake things up and do some HOT YOGA. I went to go try Florence's Friday class at 7pm and then again to her 1pm class on Sunday. I loved it so much that I did her classes on Friday and Sunday again. What happened? I lost 10 pounds in 10 days and got down to 213 pounds!!!\n\nIf you have hit a wall in your weight loss I highly recommend Florence's Hot Yoga class.",
        "rating": 5,
        "usernamefeed": "Mark Makivirta"
      },
      {
        "text": "Great teachers, but the facility is not the best. BBQ style hot yoga heaters (space heaters directly above you)  are not my favourite, and the change rooms are small. besides that the door for the men's change area opens directly into the foyer. They're doing the best they can with such a small space. ",
        "rating": 3,
        "usernamefeed": "Conrad Siebert"
      },
      {
        "text": "It's not your spa like studio.  Lots of plants and resident cat max may not be everyone's cup of tea but there good teachers and I like the naturally lit class rooms Free mats although lots of old ones.  the focus is on hatha and restorative but does have non corporate branded hot yoga too which I didn't like but lots of regular students aren't all wrong. ",
        "rating": 4,
        "usernamefeed": "Lily Hua"
      }
    ]
  }

]