[
 {
    "name": "Iam Yoga Midtown",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNqfXMZKfoK255bGNkNp3aaj3sEJHnm6kto8Cnl=s1600-w720-h480",
    "rating": 4.2,
    "website": "http://www.iamyoga.ca/",
    "phone": "(416) 920-9642",
    "description": "I have been with Iam Yoga for a year and half now, and the only not so positive thing I have to say is the temperature control in your hot room. While most times I feel the temperature is set at a constant, lately (maybe because of the summer days) it became really frustratingly hot to the point that my skin feels burning whenever in contact with the floor. I also noticed some instructors do adjust the thermostat accordingly during practice, which is much appreciated, but NOT all of them. As a student, I can't really say or do anything in such situations besides having to walk out of the room...",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "680 Yonge Street #2, Toronto",
    "lat": 43.667429,
    "lng": -79.38574899999998,
    "commentfeed": [
      {
        "text": "I have many positive things to say about this studio: great teachers, nice staff, excellent location and studio, warm and welcoming atmosphere to all level yogis.\nHowever evening and weekend can be really busy at this location as a result popular classes can feel a bit over capacity which compromises the beautiful experience so far. \nI have never been turn down to a class when signing up in the app, but I do believe they should probably start marking classes as \"full\" like other studios do.\nYou set time aside to focus and honor your practice rather than focusing on trying to not hit another yogui involuntarily during class. I am writing this review in hopes that they address this issue. \nThanks for reading this.",
        "rating": 3,
        "usernamefeed": "Alejandra Gonzalez Guel"
      },
      {
        "text": "I first attended Iam Yoga a couple years back through a Groupon promotion. I was a little overwhelmed at first as it was my first experience practicing yoga publicly. That feeling changed quickly the more classes I took. The instructors are all so kind, talented and really care about your well being! After taking a bit of a break from yoga, I came back as an energy exchange student and the experience was fantastic! I really got to experience yoga on a new level and get more involved in the Iam Yoga community. I have met lots of wonderful like-minded people and my whole experience has lead me to join the Yoga Teacher training they offer :)\nI highly encourage everyone to give Iam yoga a chance and to also try to come in on off-peak hours. It can get busy in the evening, but that just shows how great of a place it is! \nThe studio has lots of different teachers and classes to explore so try as much as you can to get the best experience!",
        "rating": 5,
        "usernamefeed": "Jasmynn Taylor"
      },
      {
        "text": "An excellent variety of yoga practices for all levels to experience. At one point they had a teacher giving classes entirely in Sanskrit. \n\nThe staff is courteous and the prices reasonable. They usually offer fairly decent introductory offers if you're new and want to try them out.",
        "rating": 5,
        "usernamefeed": "Jesse Harley"
      },
      {
        "text": "It has a lot of class.\nVarious time,\nPerfect place to practice yoga",
        "rating": 5,
        "usernamefeed": "emmily JOO"
      }
    ]
  },
  {
    "name": "BeHot Yoga Toronto",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNk7aBUaAVTu4KIdR7EwOIypNk_UY7gWkQK_Pfl=s1600-w1024-h1024",
    "rating": 4.7,
    "website": "http://behotyogatoronto.com/",
    "phone": "(416) 203-2382",
    "description": "Clean studio and good teachers. Vinyasa and hitt hot Pilates are the most popular classes and they fill up quickly, you have to book them one week in advance. There aren’t many clases in the morning and there are many students which makes it feel very impersonal. Good place if you’re are lucky to book a class, get a polite greeting, find a spot in the crowded change room and just do your yoga.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "43 Colborne Street, Toronto",
    "lat": 43.648881,
    "lng": -79.37510399999996,
    "commentfeed": [
      {
        "text": "This is my hot yoga place.  I go weekly and I love the vibe.",
        "rating": 5,
        "usernamefeed": "elle, Persephone"
      },
      {
        "text": "I'm fairly new to yoga but thank to the teachers at this studio I can consider myself a intermediate yogi. Amazing vibe!!!. The staff is wonderful and you can tell how much they love to be there! Always with a big smile on their faces.  They will make you LOVE yoga. Variety of classes and lots of times to fit your schedule. I strongly recommend this studio.",
        "rating": 5,
        "usernamefeed": "Sergio Marchetta"
      },
      {
        "text": "They will take your money and not let you into the class even if arrive on the dot. As a first comer booking through ClassPass you just don't know. Very bad customer experience.",
        "rating": 1,
        "usernamefeed": "Florent Joly"
      },
      {
        "text": "I love coming here best service",
        "rating": 5,
        "usernamefeed": "Jennifer Dawson"
      }
    ]
  },
  {
    "name": "YYOGA Queen Street West",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNNXONt3iAI9UQv_bRYd7fOO9Dnl3O6uiKGzzF1=s1600-w1024-h1024",
    "rating": 4.1,
    "website": "http://www.yyoga.ca/locations/queen-street-west",
    "phone": "(416) 792-2211",
    "description": "I joined Yyoga about 2 years ago from the fall season into spring for 7 months - I'm only writing a review now because of an issue I had recently redeeming my YRewards.  I frequented Yyoga about 3 or 4 times a week while a member and as such I got an email letting me know I had 2 free classes to use with an expiration date of 6 months.  I waited until the last minute to redeem these classes as I had joined another studio and the weekend I decided to go happened to be a long weekend - long story short they wouldn't make an exception or let me use one of my passes, and the person I spoke to on the phone said \"it was a free class anyway.\" This attitude brought back memories less than pleasant with Yyoga staff - they were on the pretentious side.  \nOn a positive note, I really enjoyed their fitness classes like spinning, high intensity interval training mixed with pilates (I think it was called YFit) and their yoga classes were great in teaching the fundamentals.  But, lately, I think there's been turnover and one of the classes I attended on one of the passes was one of the worst ones I had ever taken there.  I still consider myself a novice, but this particular class left me bored out of mind. \n Maybe it was just a one off and the teacher had a particular style that I just didn't get.\n\nI wrote an email to Yyoga Admin on their website and then I also responded to the email that sent me the complimentary passes.  Someone responded right away and added a pass to my account and I was quite pleased, but then I got another email saying that there was nothing they could do.  I'm still hesitant to redeem it given my recent experience taking a class there, dealing with front desk, and getting conflicting emails.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "333 Queen Street West #327, Toronto",
    "lat": 43.64955529999999,
    "lng": -79.39202069999999,
    "commentfeed": [
      {
        "text": "Plenty of classes for people of all levels. Highly recommend the hot yoga body flow and core workouts if you're looking for a real workout. Classes appeal to males and females and all are welcome.",
        "rating": 5,
        "usernamefeed": "Vips"
      },
      {
        "text": "Am now a member after shopping around, great seniors rates, clean bright, instructors filled with skill and love.  Beautiful interior design, as Architects we value this gorgeously detailed and well thought out studios, washrooms, changing and grooming areas. The air in the hot classes stays fairly fresh, low odours, the ambience is healing, fun, and not too in your face about yoga philosophy. There is every kind of class, from hot to cool, plus fitness,  & spin classes. Ian Jarvie  is a great instructor in all areas. They have a 30 days for $40 pass, good in Toronto Vancouver and Whistler. It's easy to love this place, Queen West or Harbourfront.",
        "rating": 5,
        "usernamefeed": "WinnifredM Hu"
      },
      {
        "text": "Terrific studio which is well lite with natural light, high ceilings, and clean facilities.  If you're looking for the opposite of a dark and dirty yoga studio this is it.\n\nVariety of classes is the best kept secret, in addition to a large number of yoga classes they also offer spin and boot camp (called yfit) classes.  Good instructors too.  Been a member for over 2 years now.",
        "rating": 5,
        "usernamefeed": "Patrick Martin"
      },
      {
        "text": "I bought a 10 class pass earlier this year March I think). As I had bought the pass about 5 minutes before the class started, the girl who sold me the pass did not discuss the pass with me, she sold me the pass and I went right into the room as to ensure I wasn't late for class. I had met a friend there to take the class together (she had a 1 month pass), in front of the girl working the cash register I said to my fiend that I didn't  want to purchase a 1 month pass as I rearely come to yoga. The cashier hearing that did not point out to me that there was any expiration date on the pass.\n\nLong story short: I went to a class last week, the receptionist told me my class package had expired and if I wanted to take the class I needed to pay a drop in class fee. I asked to speak to the manager and nobody was there. She told me she would ask the manager to call me and I have not received a call back. I called again on Friday and left a message for the manager to call me, I received no call back. I tried again yesterday (Monday) and was told there was no one there, management would review my membership and if they decided to honour my membership they would call me, if they wouldn't honour it nobody would call me back. \nI called again today and an answering machine came on.\n\nTheir customer service is terrible, they will not honour your memberships and won't even call you back. It's a shame as I was happy enough with the place but I won't be going back as I feel ignored. It takes a long time to build trust with your clients and you can lose it in a minute.",
        "rating": 1,
        "usernamefeed": "Bonny Greene"
      }
    ]
  },
  
  {
    "name": "Iam Yoga Downtown",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMwLoWGSeBKSj_n2HFnulJPyomC_48ll844-49t=s1600-w1024-h1024",
    "rating": 4.5,
    "website": "http://www.iamyoga.ca/",
    "phone": "(416) 597-8557",
    "description": "Great service. Love how many different kinds of classes they offer.",
    "amenities": [
      "Parking",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "MetroCentre, 200 Wellington Street W Concourse, Unit 450, Toronto",
    "lat": 43.64585230000001,
    "lng": -79.38786340000001,
    "commentfeed": [
      {
        "text": "I have gone to several studios throughout the years and never have I felt more at home as I do here and have never seen such results in my practice . The classes are diverse, as are the instructors, and it is a fantastic place to grow your practice . The ambiance is also beautiful and extremely clean. I recommend this studio to beginners and advanced students.",
        "rating": 5,
        "usernamefeed": "A. HR"
      },
      {
        "text": "",
        "rating": 3,
        "usernamefeed": "Maryana Segin"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Grainne Archbold"
      }
    ]
  },
  {
    "name": "Yoga Tree Bay & Dundas",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM5_7e_evM3MLSI7oH7XUgOPPf6Fk6KVd3UCjHd=s1600-w1024-h1024",
    "rating": 4.4,
    "website": "http://www.yogatree.ca/bay-dundas/",
    "phone": "(416) 205-9642",
    "description": "The classes and teachers at this studio are spot on. They offer many different types of classes which I enjoy, from relaxed to more upbeat options for when I'm feeling a little more vigorous. They offer different levels and options for poses in all classes and are consistent in the type of yoga offered depending on the class. They also offer herbal tea and cucumber water which I love. It is very clean and professional. I wish I could respond to some of the less favourable reviews on here because they really aren't fair. It is respectful to show up to class a little early (even 5-10min is fine) and remember to read the class description so you know what type of class to expect. The classes I've attended are described quite accurately and I really enjoy the variety. This is a great studio for the beginner or for someone a little deeper into their practice. If you want a little homier feel, I suggest visiting their Spadina location which is also top notch 👍🏼",
    "amenities": [
      "Parking",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "123 Dundas Street West, Toronto",
    "lat": 43.655337,
    "lng": -79.384481,
    "commentfeed": [
      {
        "text": "I am a yoga teacher visiting from out of town & I loved this space. The staff were very respectful & helpful when needed & the teachers were very clearly qualified & skilled. Thank you Yoga Tree! Would definitely come back to this location.",
        "rating": 5,
        "usernamefeed": "Divine Roots Yoga"
      },
      {
        "text": "I was visiting from out of town, and this was my first time coming to Yoga Tree. I really enjoyed my time spend here, I attended two classes over the weekend and found the entire staff & teachers to be very welcoming. The space is beautiful, and very clean. I would definatly come back next time I'm in Toronto!",
        "rating": 5,
        "usernamefeed": "camilla zambito"
      },
      {
        "text": "Negative reviews of this place seem to be because people have arrived late and not been let in as the class has started.  I can only speak from my own experience, which has been nothing but excellent for the last three months.  The studios are clean and well maintained, staff have always been friendly and the instructors have been great.",
        "rating": 5,
        "usernamefeed": "Doug Welch"
      },
      {
        "text": "This is the WORST YOGA STUDIO in downtown Toronto, for sure. If you like feeling relaxed during your hot yoga practice and interacting with fellow human beings at reception who understand that life gets in the way sometimes, then DO NOT COME TO THIS LOCATION.\n\nMy friend and I arrived just before a yoga class and due to the unpredictability of life, we were not able to arrive 15 minutes prior to the class as suggested on the website. \n\nThe staff responded to our arrival with such disrespect. I've never been treated with such disrespect. At a yoga studio, nonetheless.\n\nThe girl working the front, and her fellow staff members chatting behind her, regarded my friend and I with disdain as we quickly signed waivers before getting ready for class. I apologized to the girl for being a few minutes late - class was at 7:15, we arrived to the front at 7:13. She shook her head with disapproval and asked if I was already changed. I nodded yes. She directed me to the lockers and I, now feeling the pressure to rush to my yoga practice, quickly misplaced my token. \n\nI rushed back to the desk asking for a new token and the girl responded with sheer disgust by shoving a token into my hand saying, \"You know what, you are already so late for your practice you better just go in\". \n\nAll I have to say is that it is extremely counter-intuitive for a YOGA STUDIO  (or anywhere  for that matter) to disrespect potential clients. I entered my yoga practice feeling guilty and upset like I had disappointed the studio by being their non-ideal client. I'll forever be regretting paying $20 for that drop-in session. \n\nThank goodness that the yoga instructor was very understanding of my tardiness. I only wish that the whole studio would embrace that same positive, warm energy. \n\nI should add that another girl working at the front grunted at my friend who, not knowing where to return her rented mat, tried to return the mat to the front desk. The girl angrily said, \"You return that back there\". We didn't even know what to do with that response. Where is 'back there'? Back where, exactly? \n\nHonestly, nothing could keep us there any longer after that.\n\nI will definitely be practicing yoga elsewhere in the future and spreading the news that this studio has horrible customer service.",
        "rating": 1,
        "usernamefeed": "Quenlin Cain"
      }
    ]
  },
  {
    "name": "Yoga Tree Richmond and Spadina",
    "image": "https://lh3.googleusercontent.com/p/AF1QipO1wLcnAWWHeNtca_mDJWzoyMheEQ1AnrB1VnBv=s1600-w1024-h1024",
    "rating": 4.5,
    "website": "http://www.yogatree.ca/richmondspadina/",
    "phone": "(416) 603-9642",
    "description": "This is one of my favourite yoga studios! The teachers are great, very friendly and helpful, and the classes are super fun. The studios are beautiful and clean.",
    "amenities": [
      "Parking",
      "Shower",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "140 Spadina Avenue, Toronto",
    "lat": 43.6477442,
    "lng": -79.39624529999998,
    "commentfeed": [
      {
        "text": "I've been a yogi of yoga tree for over 6 years now and it has been the best studio! \nThe staff are very caring and friendly. The studio is very clean and not cliche like some other downtown yoga studios. They have a really good schedule too. Would recommend!",
        "rating": 5,
        "usernamefeed": "Atina Chang"
      },
      {
        "text": "One of the brightest and most beautiful yoga studios I’ve been to in the city. The teachers are great and I love the environment they’ve cultivated here",
        "rating": 5,
        "usernamefeed": "Kiah Price"
      },
      {
        "text": "GOOD: Friendly staff, overall great yoga teachers with a wide variety of personalities and styles, the most rounded teachers I have found in downtown Toronto so mixing class types is recommended. SUPER Clean. Great location with excellent TTC access. Great schedule on weekdays, Good schedule on weekends (weekends could be better). Self locking lockers.\nBAD: The customers. A lot of the people that go here don't behave and out of all the studios I've been to, Yoga tree is the most lax in enforcing some decorum in their classes. Its common, in my experience, to see people on their cellphone in the studios (thankfully not during class), bringing Starbucks frappucinos and lattes into the studio and being really loud pre and post class. Really hard to relax before or after the class and get into the yoga mood here. I wish the teachers were more willing to confront bad behaviour.\nOVERALL: I really like this studio - the location, the schedule and most of all the teachers make it a winner its just too bad its chock full of stuck up and inconsiderate Queen Westers who can't live without their phone for 2 seconds.",
        "rating": 3,
        "usernamefeed": "Tom J"
      },
      {
        "text": "I love this cozy little studio, the teachers and staff are inviting and supportive.  The classes are challenging and the teachers provide great adjustments and guidance based on your experience, I leave classes feeling energized and refreshed. I always look forward to going to my next class at Yoga Tree.  Jelayna and Angela M. are two my favorite teachers!!",
        "rating": 5,
        "usernamefeed": "Diane Liang"
      }
    ]
  },
  {
    "name": "The Yoga Sanctuary",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNbTliYKVO5e-VpXj73IUyty9EbFgGK_EKaMi_5=s1600-w1024-h1024",
    "rating": 4.4,
    "website": "http://www.theyogasanctuary.ca/",
    "phone": "(416) 928-3236",
    "description": "My favourite yoga studio in Toronto!  The have great specials for new students!",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "1 Wood Street, Toronto",
    "lat": 43.661988,
    "lng": -79.38292999999999,
    "commentfeed": [
      {
        "text": "This studio has best teachers in the town!! They also cover a wide range of styles of yoga you can pick, and Mysore classes you can practise with teacher’s assistance. In additional warm staff and good location. I took the YTT250 there and it was one of the best experiences I had!",
        "rating": 5,
        "usernamefeed": "Sunnie Yao"
      },
      {
        "text": "Love this place. Lots of great classes, never been disappointed. Lately I've been attending a lot of Trisha Sevilla's classes. She is a wonderful instructor. She is always positive, smiling, and inspiring. Thanks Trisha!",
        "rating": 5,
        "usernamefeed": "Emily McDonough"
      },
      {
        "text": "I completed my YTT here and love the staff, the building and the vibes from TYS!   High quality teachers with zero ego & great intentions. Cynthia is an amazing human & a great leader which sets this place apart from others.",
        "rating": 5,
        "usernamefeed": "Kristy Rachkowski"
      },
      {
        "text": "Wonderful community feel. Loved every class and I've been there since October 2016. The instructors are great. The schedule is awesome too and has extended hours to fit every schedule (so you don't have any excuse not to go haha). Their late night classes from 8:45-10pm are especially great if you have to work late or want something to make you sleep like a baby. I always float home right into bed with a huge smile on my face.",
        "rating": 5,
        "usernamefeed": "Natasha Nesrine"
      }
    ]
  },
  {
    "name": "YYOGA Harbourfront",
    "image": "https://lh3.googleusercontent.com/p/AF1QipO7UWvoEhvY8_6naBArjngBNHN07xHfFIyKD9Df=s1600-w1024-h1024",
    "rating": 3.8,
    "website": "https://yyoga.ca/locations/harbourfront",
    "phone": "(416) 240-6175",
    "description": "Went to my first class here yesterday and loved it! Really nice facility, the teacher was amazing, and the temperature in the room was just right to be challenging but not unbearable! If I wasn’t visiting from out of town, this would be my new go-to yoga studio!",
    "amenities": [
      "Parking",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "350 Queens Quay West #204, Toronto",
    "lat": 43.6386709,
    "lng": -79.38911860000002,
    "commentfeed": [
      {
        "text": "Cute place, great if you live in the neighborhood. They offer various yoga classes, including hot yoga. They have tea, lockers and offer free yoga mats and other yoga accessories. Friendly staff and instructors. I used to do alot of yoga and more recently I started getting into it and i felt some 'open to beginner classes' were a bit intense, but it's great if you if you're open to that.",
        "rating": 4,
        "usernamefeed": "Tharmila Raja"
      },
      {
        "text": "I came here for hot yoga, but the room's temperature was only a bit warm. Really disappointing, as I get free regular yoga at my gym, and it felt not very different from that. \nThe teacher and facility are great though. I'm sure it's fine for regular yoga, but not hot yoga.",
        "rating": 3,
        "usernamefeed": "Solaris"
      },
      {
        "text": "Staff are great but the class times and scheduling at this location could be improved.",
        "rating": 4,
        "usernamefeed": "Alyssia Armborst"
      },
      {
        "text": "The place is clean and the vibes are great but their hours are ridiculous!! Who are they trying to target with their class times? Rich housewives who have nothing to do all day? They know that most people work 9-5 and they have ZERO MORNING CLASSES, and all their good evening classes start at 5:15 pm or 5:30 pm. There's no way I can make it there straight from work. Definitely not spending my money buying a membership I can't use!",
        "rating": 2,
        "usernamefeed": "Mina Mt"
      }
    ]
  },
  {
    "name": "The Yoga Lounge",
    "image": "https://images.pexels.com/photos/374101/pexels-photo-374101.jpeg",
    "rating": 4.5,
    "website": "http://theyogalounge.net/",
    "description": "The instructor was amazing! I did the vinyasa flow class which was a great workout, and also included a great finishing touch of lavender oil at the end.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "80 Sherbourne Street, Toronto",
    "lat": 43.65227900000001,
    "lng": -79.3688426,
    "commentfeed": [
      {
        "text": "Yoga Lounge is some of the best yoga in the city of Toronto. The instructors really know what they are doing and they are highly experienced - Particularly Susan, the owner, and Carlyn. Classes are intimate with special attention given to each student. Well worth the price.",
        "rating": 5,
        "usernamefeed": "Elyssa Seidman"
      },
      {
        "text": "I had hit a wall in my journey to get healthy. I was stuck at 223 pounds and could not get below this number for nothing.  So I thought I needed to shake things up and do some HOT YOGA. I went to go try Florence's Friday class at 7pm and then again to her 1pm class on Sunday. I loved it so much that I did her classes on Friday and Sunday again. What happened? I lost 10 pounds in 10 days and got down to 213 pounds!!!\n\nIf you have hit a wall in your weight loss I highly recommend Florence's Hot Yoga class.",
        "rating": 5,
        "usernamefeed": "Mark Makivirta"
      },
      {
        "text": "Great teachers, but the facility is not the best. BBQ style hot yoga heaters (space heaters directly above you)  are not my favourite, and the change rooms are small. besides that the door for the men's change area opens directly into the foyer. They're doing the best they can with such a small space. ",
        "rating": 3,
        "usernamefeed": "Conrad Siebert"
      },
      {
        "text": "It's not your spa like studio.  Lots of plants and resident cat max may not be everyone's cup of tea but there good teachers and I like the naturally lit class rooms Free mats although lots of old ones.  the focus is on hatha and restorative but does have non corporate branded hot yoga too which I didn't like but lots of regular students aren't all wrong. ",
        "rating": 4,
        "usernamefeed": "Lily Hua"
      }
    ]
  },

   {
    "name": "Yoga Netwok of Canada Yoga Teacher Training",
    "image": "https://lh3.googleusercontent.com/p/AF1QipPKntiY4A5DnVfgZv9sRGcIwmJgvekL5LhjMJQ=s1600-w1024-h1024",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(416) 662-3785",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "30 Eglinton Avenue West #258, Mississauga",
    "lat": 43.6056743,
    "lng": -79.65275429999997,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Hatch Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMQ8N-L9M1Qiu-QL51VDVoiFTbTBsaKolT6QW0y=s1600-w1024-h1024",
    "rating": 4.8,
    "website": "http://www.hatchyoga.com/",
    "phone": "(905) 232-2292",
    "description": "Hatch is a wonderful and welcoming studio! The instructors are lovely, varying class times and a beautiful (+clean) studio. Its a win win! Personally I love and recommend the restorative practice on Mondays at 8pm!",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "626 Burnhamthorpe Road West #202, Mississauga",
    "lat": 43.58023619999999,
    "lng": -79.6500332,
    "commentfeed": [
      {
        "text": "There aren't enough words to say just how amazing this Yoga studio is! If you are anything like me, a newbie to Yoga, this is the place to start. Setting aside the obvious amazing intro deal of $30 for your first month of unlimited classes, The people and staff are just as amazing. I was so nervous and shy to start this new Yoga journey in fear or not being able to do poses correctly and feeling like an outsider, but every instructor made sure that wasn't the case. They were all so friendly and encouraging I never once felt intimidated. Every class made me feel confident and proud and it made going back more and more that much easier. I'm incredibly sad that I will be moving away and won't be able to take Hatch Yoga with me, but I will definitely be returning on days I am ever back in town. If you ever look at expanding up north, be sure to let me know :) Namaste.",
        "rating": 5,
        "usernamefeed": "Erica Sarasua-Reid"
      },
      {
        "text": "Hatch Yoga is an oasis of serenity in the middle of Mississauga. Every detail is finely tuned so that yogi and yogini of all levels of experience feel at home and get most out of their practice. \n\nThe instructors are knowledgeable, provide variations to accommodate practitioners of different levels, and create a nurturing environment. The class variety is outstanding: there are heated, warm, and non-heated classes that vary from restorative to vinyasa to arm balances. \n\nThirty minutes between classes allow the practitioners to come early (or leave late) and get into that first flow, meditate, or surrender into a relaxation pose. Being able to take a nice nap after restorative classes was a total game-changer for me ;) .\n\nAbove all else, everyone knows everybody by name. You are treated like family: members are initiated into the mysteries of proper alignment in a series of complimentary semi-private classes by the studio director herself. If you never had semi-private or private yoga classes, these will transform your practice. Proper alignment is the key to enjoying the full benefits of the poses, deepening your practice, and preventing injury.\n\nYoga is transformational, and Hatch Yoga is the perfect place for practice.",
        "rating": 5,
        "usernamefeed": "M P"
      },
      {
        "text": "I first heard about this studio from groupon, I really enjoy it! The instructors are fabulous and there’s plenty of class variety. The classes are also smaller and intimate so there’s more 1 on 1 time with the instructors and lots of space for you (I can’t stand when you can barely stretch your arms out due to over crowding). There’s also lots of parking which is a plus. I highly recommend this studio!",
        "rating": 5,
        "usernamefeed": "Jessica S"
      },
      {
        "text": "It is a nice place to practice yoga. They have enough everything to make us feel comfortable. The facility is nice and clean. The instructors are knowledgeable and helpful. The classes are not big so the instructor can look after every single one there. I would recommend this place for someone who are interested in learning yoga.",
        "rating": 5,
        "usernamefeed": "Tri Duong"
      }
    ]
  },
  {
    "name": "Power Yoga Canada City Centre",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNRV_suRDAssiwmJ_nUvvL45Y0N7Hr-SD1gBmE7=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.poweryogacanada.com/city-centre",
    "phone": "(905) 949-9997",
    "description": "Amazing place with awesome offerings. Sarah and Tania are very warm and welcoming! They are attentive to every detail.I strongly recommend this community for its instructors and programs. Thank you!",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "925 Rathburn Road East Unit B1, Mississauga",
    "lat": 43.61608299999999,
    "lng": -79.61757599999999,
    "commentfeed": [
      {
        "text": "The location of PYC City Centre is so convienant. The staff and EE's are awesome! 9:30 am classes are the BEST way to start the day. So happy a PYC opened up in this area 🙌🙌🙌",
        "rating": 5,
        "usernamefeed": "Nicole Henry"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Kristina Pancevski"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Sarah Desiree"
      }
    ]
  },
  {
    "name": "Mind to Body Yoga & Fitness",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM66JbtakGhGSzkDx7VfbzOj5xVK_zw-uZTXSZI=s1600-w1024-h1024",
    "rating": 4.8,
    "website": "http://mindtobody.ca/",
    "phone": "(905) 712-9642",
    "description": "Mind to Body is a wonderful and welcoming yoga studio for all. Levels \nGreat teachers that really know their stuff also the members are very friendly \nThis studio is very clean  and  well taken care of \nPritpal is amazing! I did my yoga teachers training here and I was very pleased with the entire program I left the program with such Great knowledge for yoga  and life long friends\nJust try it for a week you won't be disappointed :)",
    "amenities": [
      "Parking",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "75 Watline Avenue #137, Mississauga",
    "lat": 43.6227244,
    "lng": -79.67128819999999,
    "commentfeed": [
      {
        "text": "I come to Mississauga for business and found this studio when I looked out my hotel window.  \n\nCan’t recommend this place more highly - I’ve taken several of their hot classes and they are amazing.  Not pretentious in the least and very willing to help a novice yogi!!  Just finished tonight’s hot power core class - awesome!\n\nCan’t wait until my next trip up from Massachusetts!!  Namaste.",
        "rating": 5,
        "usernamefeed": "Tanya"
      },
      {
        "text": "I recently completed my Restorative Yoga Teacher Training with Pritpal Singh @ Mind To Body Yoga & Fitness. I highly recommend this studio to anyone who may be interested in yoga certifications, upgrading courses or to simply enjoy the practice & benefits of yoga. The studio itself is  very clean, calming & roomy; any props required are available for use for free. Pritpal was an amazing teacher; she is knowledgeable, interesting, witty, kind & patient. Her warm manner was infectious! Her demonstrations & notes were easy to follow & understand. Originally, I dreaded spending an entire weekend in class but, to my surprise, the training was so enjoyable & interesting that it seemed to be over in the blink of an eye & I ended up wishing it lasted longer! Many thanks for your exceptional guidance Pritpal! All the best, dina",
        "rating": 5,
        "usernamefeed": "Dani Dowle"
      },
      {
        "text": "I just recently completed my 200-HR Yoga Teacher Training here at Mind to Body and can attest to it having been a wonderful experience.  The owner and program coordinator is kind, approachable, understanding, knowledgeable and helpful.  The studio is beautiful, clean and staff is friendly.  Yoga teachers associated with this studio are also great.  Highly recommend checking this place out.",
        "rating": 4,
        "usernamefeed": "Sasha Flows"
      },
      {
        "text": "I have just finished my 60 day intro program and did not hesitate to enrol in an annual membership! Just to echo some of the previous reviews this is an amazing place. The instructors are awesome, you feel supported and guided in each and every class, there is a common bond between all the yogis here no matter what your level is. The variety of classes offered gives you even more opportunity to explore on your yoga journey. I can't imagine practising anywhere else! Thanks everyone for being so friendly and welcoming.",
        "rating": 5,
        "usernamefeed": "Stephen Thomas"
      }
    ]
  },
  {
    "name": "moksha yoga square one",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNfWLe898cP89cDcFqZbBGkVIJcoXpjv3ENA-qm=s1600-w1024-h1024",
    "rating": 4,
    "website": "http://www.mokshayogasquareone.com/",
    "phone": "(905) 232-0165",
    "description": "I love this studio, the teachers and the staff. The classes are amazing. My body and sleep really appreciate it. Thanks... Moksha Yoga Square One =)",
    "amenities": [
      "Parking",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "4175 Confederation Parkway #5, Mississauga",
    "lat": 43.58880299999999,
    "lng": -79.64948729999998,
    "commentfeed": [
      {
        "text": "The most gracious studio I have ever been to! The staff are super supportive and really care about the people who come in. I hurt myself and couldn't make it in for a week, and without asking they called me to extend my 1 month pass since I hadn't visited in a while. Instantly brightened my day; a true testament to their culture and sense of community.",
        "rating": 5,
        "usernamefeed": "Rachel Cheng"
      },
      {
        "text": "It’s an absolutely wonderful community of people. Sabrina, Pearl, Normando on the drums and the live musicians that come play are fantastic. I highly recommend this facility to anyone that needs to relax and have a peace of mind, and have a great workout! Any issues I ever have the staff know exactly how to handle the issue with the best care.",
        "rating": 5,
        "usernamefeed": "Olivia Ha"
      },
      {
        "text": "The people that work here are very friendly! Something amazing happened to me that I will always remember. I lost a wallet 3 years ago at this location and it was recently found with everything inside intact. Special thanks to Pearl for assisting me.",
        "rating": 5,
        "usernamefeed": "John Lazo"
      },
      {
        "text": "Nice clean studio with good high energy classes. Most of the teachers are very good. The only negative is the parking. Sometimes it's hard to get a place in the underground lot. If you park on the street you have to pay. It's only $2.00 but I really don't want to pay more than what I already have paid to attend class. ",
        "rating": 4,
        "usernamefeed": "Michael Bairstow"
      }
    ]
  },
  {
    "name": "Hot Yoga and Pilates",
    "image": "https://lh3.googleusercontent.com/p/AF1QipP58BLD21NwLVUUtcv-vTXXDrojc-PDy9UOaN3z=s1600-w1024-h1024",
    "rating": 4.7,
    "website": "http://www.hotyogaandpilates.com/",
    "phone": "(289) 521-1468",
    "description": "I enjoy myself every time I come here and also get a killer workout--there is a nice variety of classes and I'm pretty sure I have taken classes with each of the instructors. Everyone is super welcoming and helpful. The studio is always clean and the hot yoga room is top notch! The best part is the sense of community and how the owners, Mike and Lisa, are so passionate about their practice, and really try to make everyone feel welcome walking in. I love the encouraging atmosphere.",
    "amenities": [
      "Parking",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "1170 Burnhamthorpe Road West Unit 28, Mississauga",
    "lat": 43.5679783,
    "lng": -79.66273330000001,
    "commentfeed": [
      {
        "text": "I've been here a few times with a friend (who comes more often) when they have had a promotion for a free class. Interestingly, both times I came, Mike was teaching the class and both times, when I walked in, he greeted everyone except me, like I was invisible! I felt bad the first time but chalked it up to an oversight. However, the second time it happened I was angry and that is why I'm posting the review. I ended up not signing in at the desk either time, although I know you are supposed to. My friend mentioned some instructors aren't that friendly or helpful but she likes the classes and its close to her house so she comes anyway. She also said that Mike was the owner so I was especially not impressed. Customer service is important even more for owners!\n\nThe classes were okay but I feel they are overpriced even if you buy on a promotion. I go to another yoga studio where we get corrections to our poses much more often, and I prefer it that way. Here, only a few students get corrections even though many people are doing wrong things.\n\nOverall, I would not recommend this place and don't plan on going back for any more free classes. I want to be treated well when I'm doing my yoga.\n\nUpdate: In response to the owner's reply:\n\nHello Lisa,\n\nThank you for your message. You are right in that I did not write the review immediately. I was reminded of my experiences when I got together with my friend yesterday for dinner. You said my review is unfair, I don't agree. For instance, according to her, when she signs in some instructors sometimes just make sure she scans the tag, they don't say hello, they just say thanks when the tag scans. Some instructors don't always say hello when she says hi to them, they just look at her to make sure the tag scans. She would never review your business because you know her and she doesn't want to make it awkward. It's not always friendly but she feels the classes are good for her health.\n\nIt sounds like you are coming up with reasons to excuse Mike for not greeting me when it would have been sufficient just to apologize for it and commit to it not happening again. I didn't \"bother\" to sign in at the desk because he was rude and I didn't want to speak with him. There were a fair amount of people at the free classes but the desk was not crowded either time when I got there and everyone except for me was acknowledged both times. I can't dismiss it as chance both times. Then you are commenting on the date of my review so as to discredit it. Unfortunately your response does not create any good faith, nor does it give me any motivation to return to the studio.",
        "rating": 2,
        "usernamefeed": "Sonia Aryd"
      },
      {
        "text": "I’ve been going to the studio for just over six months and cannot say enough about Mike & Lisa plus their ace staff.  Great facility, wonderful teachers, superb classes, lots of solid advice, and mats + clothing for purchase.   Also a month ago I took both of my kids to one of Lisa’s kids classes and they have now fallen in love with yoga.",
        "rating": 5,
        "usernamefeed": "Grant Padley"
      },
      {
        "text": "A few thoughts on Hot Yoga&Pilates Mississauga.. so now I'm a month and a half into my seventh year of practicing. (and Mike STILL welcomes me!) as do all instructors. If you searched the planet for the person least likely to practice yoga it would be me! Which is exactly the reason I love it. A studio designed for Bikram yoga from the front to the back, from the floor to the ceiling. Not some random cobbled together room with a couple space heaters and a vaporizer from Walmart, offering \"hot yoga\". This is the real deal. Classic 90, 60 for those with time restraints and a couple \"Yin\" classes for good measure. The Hot Inferno Pilates has to be experienced to be believed. Many do both. Or all three. A spotless well managed studio, qualified instructors that always make time to answer questions are the reasons it is consistently voted #1. In fact, if you are thinking of starting a business, you may want to use this one as a template.",
        "rating": 5,
        "usernamefeed": "Frank Ciccone"
      },
      {
        "text": "I've been going to this studio for over 4 years and it is such a great yoga studio. I tried out a few others and when I found Mike and Lisa's studio I felt like I was home. The instructors are fabulous and atmosphere is very welcoming. Nothing but great energy and good vibes.",
        "rating": 5,
        "usernamefeed": "Olivia C"
      }
    ]
  },
  {
    "name": "YogaStudio@Vyaniti Canada",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNLIkOfs6lXHaNVlx0SODhIiEr18Oqiwds1SEJz=s1600-w595-h277",
    "rating": 5,
    "website": "https://yogastudiovyaniticanada.business.site/",
    "phone": "(647) 640-7370",
    "description": "Vyaniti yoga studio headed by Praveen has been spreading the good news about Yoga and its healing powers. Starting from breathing right to correct stretches to healthy eating to sleeping right, managing stress, being energetic and fresh  throughout the day and many more powers of Yoga are taught in Vyaniti. \nI have experienced the healing powers of Yoga and very happy to be part of Vyanti.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "455 Apache Court #102, Mississauga",
    "lat": 43.61866389999999,
    "lng": -79.6488521,
    "commentfeed": [
      {
        "text": "I had not done a \"real\" yoga for the past five years, so I decided on a restorative class. I couldn't be happier of my decision.  \nI was also really impressed by how much attention yoga instructor (Praveen) paid to my needs and made modifications to avoid back and neck pains. I went through lung problems and was on Ventilator support for 3 weeks. The breathing techniques taught by Praveen really helped me strengthen lungs. Even my doctor is impressed by this improvement.\nOverall this was an incredibly positive experience. I wish I lived closer and attended class in person!",
        "rating": 5,
        "usernamefeed": "Sandhya Rao"
      },
      {
        "text": "I have learnt yoga from various places and practiced on and off. Though I have not taken in person classes with Praveen, the guru at Yogatherapy4all Canada, he has guided me and responded promptly every single time I had a query- be it on asanas or breathing or meditation. He is a living example of the true power of yoga- the inner peace and mental strength he demonstrates vouch for that. He exemplifies selfless giving -teaching and sharing his knowledge with anyone that is interested. If you need a dose of strength or positivity, you know which guru to reach out to!",
        "rating": 5,
        "usernamefeed": "Viji Karthikeyan"
      },
      {
        "text": "This yoga institute is excellent.  Its completely diffrent from the standard North America class of yoga as we leave the yoga class with principles that we can practice in our daily lives.  The yoga instructor / guru takes unbelievable amount of extra time after and before class for questions and any clarifications we need.  I started taking these classes because I experienced lack of energy levels mid-end of day.  But the breathing exercises, particular arsanas, and eating habits I have learnt from this class have helped me so much!  My energy levels have increased dramatically and I am able to get so much out of my day!",
        "rating": 5,
        "usernamefeed": "S Abbas"
      },
      {
        "text": "Yogatherapy4all’s mainly focuses on systematic building of inner strength and inner peace, more importantly how to apply yogic principals in day to day life. One of the important principle is not to stop breathing while performing asana’s which you hold for more counts, only after joining this studio I realised that I would hold my breath while focusing on some issue in daily life. Right breathing is what yoga instructor(Praveen) makes you practice through out the class which you will remember even after class. This studio offers practice schedule based on you needs and health conditions rather than a set of asana’s to be followed by all.\nIn short Yogatherapy4all makes sure every student inculcates yogic principles in daily life and be strong, peaceful, positive, happy 😊 and spread the same around you!!\nI am a happier person now :)\nKudos to amazing class and guru!!",
        "rating": 5,
        "usernamefeed": "Gajelli Jyotsna"
      }
    ]
  },
  {
    "name": "Parivartan Mississauga Hot Yoga Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNmDCxFAIzl5hqBZ-PW9rvcWd5XlwgG290HPJK2=s1600-w1024-h1024",
    "rating": 4.3,
    "website": "http://www.parivartanyoga.com/",
    "phone": "(905) 897-8680",
    "description": "Really great place to begin or continue advancing your practice. Classes available for all levels. Teachers are very patient and knowledgeable offering a myriad of variations depending on student ability. I have been to  two classes so far and I’m really excited and inspired to continue going as long as I live in this area. \n\nThe studio is really clean and well maintained. The owner Michelle is very responsive and will address any concerns escalated to her in a very urgent, prompt and sincere way! 5 stars for Parivartan 🕉.",
    "amenities": [
      "Parking",
      "Shower",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "350 Burnhamthorpe Road East #5A, Mississauga",
    "lat": 43.6003902,
    "lng": -79.62605280000002,
    "commentfeed": [
      {
        "text": "Has been my favourite studio for the past 8 years. Amazing, relaxed atmosphere, great instructors. The owner is awesome!!! Thank you Michelle for running this great studio at very competitive pricing ☺",
        "rating": 5,
        "usernamefeed": "Vesna S"
      },
      {
        "text": "Best thing that's ever happened to me when finding this gem of a studio.  Very welcoming and helpful.  I would recommend people to try this studio out.",
        "rating": 5,
        "usernamefeed": "#meandyou Louro"
      },
      {
        "text": "I've always felt welcomed in this studio, and became hooked on yoga after my first class there. I have been practicing here for years, and love the community aspect of the studio. The classes are fun and challenging and everyone is friendly. A great place for beginners and advanced yogis!",
        "rating": 5,
        "usernamefeed": "Cassandra Popescu"
      },
      {
        "text": "Wide variation of instructors and classes. There will be one for your personality type! If you like to be pushed or like to go at your own pace, there is an instructor to motivate you! Michelle and Dino both highly recommended! Also I like there is a non heated room with a perinatal trained instructor for modifications if you are pregnant. The two studios at the Mississauga branch are small, so come early to get your spot in the class! Only wish the rooms were bigger, but the place is very clean and non-intimidating.  ",
        "rating": 5,
        "usernamefeed": "Katherine Kure"
      }
    ]
  },
  {
    "name": "Infinite Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipNu6hFRtUW3yP0ko8EL-rqze2eQK_tTi3beiF5D=s1600-w1024-h1024",
    "rating": 3.9,
    "website": "https://www.infiniteyoga.ca/",
    "phone": "(416) 830-3418",
    "description": "Love the studio. I have been practicing here for 5+ years. The staff are wonderful.",
    "amenities": [
      "Parking",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "4870 Tomken Road, Mississauga",
    "lat": 43.625834,
    "lng": -79.62927079999997,
    "commentfeed": [
      {
        "text": "I have an accruing injuries for playing different kind of sports. I never thought that hot yoga can help my body gain flexibility and help my lower back releases tension and tightness. I been practicing hot yoga at Infinite Yoga Studio for years and I'm glad I did. The community that they created is great. People are nice, they treat you well, I tried different classes and meet different teachers and every one got  different style and practices and mostly respectful to the students. They show modifications, show's how to use props and also they show the proper alignment towards poses. What I really like is they make you are feel welcome every time you come to the studio. They talked to you and pay attention if you have any questions on how to improve your poses. Everyone has a favourite teacher and classes to attend, they alternate teachers and I also go different days and time depending with my availability from work. But ever since I'm glad that Infinite Yoga is part of my community and through yoga it teaches me how to be more aware of my body.",
        "rating": 5,
        "usernamefeed": "Anthony Dimitri"
      },
      {
        "text": "Spent $45 on Uber to go to their New Years 5pm Hot Yoga that they advertised. The place was closed.",
        "rating": 3,
        "usernamefeed": "Lamar Timmins"
      },
      {
        "text": "Highly recommend.\nChange room is clean and well kept. The staff are friendly and approachable. The class size (I go to the afternoon session) is perfect for a beginner like me. The instructors are helpful and offer suggestions and/or corrections so no injuries occur.\nI will absolutely be back again and again!",
        "rating": 5,
        "usernamefeed": "Mzzz Nono"
      },
      {
        "text": "On a delightful Saturday afternoon, I had the pleasure of attending a complementary class at Infinite Yoga in Mississauga. I have a rather thorough history with hot yoga, so I was excited to try a new studio.\nTo speak to the facility itself, it is mid sized with a good \"yoga vibe\". All I mean to say is that it's decorated well, and is somewhat calming. From what I saw, there are two large practice rooms and two change rooms. The mens change room has two small showers and enough space to get your business done, though they've opted for an open shelf rather than lockers. In their defence though, they're not the only studio that doesn't have lockers.\nThe class itself was A-OK. The instructor was a really welcoming lady, who kept the experience light hearted and jovial. The difficulty level of this particular class was more on the introductory side, (which I had no qualms with), but I've got a couple minor beefs. The first may be me nitpicking, but the way that the instructed coached our breathing seemed off. It felt like when the natural next breath was an inhale, she would advise an exhale, and vice versa. Am I high maintenance? Probably. Next up, I found that for a couple poses, the instruction lacked a bit of specificity that some great instructors have. The kind where you can go through the practice solely on vocal instruction and no peeping at your peers. Last up, is the temperature of the room. This is a matter of preference, but I'm definitely a HOT yoga fan. The heat and the humidity were on the lower end.\n\nWith all that being said, I'm generally happy with the experience, but I can't say that this studio stands out amoung other options. If it's convenient for you, go try it out.",
        "rating": 3,
        "usernamefeed": "Kojo Asante"
      }
    ]
  },

  {
    "name": "Balanced Life Yoga",
    "image": "https://lh3.googleusercontent.com/p/AF1QipOEPzf5Pt81EaHiaxzebsvs2OmI6MGsIWyUutx-=s1600-w960-h960",
    "rating": 4,
    "website": "http://www.balancedlifeyoga.ca/",
    "phone": "(905) 428-2300",
    "description": "Started practicing yoga at this studio at a young age. Welcoming, inviting, respectful and inspiring community. Amazing and kind people who create beautifully sequenced classes.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "274 Mackenzie Avenue #250, Ajax",
    "lat": 43.84235160000001,
    "lng": -79.02970979999998,
    "commentfeed": [
      {
        "text": "Wrong account. Apologies. That's my work account. Here is proper info: After beginning training there I found it is more of a business than a sacred space. Seeing behind the scenes really ruined it for me, I went home crying twice after heavy judgement from Shasta. I was consistently intimidated by the senior staff and felt I had to prove my worthiness which is not in the spirit of yoga. As someone with a disability I was tossed, charged thousands of dollars, and held to an impossibly high standard where I was met with criticism rather than education. The studio has a very fake atmosphere where I consistently felt out of place, even when I was just a student. Overall, I wouldn't recommend...especially for anyone who struggles with any type of special needs or disability.",
        "rating": 1,
        "usernamefeed": "Zee Malvern"
      },
      {
        "text": "The founder Sasha and her team are amazing. Professional, positive and friendly environment. They always make you feel welcomed each time you enter and motivate you to reach your goals. Excellent studio and amazing products. Stories are shared and goals are reached. A must try for all people who want some positivity in their lives. An amazing place to be and learn. Be respectful,friendly and have an open mind to learn from instructors who are experienced and have a passion to teach and answer any questions you may have.",
        "rating": 5,
        "usernamefeed": "Live Learn"
      },
      {
        "text": "Balanced Life yoga completely changed my life for the better. Reiki healing, the various workshop and class offerings along with the Inspiring Spirit 200 hour teacher training - I have been a member of this incredible community for 3 years and as a result my fears have truly dissolved and my life has become abundant and enriching. There is always such a welcoming and comforting positive energy held in this amazing space. I have met lifelong sisters and mentors. Through this community I finally feel I have found my true self and place in this world and I cannot express the gratitude I have to Shasta for attracting and creating such a powerful and amazing community and to all the members and teachers who were called and said yes. I love you all and wish you peace and love always - Anyone with an opportunity to come here, you may not know for what or why- trust in it and I promise you will not regret it!",
        "rating": 5,
        "usernamefeed": "Nadia Y"
      },
      {
        "text": "Cindy's beginner classes are amazing. Great for anyone who has never done yoga, or those who want to really learn the proper way to do things. The drop in classes I've been to have also been fantastic. Very friendly and warm atmosphere.",
        "rating": 5,
        "usernamefeed": "Pia Kaukoranta"
      }
    ]
  },
  {
    "name": "Ahimsa Yoga Whitby",
    "image": "https://lh3.googleusercontent.com/p/AF1QipN0i_os2CWdTSDvhZE4Xq8SwMvrVm11edwLMM2b=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.ahimsayoga.com/",
    "phone": "(905) 999-0429",
    "description": "Love and inclusion radiates out of JP. He teaches from his heart and lives yoga as opposed to just doing yoga. I always love when there is a discussion or learning in a class, and the class I attended was just that. Adjustments are very important to me in a class- to take me deeper and to focus breath. There were two people performing them which was amazing.",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "3, 100 Dundas Street West, Whitby",
    "lat": 43.8799405,
    "lng": -78.9423559,
    "commentfeed": [
      {
        "text": "I really enjoy Rebecca's class, she is doing such a great job.",
        "rating": 5,
        "usernamefeed": "rosemarie reichl"
      },
      {
        "text": "Great yoga studio. Famtastic teachers, classes and workshops. Easy parking.",
        "rating": 5,
        "usernamefeed": "Doug Brick"
      },
      {
        "text": "Wonderful staff and AMAZING classes.  I recommend this studio to all :)",
        "rating": 5,
        "usernamefeed": "Audrianna Martin Del Campo"
      },
      {
        "text": "Friendly , welcoming and very helpful",
        "rating": 5,
        "usernamefeed": "Shelley Shaubel"
      }
    ]
  },
  {
    "name": "Anahata Yoga Therapy",
    "image": "https://lh3.googleusercontent.com/p/AF1QipMJjVkDsPQVE6v4fkxpNCCqUvbYAI5mCx4w-Ukx=s1600-w1024-h1024",
    "rating": 5,
    "website": "http://www.anahatayogatherapy.net/",
    "phone": "(905) 431-9656",
    "description": "I've never found a better place to do yoga!",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "11 Atkinson Court, Ajax",
    "lat": 43.8602164,
    "lng": -79.01513749999998,
    "commentfeed": [
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Rocco Zambri"
      }
    ]
  },
  {
    "name": "Glow Yoga Studio",
    "image": "https://lh3.googleusercontent.com/p/AF1QipODIxsmkzM6ZSAKO__CBBV5M8FK9c2DQHwrRSLl=s1600-w980-h980",
    "rating": 5,
    "website": "http://www.glowyogastudio.ca",
    "phone": "(905) 668-4569",
    "description": "Fantastic facilities, both on Brock Street and coronation road, and Carol and her team do a fantastic job of providing both fantastic workout and magical energy",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 10,
    "location": "4535 Coronation Road, Whitby",
    "lat": 43.9183578,
    "lng": -78.9895555,
    "commentfeed": [
      {
        "text": "This studio is so incredibly beautiful, surrounded by gorgeous nature. Imagine doing yoga in the midst of hearing a water fountain from a pond just outside and the sounds of birds and trees blowing in the wind. I had the opportunity to do a class in the outside studio made of wood surrounded by trees. I also went to a workshop which was filled with the aroma of sacred frankincense. I did another restorative class in the winter and the walk alone down the hill and into the studio was like a trip to heaven. It's just gorgeous and serenity for your mind. The instructors teach from their heart. They are all so kind and provide hands on support. I am so happy to be a part of the studio. I cannot wait to take more classes!",
        "rating": 5,
        "usernamefeed": "Therisita Meditation"
      },
      {
        "text": "Such a great welcoming studio.",
        "rating": 5,
        "usernamefeed": "kelly graff"
      },
      {
        "text": "Need a stretch? Visit Glow Yoga and they will provide you with the Top Notch exercises and advice that you need:) They are trusted, proven by the Top Choice Award survey as they were voted the Top yoga studio in the Durham region..",
        "rating": 5,
        "usernamefeed": "David Silvestre"
      },
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "Francoise Bosse"
      }
    ]
  },
  {
    "name": "YogaBliss",
    "image": "https://lh3.googleusercontent.com/p/AF1QipM9Y0A2e84LRAl-fn9lbZteumyMXu3bg82fp3k=s1600-w960-h960",
    "rating": 5,
    "website": "http://yogabliss.me/",
    "phone": "(905) 903-9642",
    "description": "I came in with my friend for the first time to Yoga Bliss and immediately were welcomed in. It's always a little nerve wracking entering a new studio, but the environment was so comforting and nonjudgmental. The studio itself is absolutely beautiful, and a true gem to the Whitby core. Our class was lead by Nienke who was a wonderful teacher -very thorough, and knowledgeable. We did Yin yoga -I have insomnia, and at the best of times cannot sleep -by the end of her class I was so relaxed and zen that I could have passed out happily! I can not wait to make this part of my weekly routine!",
    "amenities": [
      "Wifi",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ed82075c5c1909b7d6d8",
      "username": "Lucia"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 10,
    "location": "105 Colborne Street West, Whitby",
    "lat": 43.87866100000001,
    "lng": -78.94201399999997,
    "commentfeed": [
      {
        "text": "",
        "rating": 5,
        "usernamefeed": "stan griffiths"
      }
    ]
  },
  {
    "name": "Livewithspirit.ca",
    "image": "https://lh3.googleusercontent.com/p/AF1QipORn8nHopf2JKs5nJw_7xtAb2vnQ946VSGsMSmW=s1600-w1024-h1024",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(905) 620-1151",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "101 Mary Street West, Whitby",
    "lat": 43.88142999999999,
    "lng": -78.94318199999998,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Yoga Group Inc",
    "image": "https://images.pexels.com/photos/374101/pexels-photo-374101.jpeg",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(905) 426-4022",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Locker",
      "Smoothie Bar"
    ],
    "author": {
      "id": "5bd5ec87075c5c1909b7d6d5",
      "username": "Priyanka"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "Yes"
    ],
    "cost": 12,
    "location": "Ajax",
    "lat": 43.84666319999999,
    "lng": -79.01916720000003,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "P3 Yoga Zone",
    "image": "https://images.pexels.com/photos/374101/pexels-photo-374101.jpeg",
    "rating": 4,
    "website": "http://sampleyogastudio.com",
    "phone": "(905) 409-8861",
    "description": "This is a good yoga studio! 12+ styles from stretchy to sweaty,  heated and non-heated, for all levels of practice.",
    "amenities": [
      "Parking",
      "Shower",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5ed2c075c5c1909b7d6d7",
      "username": "Deepika"
    },
    "classes": [
      "Hatha Yoga",
      "Hot Yoga",
      "Prenatal Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 30,
    "location": "1050 Brock Road #20, Pickering",
    "lat": 43.835112,
    "lng": -79.06953699999997,
    "commentfeed": [
      {
        "text": "This is good yoga studio. I love it!",
        "rating": 4,
        "usernamefeed": "Alex Parrish"
      }
    ]
  },
  {
    "name": "Hot Yoga",
    "image": "https://images.pexels.com/photos/374101/pexels-photo-374101.jpeg",
    "rating": 4,
    "phone": "(905) 426-1998",
    "description": "",
    "amenities": [
      "Parking",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hot Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "377 Mackenzie Avenue, Ajax",
    "lat": 43.84053249999999,
    "lng": -79.02724739999996,
    "commentfeed": []
  },
  {
    "name": "Moksha Yoga",
    "image": "https://images.pexels.com/photos/374101/pexels-photo-374101.jpeg",
    "rating": 4.5,
    "website": "http://pickering.mokshayoga.ca/",
    "phone": "(905) 831-4888",
    "description": "Great place to keep your stress levels all time low.. i love moksha hot yoga classes\nThey do need improvement in yin yoga and meditation but still a good place for yoga over all with nice small studio",
    "amenities": [
      "Parking",
      "Locker",
      "Wifi"
    ],
    "author": {
      "id": "5bd5eccd075c5c1909b7d6d6",
      "username": "Alice"
    },
    "classes": [
      "Hatha Yoga",
      "Bikram Yoga",
      "Vinyasa Yoga"
    ],
    "beginners": [
      "No"
    ],
    "cost": 20,
    "location": "1099 Kingston Road, Pickering",
    "lat": 43.8279394,
    "lng": -79.09720670000002,
    "commentfeed": [
      {
        "text": "Been coming here for 2 years now and loving the studio more and more each time.  The teachers and staff are friendly and knowledgeable.  Talk to them before and after the class if you have any concerns.  The hot yoga series are challenging yet flexible.   The place is age and gender friendly and I love seeing a diverse class.  If you sign up for an account on the online booking system, you can even earn points and trade for class or yoga wear.   If you are still unsure,  get the intro month pass for a great deal.",
        "rating": 5,
        "usernamefeed": "Yvonne Ouyang"
      },
      {
        "text": "Changed my life",
        "rating": 5,
        "usernamefeed": "Emran Singh"
      },
      {
        "text": "Hot yoga at Moksha rocks, great time everytime",
        "rating": 5,
        "usernamefeed": "Terri J"
      },
      {
        "text": "Great hot yoga. Instructors are really nice and knowledgeable. ",
        "rating": 5,
        "usernamefeed": "Mich D"
      }
    ]
  }
]